<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_289.html]
* At UTC datetime: [2023-08-19 10:06:29.308708]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 289.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1052;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QMediaPlayer (&#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMediaPlayer</b>  &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qmediaplayer.html" target="_blank"><b>https://doc.qt.io/qt-5/qmediaplayer.html</b></a>):
</p><ul>
 <li> <b>setMedia (&lt;QMediaContent&gt;)</b>   - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; (&#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080;&#1083;&#1080; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;)   &#1076;&#1083;&#1103;   &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;.   &#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;   &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;   &#1074;   &#1074;&#1080;&#1076;&#1077;   &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QMediaContent</b>. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;-&#1092;&#1072;&#1081;&#1083;&#1072;:
</p><div class="fon"><pre>
  mp = QtMultimedia.QMediaPlayer()
  mc = QtMultimedia.QMediaContent(QtCore.QUrl.fromLocalFile (<span class="pech">r"c:\media\song1.mp3"</span>)) 
  mp.setMedia(mc)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1075;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;:
</p><div class="fon"><pre>
  mp.setMedia(QtCore.QUrl(<span class="pech">r"http://www.someradio.ru/playlist.m3u8"</span>))
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
</p><p align="JUSTIFY">
 </p></li><li> <b>media ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaContent</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setPlaylist (&lt;QMediaPlaylist&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;  &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1087;&#1083;&#1077;&#1081;&#1083;&#1080;&#1089;&#1090; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlaylist</b>). &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1087;&#1083;&#1077;&#1081;&#1083;&#1080;&#1089;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>playlist ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1083;&#1077;&#1081;&#1083;&#1080;&#1089;&#1090; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlaylist</b>);
<p align="JUSTIFY">
 </p></li><li> <b>currentMedia ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083; &#1079;&#1072;&#1076;&#1072;&#1085; &#1086;&#1076;&#1080;&#1085; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setMedia()</b>, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086; &#1078;&#1077;, &#1095;&#1090;&#1086; &#1080; &#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; 
<b>media()</b>. &#1045;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083; &#1079;&#1072;&#1076;&#1072;&#1085; &#1087;&#1083;&#1077;&#1081;&#1083;&#1080;&#1089;&#1090;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1087;&#1083;&#1077;&#1081;&#1083;&#1080;&#1089;&#1090;&#1072;, &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103;&#1097;&#1091;&#1102;&#1089;&#1103; &#1074;  &#1076;&#1072;&#1085;&#1085;&#1099;&#1081;  &#1084;&#1086;&#1084;&#1077;&#1085;&#1090;.  &#1042;  &#1083;&#1102;&#1073;&#1086;&#1084;   &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;  &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1086;&#1077;  &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;  &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaContent</b>;
<p align="JUSTIFY">
 </p></li><li> <b>play ()</b> - &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>stop ()</b> - &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>pause ()</b> - &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> 	<b>state ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlayer</b>:
<ul>
 <li> <b>StoppedState (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1083;&#1080;&#1073;&#1086; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086;, &#1083;&#1080;&#1073;&#1086; &#1077;&#1097;&#1077; &#1085;&#1077; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1083;&#1086;&#1089;&#1100;;
 </li><li> <b>PlayingState (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1076;&#1077;&#1090; &#1074;&#1086;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;;
 </li><li> <b>PausedState (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1085;&#1072; &#1087;&#1072;&#1091;&#1079;&#1091;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>duration ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>position ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>isSeekable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>setPosition (&lt;<i>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setVolume (&lt;<i>&#1043;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 (&#1079;&#1074;&#1091;&#1082; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;) &#1076;&#1086; 100 (&#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;). &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>volume ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 100;
<p align="JUSTIFY">
 </p></li><li> <b>setMuted (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1079;&#1074;&#1091;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1078;&#1085;&#1102;&#1102; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>isMuted ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1079;&#1074;&#1091;&#1082; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPlaybackRate (&lt;<i>&#1057;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1086;&#1081; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1091;&#1084;&#1085;&#1086;&#1078;&#1072;&#1077;&#1084;&#1086;&#1077; 
&#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1077;&#1077; &#1085;&#1086;&#1074;&#1091;&#1102; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1.0 &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;, &#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1077; 1.0 - &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1085;&#1085;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100;, &#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;&#1077; 1.0 - &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1085;&#1091;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>playbackRate ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1089;&#1082;&#1086;&#1088;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setVideoOutput (&lt;QVideoWidget&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1091;&#1102; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QVideoWidget</b>. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>mediaStatus ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlayer</b>:
<ul>
 <li> <b>UnknownMediaStatus (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;;
 </li><li> <b>NoMedia (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;;
 </li><li> <b>LoadingMedia (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1080;&#1076;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;;
 </li><li> <b>LoadedMedia (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1072;;
 </li><li> <b>StalledMedia (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1080;&#1079;-&#1079;&#1072; &#1086;&#1087;&#1091;&#1089;&#1090;&#1086;&#1096;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1075;&#1086; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1080;&#1083;&#1080; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1087;&#1086;&#1088;&#1094;&#1080;&#1102; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;;
 </li><li> <b>BufferingMedia (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1080;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1075;&#1086; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>BufferedMedia (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1073;&#1091;&#1092;&#1077;&#1088; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;, &#1080;&#1076;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;;
 </li><li> <b>EndOfMedia (<i>&#1080;&#1083;&#1080;</i> 7)</b> - &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1077;&#1085;&#1086;;
 </li><li> <b>InvalidMedia (<i>&#1080;&#1083;&#1080;</i> 8)</b> - &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085; (&#1085;&#1077;&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1074;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; &#1080; &#1090;. &#1087;.);
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>isAudioAvailable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1079;&#1074;&#1091;&#1082;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;&#1088;&#1086;&#1083;&#1080;&#1082;&#1086;&#1074;, &#1095;&#1090;&#1086;&#1073;&#1099; 
&#1091;&#1079;&#1085;&#1072;&#1090;&#1100;, &#1080;&#1084;&#1077;&#1102;&#1090; &#1083;&#1080; &#1086;&#1085;&#1080; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1077; &#1089;&#1086;&#1087;&#1088;&#1086;&#1074;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isVideoAvailable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>bufferStatus ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1094;&#1077;&#1085;&#1090; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1075;&#1086; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 100;
<p align="JUSTIFY">
 </p></li><li> <b>error ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1091;&#1102; &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlayer</b>:
<ul>
 <li> <b>NoError (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1085;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1086;;
 </li><li> <b>ResourceError (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;;
 </li><li> <b>FormatError (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1085;&#1077;&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1079;&#1074;&#1091;&#1082;&#1072; &#1080;&#1083;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;;
 </li><li> <b>NetworkError (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1089;&#1077;&#1090;&#1077;&#1074;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;;
 </li><li> <b>AccessDeniedError (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1087;&#1088;&#1072;&#1074; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;;
 </li><li> <b>ServiceMissingError (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#1074; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;; 
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>errorString ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>isMetaDataAvailable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>metaData (&lt;<i>&#1050;&#1083;&#1102;&#1095;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1082;&#1083;&#1102;&#1095;&#1091;. &#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1084; &#1087;&#1088;&#1080;&#1075;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103;, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1076;&#1072;&#1083;&#1077;&#1077; 
(&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1087;&#1086; &#1072;&#1076;&#1088;&#1077;&#1089;&#1091; <a href="https://doc.qt.io/qt-5/qmediametadata.html" target="_blank"><b>https://doc.qt.io/qt-5/qmediametadata.html</b></a>). &#1045;&#1089;&#1083;&#1080; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077;, &#1074;&#1089;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1072; &#1089;&#1083;&#1086;&#1074;&#1086; "&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;" &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; <b>Python</b> (&#1082;&#1083;&#1072;&#1089;&#1089; <b>list</b>).
<ul>
 <li> <b>Title</b> - &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>Author</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>Comment</b> - &#1087;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>Description</b> - &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>Genre</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1078;&#1072;&#1085;&#1088;&#1086;&#1074;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;;
 </li><li> <b>Year</b> - &#1075;&#1086;&#1076; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
 </li><li> <b>Date</b> - &#1076;&#1072;&#1090;&#1072; &#1074;&#1099;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>datetime</b>, <b>date</b>;
 </li><li> <b>Language</b> - &#1103;&#1079;&#1099;&#1082; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>Copyright</b> - &#1072;&#1074;&#1090;&#1086;&#1088;&#1089;&#1082;&#1080;&#1077; &#1087;&#1088;&#1072;&#1074;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>Size</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1073;&#1072;&#1081;&#1090;&#1072;&#1093;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;;
 </li><li> <b>Duration</b> - &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;;
 </li><li> <b>AudioBitRate</b> - &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1099;&#1081; &#1074; &#1073;&#1080;&#1090;&#1072;&#1093; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091;;
 </li><li> <b>AudioCodec</b> - &#1082;&#1086;&#1076;&#1077;&#1082;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1079;&#1074;&#1091;&#1082;;
 </li><li> <b>&#1057;hannelCount</b> - &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
 </li><li> <b>AlbumTitle</b> - &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;;
 </li><li> <b>AlbumArtist</b> - &#1072;&#1074;&#1090;&#1086;&#1088; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1072;;
 </li><li> <b>ContributingArtist</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1093; &#1074; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1072;;
 </li><li> <b>Composer</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1086;&#1084;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1074; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;;
 </li><li> <b>Conductor</b> - &#1076;&#1080;&#1088;&#1080;&#1078;&#1077;&#1088;, &#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1081; &#1074; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1072;;
 </li><li> <b>Lyrics</b> - &#1090;&#1077;&#1082;&#1089;&#1090;&#1099; &#1087;&#1077;&#1089;&#1077;&#1085;, &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093; &#1074; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;;
 </li><li> <b>TrackNumber</b> - &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1086;&#1074;&#1099;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
 </li><li> <b>TrackCount</b> - &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081; &#1074; &#1072;&#1083;&#1100;&#1073;&#1086;&#1084;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
 </li><li> <b>Resolution</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>;
 </li><li> <b>VideoFrameRate</b> - &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1082;&#1072;&#1076;&#1088;&#1086;&#1074; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1072;&#1103; &#1074; &#1082;&#1072;&#1076;&#1088;&#1072;&#1093; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091;;
 </li><li> <b>VideoBitRate</b> - &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;, &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1099;&#1081; &#1074; &#1073;&#1080;&#1090;&#1072;&#1093; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091;;
 </li><li> <b>VideoCodec</b> - &#1082;&#1086;&#1076;&#1077;&#1082;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1086;&#1089;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086;;
 </li><li> <b>Director</b> - &#1088;&#1077;&#1078;&#1080;&#1089;&#1089;&#1077;&#1088; &#1092;&#1080;&#1083;&#1100;&#1084;&#1072;;
 </li><li> <b>LeadPerformer</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1072;&#1082;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1079;&#1072;&#1085;&#1103;&#1090;&#1099;&#1093; &#1074; &#1092;&#1080;&#1083;&#1100;&#1084;&#1077;;
 </li><li> <b>Writer</b> - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1072;&#1074;&#1090;&#1086;&#1088;&#1086;&#1074; &#1089;&#1094;&#1077;&#1085;&#1072;&#1088;&#1080;&#1103; &#1092;&#1080;&#1083;&#1100;&#1084;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1090;&#1084;&#1077;&#1090;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1077; &#1089;&#1086;&#1074;&#1089;&#1077;&#1084; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1101;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;;
</p><p align="JUSTIFY">
 </p></li><li> <b>availableMetaData ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1082;&#1083;&#1102;&#1095;&#1077;&#1081;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1093; &#1074; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1077; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_288.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_290.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>