<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_111.html]
* At UTC datetime: [2023-08-19 09:58:53.280310]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 111.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1052;&#1085;&#1086;&#1075;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1092;&#1086;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1092;&#1086;&#1085;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103;  &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;   &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;  &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;  &#1080;  &#1092;&#1086;&#1085;&#1072;  &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099;  &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077;  &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>GTextEdit</b> (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qtextedit.html" target="_blank"><b>https://doc.qt.io/qt-5/qtextedit.html</b></a>):
</p><ul>
 <li> <b>setCurrentFont (&lt;QFont&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1096;&#1088;&#1080;&#1092;&#1090;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QFont</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>. &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;;
<div class="fon"><pre>
  &lt;<i>&#1064;&#1088;&#1080;&#1092;&#1090;</i>&gt; = QFont(&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;</i>&gt;[, pointSize=-1][, weight=-1] [, italic=<span class="sl_sl">False</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>pointSize</b> &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; 
<b>weight</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1078;&#1080;&#1088;&#1085;&#1086;&#1089;&#1090;&#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;: &#1095;&#1080;&#1089;&#1083;&#1086; &#1086;&#1090; &#1086; &#1076;&#1086; 99 &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; <b>Light, Normal, DemiBold, Bold</b> &#1080;&#1083;&#1080; <b>Black</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QFont</b>. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>italic</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1099;&#1084;;
 </p></li><li> <b>currentFont ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFont</b> &#1089; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1084;&#1080; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1072;&#1084;&#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontFamily (&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>fontFamily ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontPointsize (&lt;<i>&#1056;&#1072;&#1079;&#1084;&#1077;&#1088;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>fontPointsize ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontWeight (&lt;<i>&#1046;&#1080;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1078;&#1080;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>fontWeight ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1078;&#1080;&#1088;&#1085;&#1086;&#1089;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontItalic (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1096;&#1088;&#1080;&#1092;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1099;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>fontItalic ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1096;&#1088;&#1080;&#1092;&#1090; &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1099;&#1081;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontUnderline (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1099;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>fontUnderline ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1099;&#1081;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextColor (&lt;QColor&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
<b>black</b>, <b>white</b> &#1080; &#1090;. &#1076;.) &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QColor("red")</b>, 
<b>QColor( "#ff0000")</b>,<b> QColor(255, 0, 0)</b> &#1080; &#1076;&#1088;.). &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>text&#1057;olor ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextBackgroundColor (&lt;QColor&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b> 
(&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>black</b>, <b>white</b> &#1080; &#1090;. &#1076;.) &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QColor("red")</b>, 
<b>QColor("#ff0000")</b>, <b>QColor(255, 0, 0)</b> &#1080; &#1076;&#1088;.).  &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>textBackgroundColor ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> &#1089; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1092;&#1086;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setAlignment (&lt;<i>&#1042;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1072;&#1073;&#1079;&#1072;&#1094;&#1072;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; 
&#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_081.html" target="_blank">81 &#1096;&#1072;&#1075;&#1077;</a>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>alignment ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1072;&#1073;&#1079;&#1072;&#1094;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1076;&#1072;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextCharFormat</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtGui</b> &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080;. 
&#1055;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1077;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setCurrentCharFormat(&lt;QTextCharFormat&gt;)</b>. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089; 
&#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1084;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>currentCharFormat()</b>. &#1047;&#1072; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QTextCharFormat</b> &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082; 
&#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qtextcharformat.html" target="_blank"><b>https://doc.qt.io/qt-5/qtextcharformat.html</b></a>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QTextDocument</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_110.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_112.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>