<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_018.html]
* At UTC datetime: [2023-08-19 09:54:46.805001]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 18.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1086;&#1076;&#1091;&#1083;&#1100; queue: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1074; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;.
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:   utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">import</span> queue

<span class="sl_sl">class</span> <span class="vyvod">MyThread</span>(QtCore.QThread):
    task_done = QtCore.pyqtSignal(<span class="tp">int</span>, <span class="tp">int</span>, name = <span class="pech">'taskDone'</span>)
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, <span class="tp">id</span>, queue, parent=<span class="sl_sl">None</span>):
        QtCore.QThread.__init__(self, parent)
        self.id = <span class="tp">id</span>
        self.queue = queue
    <span class="sl_sl">def</span> <span class="vyvod">run</span>(self):
        <span class="sl_sl">while True</span>:
            task = self.queue.get()            <span class="comm"># &#1055;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077;</span>
            self.sleep(5)                      <span class="comm"># &#1048;&#1084;&#1080;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091;</span>
            self.task_done.emit(task, self.id) <span class="comm"># &#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;</span>
            self.queue.task_done()

<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QPushButton):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        QtWidgets.QPushButton.__init__(self)
        self.setText(<span class="pech">"&#1056;&#1072;&#1079;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;"</span>)
        self.queue = queue.Queue()       <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;</span>
        self.threads = []
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(1, 3):	<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084;</span>
            thread = MyThread(i, self.queue)
            self.threads.append(thread)
            thread.task_done.connect(self.on_task_done, QtCore.Qt.QueuedConnection)
            thread.start()
        self.clicked.connect(self.on_add_task)
    <span class="sl_sl">def</span> <span class="vyvod">on_add_task</span>(self):
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(0, 11):
            self.queue.put(i)	  <span class="comm"># &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;</span>
    <span class="sl_sl">def</span> <span class="vyvod">on_task_done</span>(self, data, <span class="tp">id</span>):
        <span class="tp">print</span>(data, <span class="pech">"- id ="</span>, <span class="tp">id</span>) <span class="comm"># &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;</span>

<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.setWindowTitle(<span class="pech">"&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; queue"</span>)
    window.resize(300, 30)
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr18_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris18_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; <b>(id)</b> &#1080; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; <b>(queue)</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1080;&#1084;&#1077;&#1085;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. 
&#1042; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>run()</b> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>get()</b>. &#1045;&#1089;&#1083;&#1080; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1087;&#1091;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; 
&#1086;&#1076;&#1080;&#1085; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; (&#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1079;&#1072;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072;), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1091; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>taskDone</b>, &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1080;&#1081; &#1076;&#1074;&#1072; 
&#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>task_done()</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1090;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1079;&#1076;&#1077;&#1089;&#1100; &#1074; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <b>pyqtSignal()</b> &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>name</b>:
</p><div class="fon"><pre>
  task_done = QtCore.pyqtSignal(<span class="tp">int</span>, <span class="tp">int</span>, name = <span class="pech">'taskDone'</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1085; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1077;&#1085; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1080;&#1084;&#1103; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1091;, - &#1082;&#1072;&#1082; &#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1075;&#1076;&#1077; &#1080;&#1084;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;: <b>taskDone</b>, &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; 
&#1086;&#1090; &#1080;&#1084;&#1077;&#1085;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;: <b>task_done</b>. &#1055;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1091; &#1082;&#1072;&#1082; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1077;&#1084;&#1091; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;:
</p><div class="fon"><pre>
  self.task_done.emit(task, self.id)
</pre></div>
&#1090;&#1072;&#1082; &#1080; &#1087;&#1086; &#1080;&#1084;&#1077;&#1085;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>name</b> &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <b>pyqtSignal()</b>: 
<div class="fon"><pre>
  self.taskDone.emit(task, self.id)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1043;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPushButton (<i>&#1082;&#1085;&#1086;&#1087;&#1082;&#1072;</i>)</b>, &#1072; &#1085;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b>. &#1042;&#1089;&#1077; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1102;&#1073;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1081; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;, 
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPushButton</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b> &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setText()</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Queue</b> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1077; 
<b>queue</b>. &#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;. &#1057;&#1072;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; (&#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1093; &#1076;&#1074;&#1072;) &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; 
&#1094;&#1080;&#1082;&#1083;&#1072; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1094;&#1080;&#1082;&#1083;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; <b>taskDone</b> &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>start()</b>. &#1044;&#1072;&#1083;&#1077;&#1077; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; 
&#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b><i>&#1056;&#1072;&#1079;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;</i></b> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>on_add_task()</b>, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1103;&#1090; &#1080;&#1079; &#1094;&#1080;&#1082;&#1083;&#1072; 
&#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103;, &#1080; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1085;&#1080;&#1093; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1086;&#1076;&#1085;&#1086; &#1091;&#1085;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1102;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>taskDone</b> &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>task_done()</b>, &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; &#1086;&#1073; 
&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;. &#1043;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>on_task_ done()</b>, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1084;&#1077;&#1090;&#1086;&#1076; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; 
&#1074; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082;&#1077;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1078;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1082;&#1085;&#1086; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; (&#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; 
&#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083; &#1089; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077;&#1084; <b>&#1088;&#1091;</b>, &#1072; &#1085;&#1077; <b>pyw</b>). &#1055;&#1086;&#1089;&#1083;&#1077; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1089;&#1085;&#1086;&#1074;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1102;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1072;, &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1091;&#1090; &#1074; 
&#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;</i> QMutex <i>&#1080;</i> QMutexLocker</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_017.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_019.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>