<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_076.html]
* At UTC datetime: [2023-08-19 09:57:24.992449]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 76.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1060;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1077;&#1097;&#1077; &#1076;&#1086; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1099; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1091;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QObject</b>, &#1080; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074; &#1085;&#1077;&#1084; 
&#1084;&#1077;&#1090;&#1086;&#1076; <b>eventFilter(seif, &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt;, &lt;event&gt;)</b>. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> - &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; 
&#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; - &#1090;&#1072;&#1082;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; <b>MouseButtonPress</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMouseEvent</b>, &#1072; 
&#1076;&#1083;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; <b>KeyPress</b> - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QKeyEvent</b>. &#1048;&#1079; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>eventFilter()</b> &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1085;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;, &#1080; 
<b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1042;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;-&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>&#1042;</b>:
</p><div class="fon"><pre>
<span class="sl_sl">class</span> <span class="vyvod">MyFilter</span> (QtCore.QObject):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent = <span class="sl_sl">None</span>):
        QtCore.QObject.__init__(self, parent)
    <span class="sl_sl">def</span> <span class="vyvod">eventFilter</span> (self, obj , e):
        <span class="sl_sl">if</span> e.type() == QtCore.QEvent.KeyPress: 
            <span class="sl_sl">if</span> e.key() == QtCore.Qt.Key_B:
                <span class="tp">print</span>(<span class="pech">"&#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1086;&#1090; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; &lt;&#1042;&gt; &#1085;&#1077; &#1076;&#1086;&#1081;&#1076;&#1077;&#1090; &#1076;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;"</span>) 
                <span class="sl_sl">return</span> <span class="sl_sl">True</span> 
        <span class="sl_sl">return</span> QtCore.QObject.eventFilter(self, obj, e)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1072;&#1083;&#1077;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1091; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076; <b>installEventFilter()</b>, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072; &#1076;&#1083;&#1103; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;:
</p><div class="fon"><pre>
    self.label.installEventFilter (MyFilter (self.label))
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; <b>installEventFilter()</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1086;&#1074;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1099;&#1083; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;. &#1050;&#1088;&#1086;&#1084;&#1077; 
&#1090;&#1086;&#1075;&#1086;, &#1086;&#1076;&#1080;&#1085; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1088;&#1072;&#1079;&#1091; &#1074; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1093;. &#1057;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1086;&#1084; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>eventFilter()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>removeEventFilter(&lt;<i>&#1060;&#1080;&#1083;&#1100;&#1090;&#1088;</i>&gt;)</b>, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1099;&#1083; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1101;&#1090;&#1086;&#1090; &#1092;&#1080;&#1083;&#1100;&#1090;&#1088;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077; &#1073;&#1099;&#1083; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; 
&#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1086;&#1081;&#1076;&#1077;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_075.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_077.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>