<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_050.html]
* At UTC datetime: [2023-08-19 09:56:16.554490]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 50.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Enter</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1084;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; 
<b>&#1054;&#1050;</b> &#1080; &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;. &#1054;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1090;&#1100; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>emit()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QObject</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt;.&lt;<i>&#1057;&#1080;&#1075;&#1085;&#1072;&#1083;</i>&gt;.emit ([&lt;<i>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</i>&gt;]) 
  &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt;.&lt;<i>&#1057;&#1080;&#1075;&#1085;&#1072;&#1083;</i>&gt;[&lt;<i>&#1058;&#1080;&#1087;</i>&gt;].emit([&lt;<i>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; <b>emit()</b> &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  button.clicked.emit()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1080;&#1075;&#1085;&#1072;&#1083;&#1091; &#1080;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1077;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1080;&#1093; &#1074; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>emit()</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
</p><div class="fon"><pre>
  button.clicked[<span class="tp">bool</span>].emit(<span class="sl_sl">False</span>) 
  button.clicked[<span class="pech">"bool"</span>].emit(<span class="sl_sl">False</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1072;&#1082;&#1078;&#1077; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;, &#1095;&#1100;&#1077; &#1080;&#1084;&#1103; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1077;&#1090; &#1089; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;. &#1054;&#1090;&#1084;&#1077;&#1090;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1101;&#1090;&#1086; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1072; &#1085;&#1077; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1084;&#1099; &#1087;&#1088;&#1080;&#1089;&#1074;&#1086;&#1080;&#1084; &#1074;&#1085;&#1086;&#1074;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1091; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; <b>pyqtSignal()</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;</i>&gt; = pyqtSignal(*&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;[, name=&lt;<i>&#1048;&#1084;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;</b> &#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1091;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <b>bool</b> &#1080;&#1083;&#1080; <b>int</b>:
</p><div class="fon"><pre>
  mysignal1 = QtCore.pyqtSignal(<span class="tp">int</span>) 
  mysignal2 = QtCore.pyqtSignal(<span class="tp">int</span>, <span class="tp">str</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1090;&#1080;&#1087;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <b>C++</b> &#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;:
</p><div class="fon"><pre>
  mysignal3 = QtCore.pyqtSignal(<span class="pech">"QDate"</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;</b> &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081;, &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1072;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; &#1080; &#1090;&#1080;&#1087;&#1086;&#1084; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1090;&#1080;&#1087;&#1099; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1082;&#1086;&#1073;&#1086;&#1082;. 
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1072; <b>int</b> &#1080;&#1083;&#1080; <b>str</b>:
</p><div class="fon"><pre>
  mysignal4 = QtCore.pyqtSignal([<span class="tp">int</span>], [<span class="tp">str</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1087;&#1086;&#1076; &#1076;&#1074;&#1091;&#1084;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103;&#1084;&#1080;: 
&#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1084; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>name</b>:
</p><div class="fon"><pre>
  mysignal = QtCore.pyqtSignal(<span class="tp">int</span>, name = <span class="pech">'mySignal'</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1086;&#1082;&#1085;&#1086; &#1089; &#1076;&#1074;&#1091;&#1084;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;&#1084;&#1080;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1080;&#1093; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; <b>clicked</b> (&#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;). &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1076;&#1074;&#1072; 
&#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;: &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1084;&#1080;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1084;, &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082; &#1086;&#1082;&#1085;&#1091;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1084; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1082;&#1085;&#1086; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    mysignal = QtCore.pyqtSignal(<span class="tp">int</span>, <span class="tp">int</span>)
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=None):
        QtWidgets.QWidget.__init__(self, parent)
        self.setWindowTitle(<span class="pech">"&#1043;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;"</span>)
        self.resize(300, 100)
        self.button1 = QtWidgets.QPushButton(<span class="pech">"&#1053;&#1072;&#1078;&#1084;&#1080; &#1084;&#1077;&#1085;&#1103;"</span>)
        self.button2 = QtWidgets.QPushButton(<span class="pech">"&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; 2"</span>)
        vbox = QtWidgets.QVBoxLayout()
        vbox.addWidget(self.button1)
        vbox.addWidget(self.button2)
        self.setLayout(vbox)
        self.button1.clicked.connect(self.on_clicked_button1)
        self.button2.clicked.connect(self.on_clicked_button2)
        self.mysignal.connect(self.on_mysignal)
    <span class="sl_sl">def</span> <span class="vyvod">on_clicked_button1</span>(self):
        <span class="tp">print</span>(<span class="pech">"&#1053;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; button1"</span>)
        <span class="comm"># &#1043;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</span>
        self.button2.clicked[<span class="tp">bool</span>].emit(<span class="sl_sl">False</span>)
        self.mysignal.emit(10, 20)
    <span class="sl_sl">def</span> <span class="vyvod">on_clicked_button2</span>(self):
        <span class="tp">print</span>(<span class="pech">"&#1053;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; button2"</span>)
    <span class="sl_sl">def</span> <span class="vyvod">on_mysignal</span>(self, x, y):
        <span class="tp">print</span>(<span class="pech">"&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; mysignal()"</span>)
        <span class="tp">print</span>(<span class="pech">"x ="</span>, x, <span class="pech">"y ="</span>, y)


<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr50_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1:
</p><p align="CENTER"><img src="images/ris50_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087; <b>QVariant</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; 
&#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1080; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;, &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;:
</p><div class="fon"><pre>
  mysignal = QtCore.pyqtSignal(QtCore.QVariant)
  .   .   .   .
  self.mysignal.emit(20)
  self.mysignal.emit(<span class="pech">"&#1055;&#1088;&#1080;&#1074;&#1077;&#1090;!"</span>)
  self.mysignal.emit([1, <span class="pech">"2"</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>emit()</b>. &#1053;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1089;&#1099;&#1083;&#1072;&#1102;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1091; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>click()</b>. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102;:
</p><div class="fon"><pre>
  button.clicked.emit()
</pre></div>
&#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;:
<div class="fon"><pre>
  button.click()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086; &#1090;&#1072;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1084;&#1099; &#1073;&#1091;&#1076;&#1077;&#1084; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_049.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_051.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>