<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_190.html]
* At UTC datetime: [2023-08-19 10:02:17.338930]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 190.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;. &#1050;&#1083;&#1072;&#1089;&#1089; QPainter. &#1042;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1075;&#1086;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1088;&#1072;&#1089;&#1090;&#1088;&#1086;&#1074;&#1099;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <b>drawPixmap()</b> &#1080; <b>drawImage()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPainter</b>. &#1052;&#1077;&#1090;&#1086;&#1076; <b>drawPixmap()</b> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;, 
&#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1074; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPixmap</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  drawPixmap(&lt;X&gt;, &lt;Y&gt;, &lt;QPixmap&gt;)
  drawPixmap(&lt;QPoint&gt;, &lt;QPixmap&gt;)
  drawPixmap(&lt;QPointF&gt;, &lt;QPixmap&gt;)
  drawPixmap(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;, &lt;QPixmap&gt;)
  drawPixmap(&lt;QRect&gt;, &lt;QPixmap&gt;)
  drawPixmap(&lt;X1&gt;, &lt;Y1&gt;, &lt;QPixmap&gt;, &lt;X2&gt;, &lt;Y2&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;2</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;2</i>&gt;)
  drawPixmap(&lt;QPoint&gt;, &lt;QPixmap&gt;, &lt;QRect&gt;)
  drawPixmap(&lt;QPointF&gt;, &lt;QPixmap&gt;, &lt;QRectF&gt;)
  drawPixmap(&lt;X1&gt;, &lt;Y1&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;1</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;1</i>&gt;, &lt;QPixmap&gt;,
      &lt;X2&gt;, &lt;Y2&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;2</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;2</i>&gt;) 
  drawPixmap(&lt;QRect&gt;, &lt;QPixmap&gt;, &lt;QRect&gt;) 
  drawPixmap(&lt;QRectF&gt;, &lt;QPixmap&gt;, &lt;QRectF&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1090;&#1088;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1083;&#1077;&#1074;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1091;&#1075;&#1086;&#1083; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPixmap</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  pixmap = QtGui.QPixmap(<span class="pech">"foto.jpg"</span>) 
  painter.drawPixmap(3, 3, pixmap)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1080; &#1087;&#1103;&#1090;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; 
&#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1064;&#1077;&#1089;&#1090;&#1086;&#1081;, &#1089;&#1077;&#1076;&#1100;&#1084;&#1086;&#1081; &#1080; &#1074;&#1086;&#1089;&#1100;&#1084;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1083;&#1077;&#1074;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1091;&#1075;&#1086;&#1083; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPixmap</b> &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QRect</b> &#1080;&#1083;&#1080; <b>QRectF</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1090;&#1088;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;. &#1050;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPixmap</b> &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QRect</b> &#1080;&#1083;&#1080; <b>QRectF</b>. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; 
&#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; <b>drawImage()</b> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1093; &#1074; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  drawImage(&lt;QPoint&gt;, &lt;QImage&gt;)
  drawImage(&lt;QPointF&gt;, &lt;QImage&gt;)
  drawImage(&lt;QRect&gt;, &lt;QImage&gt;)
  drawImage(&lt;QRectF&gt;, &lt;QImage&gt;)
  drawImage(&lt;X1&gt;, &lt;Y1&gt;, &lt;QImage&gt;[, sx=0] [, sy=0][, sw=-l][, sh=-l] 
      [, flags=AutoColor])
  drawImage(&lt;QPoint&gt;, &lt;QImage&gt;, &lt;QRect&gt;[, flags=AutoColor]) 
  drawImage(&lt;QPointF&gt;, &lt;QImage&gt;, &lt;QRectF&gt;[, flags=AutoColor]) 
  drawImage(&lt;QRect&gt;, &lt;QImage&gt;, &lt;QRect&gt;[, flags=AutoColor]) 
  drawImage(&lt;QRectF&gt;, &lt;QImage&gt;, &lt;QRectF&gt;[, flags=AutoColor])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1103;&#1090;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;, &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1083;&#1077;&#1074;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1091;&#1075;&#1086;&#1083; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  img = QtGui.QImage(<span class="pech">"foto.jpg"</span>) 
  painter.drawImage(3, 3, img)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1080; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. 
&#1055;&#1088;&#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1103;&#1090;&#1099;&#1081;, &#1096;&#1077;&#1089;&#1090;&#1086;&#1081; &#1080; &#1089;&#1077;&#1076;&#1100;&#1084;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1083;&#1077;&#1074;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1091;&#1075;&#1086;&#1083; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; 
&#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b> &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QRect</b> &#1080;&#1083;&#1080; <b>QRectF</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102;. &#1050;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>, 
&#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QRect</b> &#1080;&#1083;&#1080; <b>QRectF</b>. &#1045;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1077; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1102;&#1090; &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1090;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1055;&#1088;&#1080; &#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>flags</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1099;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099; &#1087;&#1088;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1092;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; - &#1087;&#1088;&#1080; &#1085;&#1077;&#1103;&#1074;&#1085;&#1086;&#1084; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b> &#1074; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QPixmap</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084;). &#1054;&#1085;&#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qt.html#ImageConversionFlag-enum" target="_blank"><b>https://doc.qt.io/qt-5/qt.html#ImageConversionFlag-enum</b></a>. &#1042; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;&#1074; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; 
&#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>AutoColor</b> &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076; &#1082;&#1072;&#1088;&#1090;&#1080;&#1085;&#1082;&#1080;:
</p><div class="fon"><pre>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QWidget, QApplication
<span class="sl_sl">from</span> PyQt5.QtGui <span class="sl_sl">import</span> QPainter, QColor, QBrush

<span class="sl_sl">class</span> <span class="vyvod">Example</span>(QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        <span class="comm"># super() - &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;-&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;</span>
        <span class="tp">super</span>().__init__()
        self.initUI()
    <span class="comm"># &#1043;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;</span>
    <span class="sl_sl">def</span> <span class="vyvod">initUI</span>(self):
        <span class="comm"># &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;</span>
        self.setGeometry(300, 300, 350, 320)
        self.setWindowTitle(<span class="pech">'&#1055;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080;'</span>)
        self.show()

    <span class="sl_sl">def</span> <span class="vyvod">paintEvent</span>(self, e):
        qp = QPainter()
        qp.begin(self)
        self.drawRectangles(qp) <span class="comm"># &#1056;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;</span>

        <span class="comm"># ======== &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; ===============</span>
        <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1085;&#1086;&#1074;&#1086;&#1077; &#1087;&#1077;&#1088;&#1086;</span>
        col = QColor(0, 0, 0) <span class="comm"># &#1063;&#1077;&#1088;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;</span>
        qp.setPen(col) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1077;&#1088;&#1072;</span>
        qp.drawText(10, 90, <span class="pech">'1-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        qp.drawText(130, 90, <span class="pech">'2-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        qp.drawText(250, 90, <span class="pech">'3-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        <span class="comm"># ========= &#1050;&#1086;&#1085;&#1077;&#1094; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; ================</span>
        <span class="comm"># &#1042;&#1089;&#1090;&#1072;&#1074;&#1082;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072;</span>
        pixmap = QPixmap(<span class="pech">"IMG2.jpg"</span>)
        qp.drawPixmap(10, 100, pixmap)
        qp.end()

    <span class="sl_sl">def</span> <span class="vyvod">drawRectangles</span>(self, qp):
        col = QColor(0, 0, 0)
        col.setNamedColor(<span class="pech">'#d4d4d4'</span>)
        qp.setPen(col) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1072;&#1088;&#1072;&#1085;&#1076;&#1072;&#1096;&#1072;</span>

        qp.setBrush(QColor(200, 0, 0)) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1080;&#1089;&#1090;&#1080;</span>
        qp.drawRect(10, 15, 90, 60) <span class="comm"># &#1056;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072;</span>

        qp.setBrush(QColor(255, 80, 0, 160))
        qp.drawRect(130, 15, 90, 60)

        qp.setBrush(QColor(25, 0, 90, 200))
        qp.drawRect(250, 15, 90, 60)


app = QApplication(sys.argv)
ex = Example()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1080; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr190_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris190_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_189.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav10.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_191.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>