<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_099.html]
* At UTC datetime: [2023-08-19 09:58:23.862955]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 99.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1053;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1086; &#1093;&#1086;&#1076;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; 
&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1091;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1080; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1080;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1086;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>CSS</b> &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>HTML</b>, &#1095;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; <b>Web</b>-&#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;. &#1042; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1077; <b>PyQt5</b> 
&#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLabel</b>. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QFrame - QLabel
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLabel</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1076;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QLabel ([parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;] [, flags=&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QLabel (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;[, parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;][, flags=&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; 
&#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;, &#1090;&#1080;&#1087; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>flags</b>. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;</b> 
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  label = QtWidgets.QLabel(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;"</span>, flags=QtCore.Qt.Window) 
  label.resize(300, 50)
  label.show()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QLabel</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qlabel.html" target="_blank"><b>https://doc.qt.io/qt-5/qlabel.html</b></a>):
</p><ul>
 <li> <b>setText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1072;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1090;&#1072;&#1082; &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; 
<b>CSS</b>-&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>HTML</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  label.setText(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &lt;b&gt;&#1087;&#1086;&#1083;&#1091;&#1078;&#1080;&#1088;&#1085;&#1099;&#1081;&lt;/b&gt;"</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;<b> \n</b>, &#1072; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>HTML</b> - &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1090;&#1077;&#1075;&#1072; <b>&lt;br&gt;</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  label.setText(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090;\n&#1085;&#1072; &#1076;&#1074;&#1091;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1093;"</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1081;, &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1073;&#1091;&#1082;&#1074;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1073;&#1091;&#1076;&#1077;&#1090;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1072;. &#1055;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Alt</b> &#1080; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1086;&#1081; &#1073;&#1091;&#1082;&#1074;&#1099; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1072; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setBuddy()</b>, &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1072;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1077;&#1075;&#1086; &#1091;&#1076;&#1074;&#1086;&#1080;&#1090;&#1100;. 
&#1045;&#1089;&#1083;&#1080; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1072; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084;, &#1090;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b> &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  label = QtWidgets.QLabel(<span class="pech">"&amp;&#1055;&#1072;&#1088;&#1086;&#1083;&#1100;"</span>) 
  lineEdit = QtWidgets.QLineEdit() 
  label.setBuddy(lineEdit)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
</p><p align="JUSTIFY">
 </p></li><li> <b>setNum (&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)</b> - &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1077; &#1080;&#1083;&#1080; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1074; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1077;&#1077; &#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setWordWrap (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;. 
&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1085;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>text ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextFormat (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
<ul>
 <li> <b>PlainText (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;;
 </li><li> <b>RichText (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1090;&#1077;&#1082;&#1089;&#1090;, &#1086;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1075;&#1072;&#1084;&#1080; <b>HTML</b>;
 </li><li> <b>AutoText (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077; (&#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;). &#1045;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; <b>HTML</b>-&#1090;&#1077;&#1075;&#1080;, &#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1088;&#1077;&#1078;&#1080;&#1084; <b>RichText</b>, &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - &#1088;&#1077;&#1078;&#1080;&#1084; <b>PlainText</b>;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setAlignment (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; 
&#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_081.html" target="_blank">81 &#1096;&#1072;&#1075;&#1077;</a>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  label.setAlignment(QtCore.Qt.AlignRight | QtCore.Qt.AlignBottom)
</pre></div>
 </li><li> <b>setOpenExternalLinks (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1077;&#1075;&#1080; 
<b>&lt;a&gt;</b>, &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080;:
<div class="fon"><pre>
  label.setText(<span class="pech">'&lt;&#1072; href="http://www.google.ru/"&gt;&#1069;&#1090;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&lt;/&#1072;&gt;'</span>) 
  label.setOpenExternalLinks(<span class="sl_sl">True</span>)
</pre></div>
 </li><li> <b>setBuddy (&lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1074;&#1103;&#1079;&#1072;&#1090;&#1100; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1089; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084;. &#1042; &#1101;&#1090;&#1086;&#1084; 
&#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b> &#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1081;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; 
&#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setPixmap (&lt;QPixmap&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPixmap</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  label.setPixmap(QtGui.QPixmap(<span class="pech">"picture.jpg"</span>))
</pre></div>
 </li><li> <b>setPicture (&lt;QPicture&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPicture</b>. &#1052;&#1077;&#1090;&#1086;&#1076; 
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setMovie (&lt;QMovie&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1102;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMovie</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setScaledContents (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; 
&#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1085;&#1077; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>setMargin (&lt;&#1054;&#1090;&#1089;&#1090;&#1091;&#1087;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1086;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1076;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setIndent (&lt;&#1054;&#1090;&#1089;&#1090;&#1091;&#1087;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087; &#1086;&#1090; &#1088;&#1072;&#1084;&#1082;&#1080; &#1076;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086; &#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077;, 
&#1090;&#1086; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1077;, &#1090;&#1086; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextInteractionFlags (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; 
(&#1080;&#1083;&#1080; &#1080;&#1093; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
<ul>
 <li> <b>NoTextInteraction (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;  &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;;
 </li><li> <b>TextSelectableByMouse (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;, &#1095;&#1090;&#1086;&#1073;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1073;&#1091;&#1092;&#1077;&#1088; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072;;
 </li><li> <b>TextSelectableByKeyboard (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;;
 </li><li> <b>LinksAccessibleByMouse (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1085;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1093;, &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1097;&#1077;&#1083;&#1082;&#1072;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>LinksAccessibleByKeyboard (<i>&#1080;&#1083;&#1080;</i> 8)</b> - &#1089; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080;,  &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;: &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; 
&#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>, &#1072; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077; - &#1087;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Enter</b>;
 </li><li> <b>TextEditable (<i>&#1080;&#1083;&#1080;</i> 16)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;;
 </li><li> <b>TextEditorInteraction</b> - &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; <b>TextSelectableByMouse | TextSelectableByKeyboard | TextEditable</b>;
 </li><li> <b>TextBrowserInteraction</b> - &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; <b>TextSelectableByMouse | LinksAccessibleByMouse | LinksAccessibleByKeyboard</b>;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setSelection (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1044;&#1083;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081; <b>&lt;<i>&#1044;&#1083;&#1080;&#1085;&#1072;</i>&gt;</b>, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; <b>&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;</b>;
<p align="JUSTIFY">
 </p></li><li> <b>selectionStart ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; -1, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>selectedText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>hasSelectedText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QLabel</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>linkActivated (&lt;URL&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1077; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; 
&#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; <b>URL</b>-&#1072;&#1076;&#1088;&#1077;&#1089;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
 </li><li> <b>linkHovered (&lt;URL&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1091;.
&#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; URL-&#1072;&#1076;&#1088;&#1077;&#1089; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1072;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_098.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav5.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_100.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>