<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_147.html]
* At UTC datetime: [2023-08-19 10:00:23.650961]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 147.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1083;&#1072;&#1089;&#1089; QAbstractItemView (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1082;&#1072;&#1078;&#1077;&#1084; &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;.
</p><ul>
 <li> <b>clearSelection ()</b> - &#1089;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>edit (&lt;QModelIndex&gt;)</b> - &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1103; &#1077;&#1075;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setEditTriggers (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1087;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.  &#1042;  &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;  &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;  &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103;  &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractItemView</b>:
<ul>
 <li> <b>NoEditTriggers (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>CurrentChanged (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1088;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>DoubleClicked (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1088;&#1080; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1084; &#1097;&#1077;&#1083;&#1095;&#1082;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>SelectedClicked (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1087;&#1088;&#1080; &#1097;&#1077;&#1083;&#1095;&#1082;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1091;&#1078;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1077;;
 </li><li> <b>EditKeyPressed (<i>&#1080;&#1083;&#1080;</i> 8)</b> - &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>F2</b>;
 </li><li> <b>AnyKeyPressed (<i>&#1080;&#1083;&#1080;</i> 16)</b> - &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;;
 </li><li> <b>AllEditTriggers (<i>&#1080;&#1083;&#1080;</i> 31)</b> - &#1087;&#1088;&#1080; &#1083;&#1102;&#1073;&#1086;&#1084; &#1074;&#1099;&#1096;&#1077;&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setIconSize (&lt;QSize&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextElideMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1073;&#1088;&#1077;&#1079;&#1082;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; (&#1074; &#1084;&#1077;&#1089;&#1090;&#1077; &#1087;&#1088;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1088;&#1086;&#1077;&#1090;&#1086;&#1095;&#1080;&#1077;). &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
<ul>
 <li> <b>ElideLeft (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1074;&#1072;;
 </li><li> <b>ElideRight (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;;
 </li><li> <b>ElideMiddle (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1074;&#1099;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1077;&#1088;&#1077;&#1076;&#1080;&#1085;&#1077;;
 </li><li> <b>ElideNone (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1077;&#1090;&#1089;&#1103;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setTabKeyNavigation (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1084;&#1077;&#1078;&#1076;&#1091; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; 
<b>&#1058;&#1072;b</b> &#1080; <b>Shift+Tab</b>;
<p align="JUSTIFY">
 </p></li><li> <b>scrollTo (&lt;QModelIndex&gt;[, hint=EnsureVisible])</b> - &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIindex</b>), 
&#1073;&#1099;&#1083; &#1074;&#1080;&#1076;&#1080;&#1084;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>hint</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractItemView</b>:
<ul>
 <li> <b>EnsureVisible (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;;
 </li><li> <b>PositionAtTop (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;;
 </li><li> <b>PositionAtBottom (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;;
 </li><li> <b>PositionAtCenter (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1094;&#1077;&#1085;&#1090;&#1088;&#1077;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>scrollToTop ()</b> - &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1072;&#1084;&#1086;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>scrollToBottom ()</b> - &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074; &#1089;&#1072;&#1084;&#1099;&#1081; &#1082;&#1086;&#1085;&#1077;&#1094;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setDragEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setDragDropMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; <b>drag &amp; drop</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractItemView</b>:
<ul>
 <li> <b>NoDragDrop (<i>&#1080;&#1083;&#1080;</i> 0)</b> - <b>drag &amp; drop</b> &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;;
 </li><li> <b>DragOnly (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>DropOnly (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>DragDrop (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;;
 </li><li> <b>InternalMove (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1076;&#1086;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setDropIndicatorShown (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1075;&#1086; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1089;&#1074;&#1077;&#1095;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setAutoScroll (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setAutoScrollMargin (&lt;<i>O&#1090;&#1089;&#1090;&#1091;&#1087;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1090; &#1082;&#1088;&#1072;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1072; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>update (&lt;QModelIndex&gt;)</b> - &#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAbstractItemView</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>activated (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1091;&#1090;&#1077;&#1084; &#1086;&#1076;&#1080;&#1085;&#1072;&#1088;&#1085;&#1086;&#1075;&#1086; &#1080;&#1083;&#1080; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1075;&#1086; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080;&#1083;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Enter</b>. &#1042; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>pressed (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072;&#1076; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>clicked (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1097;&#1077;&#1083;&#1095;&#1082;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072;&#1076; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>doubleClicked (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1084; &#1097;&#1077;&#1083;&#1095;&#1082;&#1077; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072;&#1076; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>entered (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; 
&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setMouseTracking()</b>, &#1091;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>viewport Entered</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; 
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setMouseTracking()</b>, &#1091;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_146.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav8.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_148.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>