<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_201.html]
* At UTC datetime: [2023-08-19 10:02:43.696981]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 201.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QGraphicsScene: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080;&#1093; &#1086;&#1090;&#1090;&#1091;&#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsScene</b>:
</p><ul>
 <li> <b>addItem (&lt;QGraphicsItem&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QGraphicsEllipseItem</b> (&#1101;&#1083;&#1083;&#1080;&#1087;&#1089;);
<p align="JUSTIFY">
 </p></li><li> <b>addLine ()</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1102;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1077; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsLineItem</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addLine(&lt;Xl&gt;, &lt;Y1&gt;, &lt;X2&gt;, &lt;Y2&gt;[, pen=QPen()]) 
  addLine(&lt;QLineF&gt;, pen=QPen()])
</pre></div>
 </li><li> <b>addRect ()</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsRectItem</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addRect(&lt;&#1061;&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;
        [, pen=QPen()] [, brush=QBrush()]) 
  addRect(&lt;QRectF&gt;[, pen=QPen()][, brush=QBrush()])
</pre></div>
 </li><li> <b>addPolygon (&lt;QPolygonF&gt;[, pen=QPen()][, brush=QBrush()])</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1084;&#1085;&#1086;&#1075;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QGraphicsPolygonItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addEllipse ()</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1101;&#1083;&#1083;&#1080;&#1087;&#1089;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsEllipseItem</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addEllipse(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;
        [, pen=QPen()][, brush=QBrush()]) 
  addEllipse(&lt;QRectF&gt;[, pen=QPen()][, brush=QBrush()])
</pre></div>
 </li><li> <b>addPixmap (&lt;QPixmap&gt;)</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsPixmapItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addSimpleText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;[, font=QFont()])</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; (0, 0) &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsSimpleTextItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;[, font=QFont()])</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; (0, 0) &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsTextItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addPath (&lt;QPainterPath&gt;[, pen=QPen()] [, brush=QBrush()])</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1089;&#1083;&#1086;&#1078;&#1085;&#1091;&#1102; &#1092;&#1080;&#1075;&#1091;&#1088;&#1091; ("&#1087;&#1091;&#1090;&#1100;"), &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1077; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsPathItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>removeItem (&lt;QGraphicsItem&gt;)</b> - &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080; &#1074;&#1089;&#1077;&#1093; &#1077;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1086;&#1074; &#1089;&#1086; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1080;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1089;&#1094;&#1077;&#1085;&#1091;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QGraphicsEllipseItem</b> (&#1101;&#1083;&#1083;&#1080;&#1087;&#1089;);
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1086; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>createItemGroup (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080;</i>&gt;)</b> - &#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1091;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;    &#1080;    &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;    &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081;    &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102;    &#1075;&#1088;&#1091;&#1087;&#1087;&#1091;    &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;    &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsItemGroup</b>;
<p align="JUSTIFY">
 </p></li><li> <b>destroyItemGroup (&lt;QGraphicsItemGroup&gt;)</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1075;&#1088;&#1091;&#1087;&#1087;&#1091; &#1089;&#1086; &#1089;&#1094;&#1077;&#1085;&#1099;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1074;&#1089;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1077;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_200.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav11.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_202.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>