<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_291.html]
* At UTC datetime: [2023-08-19 10:06:34.365272]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 291.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1052;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QVideoWidget
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QVideoWidget</b>, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtMultimediaWidgets</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1099;&#1084; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1047;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; 
&#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086; &#1076;&#1083;&#1103; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setvideoOutput()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaPlayer</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QVideoWidget</b> &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - (QWidget,  QMediaBindableInterface) -
              QVideoWidget
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1040; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1090;&#1072;&#1082;&#1086;&#1074;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QVideoWidget([parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QVideoWidget</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086;, &#1080; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077;&#1086;:
</p><ul>
 <li> <b>setFullScreen (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086; &#1079;&#1072;&#1081;&#1084;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1101;&#1082;&#1088;&#1072;&#1085;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1086;&#1085;&#1086; &#1079;&#1072;&#1081;&#1084;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1089;&#1072;&#1084;&#1091; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>isFullScreen ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1101;&#1082;&#1088;&#1072;&#1085;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1074; &#1089;&#1072;&#1084;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setAspectRatioMode (&lt;<i>Coo&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1087;&#1088;&#1080; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
<ul>
 <li> <b>IgnoreAspectRatio (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1087;&#1088;&#1080; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086; &#1085;&#1077; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1095;&#1077;&#1075;&#1086; &#1074;&#1080;&#1076;&#1077;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1078;&#1072;&#1090;&#1099;&#1084; &#1080;&#1083;&#1080; &#1074;&#1099;&#1090;&#1103;&#1085;&#1091;&#1090;&#1099;&#1084;;
 </li><li> <b>KeepAspectRatio (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1042;&#1080;&#1076;&#1077;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1083;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;, &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1083;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1079;&#1072;&#1085;&#1103;&#1090;&#1086;&#1081;;
 </li><li> <b>KeepAspectRatioByExpanding (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1089;&#1086;&#1073;&#1083;&#1102;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1042;&#1080;&#1076;&#1077;&#1086; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; (&#1101;&#1082;&#1088;&#1072;&#1085;), &#1085;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1090;&#1086; &#1095;&#1072;&#1089;&#1090;&#1100;   &#1074;&#1080;&#1076;&#1077;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1081;&#1090;&#1080; &#1079;&#1072; &#1077;&#1077; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
</p><p align="JUSTIFY">
 </p></li><li> <b>aspectRatioMode ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1087;&#1088;&#1080; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setBrightness (&lt;<i>&#1071;&#1088;&#1082;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1103;&#1088;&#1082;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; -100 &#1076;&#1086; 100: &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1077;&#1084;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; - &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1077;&#1090;&#1083;&#1099;&#1084;, &#1072; 0 &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1103;&#1088;&#1082;&#1086;&#1089;&#1090;&#1100; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>brightness ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1103;&#1088;&#1082;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setContrast (&lt;<i>&#1050;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b>   - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; -100 &#1076;&#1086; 100: &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086; &#1084;&#1077;&#1085;&#1077;&#1077; &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; - 
&#1073;&#1086;&#1083;&#1077;&#1077; &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1099;&#1084;, &#1072; 0 &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>contrast ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setHue (&lt;<i>&#1054;&#1090;&#1090;&#1077;&#1085;&#1086;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1090;&#1077;&#1085;&#1086;&#1082; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; -100 &#1076;&#1086; 100: &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1086;&#1090; 0, &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1094;&#1074;&#1077;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086;, &#1072; 0 &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1086; 
&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>hue ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1090;&#1077;&#1085;&#1082;&#1072; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setSaturation (&lt;<i>Hac&#1099;&#1097;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1089;&#1099;&#1097;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; -100 &#1076;&#1086; 100: &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1076;&#1077;&#1083;&#1072;&#1102;&#1090; &#1074;&#1080;&#1076;&#1077;&#1086; &#1084;&#1077;&#1085;&#1077;&#1077; &#1085;&#1072;&#1089;&#1099;&#1097;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; - 
&#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1072;&#1089;&#1099;&#1097;&#1077;&#1085;&#1085;&#1099;&#1084;, &#1072; 0 &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>saturation ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1089;&#1099;&#1097;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1077;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>mediaObject ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaObject</b>) &#1085;&#1072; &#1084;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1081; &#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086; &#1074; &#1101;&#1090;&#1091; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;, &#1080;&#1083;&#1080; <b>None</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1085;&#1077; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085;&#1072; &#1082; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QVideoWidget</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1074;&#1080;&#1076;&#1077;&#1086; (&#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1085;&#1086;&#1096;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;, &#1103;&#1088;&#1082;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1085;&#1090;&#1088;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080; &#1090;. &#1076;.). 
&#1054;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qvideowidget.html" target="_blank"><b>hhttps://doc.qt.io/qt-5/qvideowidget.html</b></a>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1091;&#1102; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077;  &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1072;&#1091;&#1076;&#1080;&#1086; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1074; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1074;&#1080;&#1076;&#1077;&#1086; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1). &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074; &#1077;&#1077; &#1082;&#1086;&#1076; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1080; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtMultimedia
<span class="comm"># ==== &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; ==========</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtMultimediaWidgets
<span class="comm"># == &#1050;&#1086;&#1085;&#1077;&#1094; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; ====</span>
<span class="sl_sl">import</span> sys

<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent,
                    flags=QtCore.Qt.Window | QtCore.Qt.MSWindowsFixedSizeDialogHint)
        <span class="comm"># ==== &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; =========</span>
        self.setWindowTitle(<span class="pech">"&#1042;&#1080;&#1076;&#1077;&#1086;&#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;"</span>)
        <span class="comm"># ==&#1050;&#1086;&#1085;&#1077;&#1094; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; =====</span>

        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1089;&#1072;&#1084; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;</span>
        self.mplPlayer = QtMultimedia.QMediaPlayer()
        self.mplPlayer.setVolume(50)
        self.mplPlayer.mediaStatusChanged.connect(self.initPlayer)
        self.mplPlayer.stateChanged.connect(self.setPlayerState)
        vbox = QtWidgets.QVBoxLayout()
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072;</span>
        btnOpen = QtWidgets.QPushButton(<span class="pech">"&amp;&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1092;&#1072;&#1081;&#1083;..."</span>)
        btnOpen.clicked.connect(self.openFile)
        vbox.addWidget(btnOpen)

        <span class="comm"># ==== &#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; ==========</span>
        vwg = QtMultimediaWidgets.QVideoWidget()
        vwg.setAspectRatioMode(QtCore.Qt.KeepAspectRatio)
        self.mplPlayer.setVideoOutput(vwg)
        vbox.addWidget(vwg)
        <span class="comm"># == &#1050;&#1086;&#1085;&#1077;&#1094; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; ====</span>

        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084;.</span>
        <span class="comm"># &#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1080;&#1093; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080;</span>
        self.sldPosition = QtWidgets.QSlider(QtCore.Qt.Horizontal)
        self.sldPosition.setMinimum(0)
        self.sldPosition.valueChanged.connect(self.mplPlayer.setPosition)
        self.mplPlayer.positionChanged.connect(self.sldPosition.setValue)
        self.sldPosition.setEnabled(<span class="sl_sl">False</span>)
        vbox.addWidget(self.sldPosition)
        hbox = QtWidgets.QHBoxLayout()
        self.btnPlay = QtWidgets.QPushButton(<span class="pech">"&amp;&#1055;&#1091;&#1089;&#1082;"</span>)
        self.btnPlay.clicked.connect(self.mplPlayer.play)
        self.btnPlay.setEnabled(<span class="sl_sl">False</span>)
        hbox.addWidget(self.btnPlay)
        self.btnPause = QtWidgets.QPushButton(<span class="pech">"&#1055;&amp;&#1072;&#1091;&#1079;&#1072;"</span>)
        self.btnPause.clicked.connect(self.mplPlayer.pause)
        self.btnPause.setEnabled(<span class="sl_sl">False</span>)
        hbox.addWidget(self.btnPause)
        self.btnStop = QtWidgets.QPushButton(<span class="pech">"&amp;&#1057;&#1090;&#1086;&#1087;"</span>)
        self.btnStop.clicked.connect(self.mplPlayer.stop)
        self.btnStop.setEnabled(<span class="sl_sl">False</span>)
        hbox.addWidget(self.btnStop)
        vbox.addLayout(hbox)
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;&#1102;</span>
        hbox = QtWidgets.QHBoxLayout()
        lblVolume = QtWidgets.QLabel(<span class="pech">"&amp;&#1043;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;"</span>)
        hbox.addWidget(lblVolume)
        sldVolume = QtWidgets.QSlider(QtCore.Qt.Horizontal)
        sldVolume.setRange(0, 100)
        sldVolume.setTickPosition(QtWidgets.QSlider.TicksAbove)
        sldVolume.setTickInterval(10)
        sldVolume.setValue(50)
        lblVolume.setBuddy(sldVolume)
        sldVolume.valueChanged.connect(self.mplPlayer.setVolume)
        hbox.addWidget(sldVolume)
        btnMute = QtWidgets.QPushButton(<span class="pech">"&amp;&#1058;&#1080;&#1093;&#1086;!"</span>)
        btnMute.setCheckable(<span class="sl_sl">True</span>)
        btnMute.toggled.connect(self.mplPlayer.setMuted)
        hbox.addWidget(btnMute)
        vbox.addLayout(hbox)
        self.setLayout(vbox)
        <span class="comm"># ==== &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; =========</span>
        self.resize(300, 300)
        <span class="comm"># ==&#1050;&#1086;&#1085;&#1077;&#1094; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; =====</span>

    <span class="comm"># &#1044;&#1083;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; getOpenFileUrl() &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
    <span class="comm"># QFileDialog, &#1090;. &#1082;. &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
    <span class="comm"># QMediaContent &#1085;&#1072;&#1084; &#1085;&#1091;&#1078;&#1077;&#1085; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1074;&#1080;&#1076;&#1077;</span>
    <span class="comm"># &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; QUrl</span>
    <span class="sl_sl">def</span> <span class="vyvod">openFile</span>(self):
        <span class="comm"># ==== &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080; =========</span>
        file = QtWidgets.QFileDialog.getOpenFileUrl(parent=self,
                caption=<span class="pech">"&#1042;&#1099;&#1073;&#1077;&#1088;&#1080;&#1090;&#1077; &#1074;&#1080;&#1076;&#1077;&#1086;&#1092;&#1072;&#1081;&#1083;"</span>,
                <span class="tp">filter</span>=<span class="pech">"&#1042;&#1080;&#1076;&#1077;&#1086;&#1092;&#1072;&#1081;&#1083;&#1099; (*.mp4 *.avi)"</span>)
        <span class="comm"># ==&#1050;&#1086;&#1085;&#1077;&#1094; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; =====</span>
        self.mplPlayer.setMedia(QtMultimedia.QMediaContent(file[0]))

    <span class="sl_sl">def</span> <span class="vyvod">initPlayer</span>(self, state):
        <span class="sl_sl">if</span> state == QtMultimedia.QMediaPlayer.LoadedMedia:
            <span class="comm"># &#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;</span>
            <span class="comm"># &#1076;&#1083;&#1103; &#1077;&#1075;&#1086; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;</span>
            self.mplPlayer.stop()
            self.btnPlay.setEnabled(<span class="sl_sl">True</span>)
            self.sldPosition.setEnabled(<span class="sl_sl">True</span>)
            self.sldPosition.setMaximum(self.mplPlayer.duration())
        <span class="sl_sl">elif</span> state == QtMultimedia.QMediaPlayer.EndOfMedia:
            <span class="comm"># &#1055;&#1086; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;</span>
            <span class="comm"># &#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</span>
            self.mplPlayer.stop()
        <span class="sl_sl">elif</span> state == QtMultimedia.QMediaPlayer.NoMedia <span class="sl_sl">or</span> 
               state == QtMultimedia.QMediaPlayer.InvalidMedia:
            <span class="comm"># &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1085;&#1077; &#1073;&#1099;&#1083; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;, &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;,</span>
            <span class="comm"># &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077;&#1084;</span>
            self.sldPosition.setValue(0)
            self.sldPosition.setEnabled(<span class="sl_sl">False</span>)
            self.btnPlay.setEnabled(<span class="sl_sl">False</span>)
            self.btnPause.setEnabled(<span class="sl_sl">False</span>)
            self.btnStop.setEnabled(<span class="sl_sl">False</span>)

    <span class="comm"># &#1042; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1083;&#1080; &#1092;&#1072;&#1081;&#1083;, &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;</span>
    <span class="comm"># &#1083;&#1080; &#1086;&#1085; &#1085;&#1072; &#1087;&#1072;&#1091;&#1079;&#1091; &#1080;&#1083;&#1080; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;, &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</span>
    <span class="comm"># &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1080;&#1083;&#1080; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080;</span>
    <span class="sl_sl">def</span> <span class="vyvod">setPlayerState</span>(self, state):
        <span class="sl_sl">if</span> state == QtMultimedia.QMediaPlayer.StoppedState:
            self.sldPosition.setValue(0)
            self.btnPause.setEnabled(<span class="sl_sl">False</span>)
            self.btnStop.setEnabled(<span class="sl_sl">False</span>)
        <span class="sl_sl">elif</span> state == QtMultimedia.QMediaPlayer.PlayingState:
            self.btnPause.setEnabled(<span class="sl_sl">True</span>)
            self.btnStop.setEnabled(<span class="sl_sl">True</span>)
        <span class="sl_sl">elif</span> state == QtMultimedia.QMediaPlayer.PausedState:
            self.btnPause.setEnabled(<span class="sl_sl">False</span>)
            self.btnStop.setEnabled(<span class="sl_sl">True</span>)

app = QtWidgets.QApplication(sys.argv)
window = MyWindow()
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr291_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris291_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1055;&#1088;&#1086;&#1089;&#1090;&#1077;&#1081;&#1096;&#1080;&#1081; &#1074;&#1080;&#1076;&#1077;&#1086;&#1087;&#1088;&#1086;&#1080;&#1075;&#1088;&#1099;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; </i>QMediaPlaylist</b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_290.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_292.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>