<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_174.html]
* At UTC datetime: [2023-08-19 10:01:36.038379]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 174.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <b>SQL</b>-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;... . &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103; &#1084;&#1077;&#1078;&#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1074;&#1103;&#1079;&#1080;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1090;&#1072;&#1082;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1084;&#1099; &#1088;&#1077;&#1096;&#1080;&#1083;&#1080; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1080;&#1090;&#1100; &#1085;&#1072;&#1096;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1077;&#1085;&#1100;&#1082;&#1086;&#1077; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1074;&#1077;&#1076;&#1103; &#1088;&#1072;&#1079;&#1073;&#1080;&#1077;&#1085;&#1080;&#1077; &#1090;&#1086;&#1074;&#1072;&#1088;&#1086;&#1074; &#1085;&#1072; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080;. &#1042; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <b>data.sqlite</b> &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; <b>category</b> &#1089; 
&#1087;&#1086;&#1083;&#1103;&#1084;&#1080; <b>id</b> &#1080; <b>catname</b>, &#1072; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; <b>good</b> &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; <b>category</b>, &#1075;&#1076;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081;. &#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets, QtSql
<span class="sl_sl">import</span> sys
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1085;&#1072;&#1095;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;</span>
&#1072;&#1088;&#1088; = QtWidgets.QApplication(sys.argv)
con = QtSql.QSqlDatabase.addDatabase(<span class="pech">'QSQLITE'</span>) 
con.setDatabaseName(<span class="pech">'c:\\temp\\data.sqlite'</span>)
<span class="sl_sl">if</span> con.open():
    <span class="comm"># &#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1084; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
     <span class="sl_sl">if</span> <span class="pech">'category'</span> <span class="sl_sl">not</span> <span class="sl_sl">in</span> con.tables():
         query = QtSql.QSqlQuery()
         query.exec(<span class="pech">"create table category (id integer primary key autoincrement, 
             catname text)"</span>)
         query.prepare(<span class="pech">"insert into category values(null, :name)"</span>)
         lst = [<span class="pech">'&#1053;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1080;'</span>, <span class="pech">'&#1056;&#1072;&#1089;&#1093;&#1086;&#1076;&#1085;&#1080;&#1082;&#1080;'</span>]
         query.bindValue(<span class="pech">':name'</span>, lst)
         query.execBatch()
         query.exec(<span class="pech">"alter table good add column category integer default 2"</span>)
         query.exec(<span class="pech">"update good set category=1 where id=1"</span>)
else:
    <span class="comm"># &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;</span>
    <span class="tp">print</span>(con.lastError().text())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr174_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1086;&#1087;&#1099;&#1090;&#1072;&#1077;&#1084;&#1089;&#1103; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; <b>good</b> &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>QSqlTableModel</b> &#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; <b>QTableView</b>. &#1048; &#1089;&#1088;&#1072;&#1079;&#1091; &#1091;&#1074;&#1080;&#1076;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1074; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1077;, 
&#1075;&#1076;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1087;&#1086;&#1083;&#1103; <b>category</b>, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086;&#1074;&#1099;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1). 
</p><p align="CENTER"><img src="images/ris174_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077; &#1076;&#1086;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080;: &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1081; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1080;&#1093; &#1095;&#1080;&#1089;&#1083;&#1086;&#1074;&#1099;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1099;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1069;&#1090;&#1086; &#1074;&#1087;&#1086;&#1083;&#1085;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1085;&#1086; &#1093;&#1086;&#1090;&#1077;&#1083;&#1086;&#1089;&#1100; &#1073;&#1099; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1084; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1099;&#1093; &#1094;&#1080;&#1092;&#1088;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1089;&#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1086; &#1087;&#1086;&#1084;&#1086;&#1078;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QSqlRelationalTableModel</b>, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1091;&#1078;&#1077; &#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1085;&#1086;&#1081; &#1085;&#1072;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>QSqlTableModel</b> &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1052;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1086;&#1083;&#1077; &#1074;&#1085;&#1077;&#1096;&#1085;&#1077;&#1075;&#1086; 
&#1082;&#1083;&#1102;&#1095;&#1072;, &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1091;&#1102; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1080; &#1074; &#1085;&#1077;&#1081; - &#1087;&#1086;&#1083;&#1077; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072; &#1080; &#1087;&#1086;&#1083;&#1077;, &#1086;&#1090;&#1082;&#1091;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1079;&#1103;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRelationalTableModel</b>:
</p><div class="fon"><pre>
  QObject - QAbstractItemModel - QAbstractTableModel - 
    QSqlQueryModel - QSqlTableModel - QSqlRelationalTableModel
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSqlRelationalQueryModel([parent=None][, db = QSqlDatabase()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>db</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;, - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSqlRelationalTableModel</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlTableModel</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_172.html" target="_blank">172 &#1096;&#1072;&#1075;</a>) &#1080; &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1085;&#1080;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; 
&#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qsqlrelationaltablemodel.html" target="_blank"><b>https://doc.qt.io/qt-5/qsqlrelationaltablemodel.html</b></a>):
</p><ul>
 <li> <b>setRelation (&lt;&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;&gt;, &lt;QSqlRelation&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1074;&#1103;&#1079;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1103; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;. &#1057;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1089;&#1074;&#1103;&#1079;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QSqlRelation</b>, &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1084;&#1099; &#1087;&#1086;&#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1084; &#1095;&#1091;&#1090;&#1100; &#1087;&#1086;&#1079;&#1078;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setJoinMode (&lt;<i>Pe&#1078;&#1080;&#1084; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1089;&#1074;&#1103;&#1079;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRelationalTableModel</b>:
<ul>
 <li> <b>InnerJoin (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074;&#1090;&#1086;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089; &#1085;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
 </li><li> <b>LeftJoin (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074;&#1090;&#1086;&#1088;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;.
</li></ul>
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; <b>QSqlRelation</b>. &#1054;&#1085; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1074;&#1103;&#1079;&#1100;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1083;&#1103;&#1084;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;. &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSqlRelation(&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;</i>&gt;, 
      &lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1102;&#1095;&#1072;</i>&gt;, &lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1103;, &#1095;&#1100;&#1080; &#1080;&#1084;&#1077;&#1085;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1080; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1090;&#1089;&#1103; &#1082; &#1087;&#1077;&#1088;&#1074;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSqlRelation</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1085;&#1086; &#1086;&#1085;&#1080; &#1085;&#1077; &#1086;&#1095;&#1077;&#1085;&#1100; &#1085;&#1072;&#1084; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qsqlrelation.html" target="_blank"><b>https://doc.qt.io/qt-5/qsqlrelation.html</b></a>):
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1082;&#1086;&#1076; &#1080;&#1089;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1072; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 2 - &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtSql
<span class="sl_sl">import</span> sys
<span class="sl_sl">def</span> <span class="vyvod">addRecord</span>():
    <span class="comm"># &#1042;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;</span>
    <span class="comm"># &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;</span>
    stm.insertRow(stm.rowCount())
<span class="sl_sl">def</span>  <span class="vyvod">delRecord</span>():
    <span class="comm"># &#1059;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1080;&#1079; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span>
    stm.removeRow(tv.currentIndex().row())
    <span class="comm"># &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1077; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;,</span>
    <span class="comm"># &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; "&#1084;&#1091;&#1089;&#1086;&#1088;&#1085;&#1091;&#1102;" &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;</span>
    stm.select()
    
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"QSqlRelationalTableModel"</span>)
<span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
con = QtSql.QSqlDatabase.addDatabase(<span class="pech">'QSQLITE'</span>)
con.setDatabaseName(<span class="pech">'c:\\temp\\data.sqlite'</span>)
con.open()
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span>
stm = QtSql.QSqlRelationalTableModel(parent = window)
stm.setTable('good')
stm.setSort(1, QtCore.Qt.AscendingOrder)
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1080; &#1089;&#1074;&#1103;&#1079;&#1100; &#1089; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081;</span>
stm.setRelation(3, QtSql.QSqlRelation(<span class="pech">'category'</span>, <span class="pech">'id'</span>, <span class="pech">'catname'</span>))
stm.select()
stm.setHeaderData(1, QtCore.Qt.Horizontal, <span class="pech">'&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;'</span>)
stm.setHeaderData(2, QtCore.Qt.Horizontal, <span class="pech">'&#1050;&#1086;&#1083;-&#1074;&#1086;'</span>)
stm.setHeaderData(3, QtCore.Qt.Horizontal, <span class="pech">'&#1050;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1103;'</span>)
vbox = QtWidgets.QVBoxLayout()
tv = QtWidgets.QTableView()
tv.setModel(stm)
tv.hideColumn(0)
tv.setColumnWidth(1, 150)
tv.setColumnWidth(2, 60)
tv.setColumnWidth(3, 150)
vbox.addWidget(tv)
btnAdd = QtWidgets.QPushButton(<span class="pech">"&amp;&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
btnAdd.clicked.connect(addRecord)
vbox.addWidget(btnAdd)
btnDel = QtWidgets.QPushButton(<span class="pech">"&amp;&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
btnDel.clicked.connect(delRecord)
vbox.addWidget(btnDel)
window.setLayout(vbox)
window.resize(400, 250)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1080; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr174_2.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="CENTER"><img src="images/ris174_2.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.2. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; <b>QSqlRelationalTableModel</b>: 
&#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1072;&#1090;&#1077;&#1075;&#1086;&#1088;&#1080;&#1081;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1077;&#1083;&#1077;&#1075;&#1072;&#1090;&#1086;&#1074;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_173.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_175.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>