<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_312.html]
* At UTC datetime: [2023-08-19 10:07:29.619566]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 312.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;&#1102;. &#1069;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; PDF. &#1050;&#1083;&#1072;&#1089;&#1089; QPdfWriter
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_299.html" target="_blank">299 &#1096;&#1072;&#1075;&#1077;</a> &#1091;&#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100; &#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1092;&#1072;&#1081;&#1083; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; <b>PDF</b> - &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>setOutputFileName()</b>, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1077;&#1084;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091; &#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1091; &#1101;&#1090;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; <b>pdf</b>. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1079;&#1072;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; <b>Windows</b>, &#1095;&#1090;&#1086; 
&#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1085;&#1072;&#1087;&#1088;&#1072;&#1089;&#1085;&#1086;&#1084;&#1091; &#1088;&#1072;&#1089;&#1093;&#1086;&#1076;&#1091; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1099;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>PyQt5</b> &#1087;&#1088;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; <b>PDF</b> &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102;, &#1073;&#1077;&#1079; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPdfWriter</b>, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtGui</b>. &#1045;&#1075;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  QPaintDevice - (QObject, QPagedPaintDevice) - QPdfWriter
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPdfWriter(&lt;<i>&#1055;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1099;&#1074;&#1086;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; <b>PDF</b> &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082; &#1078;&#1077;, &#1082;&#1072;&#1082; &#1080; &#1077;&#1075;&#1086; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_300.html" target="_blank">300 &#1096;&#1072;&#1075;</a>). &#1050;&#1072;&#1082; &#1080; <b>QPrinter</b>, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPdfWriter</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; 
&#1084;&#1077;&#1090;&#1086;&#1076; <b>newPage()</b>, &#1087;&#1086;&#1076;&#1075;&#1086;&#1090;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPdfWriter</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1084; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qpdfwriter.html" target="_blank"><b>https://doc.qt.io/qt-5/qpdfwriter.html</b></a>): 
</p><ul>
 <li> <b>setPageSize (&lt;QPageSize&gt;)</b> -   &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;   &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;   &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;   &#1074;   &#1074;&#1080;&#1076;&#1077;   &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPageOrientation (&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Portrait (0, <i>&#1087;&#1086;&#1088;&#1090;&#1088;&#1077;&#1090;&#1085;&#1072;&#1103;</i>)</b> &#1080;&#1083;&#1080; <b>Landscape (1, <i>&#1083;&#1072;&#1085;&#1076;&#1096;&#1072;&#1092;&#1090;&#1085;&#1072;&#1103;</i>)</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPageMargins (&lt;QMarginsF&gt;[,&lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1086;&#1090; &#1082;&#1088;&#1072;&#1077;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1077; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1072;&#1084;&#1080; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMarginsF</b>. &#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>:
<ul>
 <li> <b>Millimeter (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1084;&#1080;&#1083;&#1083;&#1080;&#1084;&#1077;&#1090;&#1088;&#1099;;
 </li><li> <b>Point (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1091;&#1085;&#1082;&#1090;&#1099;;
 </li><li> <b>Inch (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1076;&#1102;&#1081;&#1084;&#1099;;
 </li><li> <b>Pica (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1080;&#1082;&#1080;;
 </li><li> <b>Didot (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1076;&#1080;&#1076;&#1086; (0,375 &#1084;&#1084;);
 </li><li> <b>Cicero (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1094;&#1080;&#1094;&#1077;&#1088;&#1086; (4,5 &#1084;&#1084;).
</li></ul>
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPageLayout (&lt;QPageLayout&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1088;&#1072;&#1079;&#1091; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102;, &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1086;&#1090; &#1082;&#1088;&#1072;&#1077;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080; &#1090;. &#1087;.) &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setResolution (&lt;<i>&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setCreator (&lt;<i>&#1048;&#1084;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1077;&#1083;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; &#1074; &#1092;&#1072;&#1081;&#1083; <b>PDF</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setTitle (&lt;&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085; &#1074; &#1092;&#1072;&#1081;&#1083; <b>PDF</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1079;&#1072;&#1085;&#1103;&#1090;&#1080;&#1103; &#1074;&#1086;&#1079;&#1100;&#1084;&#1077;&#1084; &#1082;&#1086;&#1076;, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_300.html" target="_blank">300 &#1096;&#1072;&#1075;&#1077;</a>, &#1080; &#1085;&#1077;&#1084;&#1085;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086;: &#1087;&#1091;&#1089;&#1090;&#1100; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; &#1086;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; 
&#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; <b>"QPrinter"</b> &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; <b>"QPdfWriter"</b>, &#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; <b>&#1040;5</b>.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtGui, QtPrintSupport
<span class="sl_sl">import</span> sys

app = QtWidgets.QApplication(sys.argv)
writer = QtGui.QPdfWriter(<span class="pech">"output.pdf"</span>)
writer.setCreator(<span class="pech">"&#1060;&#1048;&#1054;"</span>)
writer.setTitle(<span class="pech">"&#1058;&#1077;&#1089;&#1090;"</span>)
<span class="comm"># &#1047;&#1072;&#1086;&#1076;&#1085;&#1086; &#1087;&#1086;&#1101;&#1082;&#1089;&#1087;&#1077;&#1088;&#1080;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;</span>
<span class="comm"># &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; QPageLayout</span>
layout = QtGui.QPageLayout()
layout.setPageSize(QtGui.QPageSize(QtGui.QPageSize.A5))
layout.setOrientation(QtGui.QPageLayout.Portrait)
writer.setPageLayout(layout)
painter = QtGui.QPainter()
painter.begin(writer)
color = QtGui.QColor(QtCore.Qt.black)
painter.setPen(QtGui.QPen(color))
painter.setBrush(QtGui.QBrush(color))
font = QtGui.QFont(<span class="pech">"Verdana"</span>, pointSize=42)
painter.setFont(font)
painter.drawText(10, writer.height() // 2 - 50, writer.width() - 20,
                 50, QtCore.Qt.AlignCenter | QtCore.Qt.TextDontClip,
                 <span class="pech">"QPdfWriter"</span>)
layout.setOrientation(QtGui.QPageLayout.Landscape)
writer.setPageLayout(layout)
writer.newPage()
pixmap = QtGui.QPixmap(<span class="pech">"img.jpg"</span>)
pixmap = pixmap.scaled(writer.width(),
                       writer.height(),
                       aspectRatioMode=QtCore.Qt.KeepAspectRatio)
painter.drawPixmap(0, 0, pixmap)
painter.end()
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr312_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; <b>pdf</b>-&#1092;&#1072;&#1081;&#1083;&#1072; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris312_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1059; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPdfWriter</b> &#1077;&#1089;&#1090;&#1100; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1082; - &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1089; &#1077;&#1075;&#1086; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>PDF</b>-&#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1084;&#1077;&#1102;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;. &#1042;&#1077;&#1088;&#1086;&#1103;&#1090;&#1085;&#1086;, 
<b>PyQt5</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086;&#1075;&#1086; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>PDF</b> &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072;, &#1080; &#1087;&#1086;&#1085;&#1080;&#1079;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086;, &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1091;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1074; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1084;&#1099; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099;  <b><i>&#1087;&#1086;&#1076;&#1074;&#1077;&#1076;&#1077;&#1084; &#1080;&#1090;&#1086;&#1075; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1084;&#1072;&#1090;&#1077;&#1088;&#1080;&#1072;&#1083;&#1091;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_311.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav17.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_313.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>