<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_303.html]
* At UTC datetime: [2023-08-19 10:07:06.101773]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 303.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;. &#1057;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;. &#1050;&#1083;&#1072;&#1089;&#1089; QPageSize
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPageSize</b>, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtGui</b>, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1080;&#1083;&#1080;, &#1075;&#1086;&#1074;&#1086;&#1088;&#1103; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;. &#1044;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setPageSize()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPageSize()
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPageSize(&lt;<i>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPageSize(&lt;QSize&gt;[, name=<span class="pech">""</span>][, matchPolicy=FuzzyMatch])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPageSize(&lt;QSizeF&gt;, &lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;[, name=<span class="pech">""</span>][, 
      matchPolicy=FuzzyMatch])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; "&#1087;&#1091;&#1089;&#1090;&#1086;&#1081;" &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1080; &#1086; &#1082;&#1072;&#1082;&#1086;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1077; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1089;&#1088;&#1072;&#1079;&#1091;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b> (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1087;&#1086;&#1090;&#1088;&#1077;&#1073;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qpagesize.html#PageSizeId-enum" target="_blank"><b>https://doc.qt.io/qt-5/qpagesize.html#PageSizeId-enum</b></a>): 
<b>&#1040;0 (5), &#1040;1 (6), &#1040;2 (7), A3 (8), &#1040;4 (0), &#1040;5 (9), Letter (2), Legal (3)</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1080; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1089;&#1083;&#1091;&#1078;&#1072;&#1090; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077;&#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> 
(&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_032.html" target="_blank">32 &#1096;&#1072;&#1075;</a>), &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1089;&#1072;&#1084;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1093;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>name</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, 
&#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1080;&#1084;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074;&#1080;&#1076;&#1072; <b>Custom(&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;*&lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;)</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080; &#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1101;&#1090;&#1086;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>matchPolicy</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086;&#1076;&#1073;&#1086;&#1088;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; 
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>:
</p><ul>
 <li> <b>FuzzyMatch (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080; &#1082; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;;
 </li><li> <b>FuzzyQrientationMatch (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080; &#1082; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1073;&#1077;&#1079; &#1091;&#1095;&#1077;&#1090;&#1072; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;;
 </li><li> <b>ExactMatch (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1090;&#1086;&#1095;&#1085;&#1086; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSizeF</b>, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;. &#1042;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1072; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>:
</p><ul>
 <li> <b>Millimeter (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1084;&#1080;&#1083;&#1083;&#1080;&#1084;&#1077;&#1090;&#1088;&#1099;;
 </li><li> <b>Point (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1091;&#1085;&#1082;&#1090;&#1099;;
 </li><li> <b>Inch (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1076;&#1102;&#1081;&#1084;&#1099;;
 </li><li> <b>Pica (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1080;&#1082;&#1080;;
 </li><li> <b>Didot (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1076;&#1080;&#1076;&#1086; (0,375 &#1084;&#1084;);
 </li><li> <b>Cicero (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1094;&#1080;&#1094;&#1077;&#1088;&#1086; (4,5 &#1084;&#1084;).
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
</p><div class="fon"><pre>
  <span class="comm">#  &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1040;5</span>
  ps = QtGui.QPageSize(QtGui.QPageSize. A5) 
  printer.setPageSize(ps)
  <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; 100 x 100 &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074; &#1089; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; "&#1054;&#1089;&#1086;&#1073;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;"</span>
  sz = QtCore.QSize(400, 300)
  ps = QtGui.QPageSize(sz, name=<span class="pech">"&#1054;&#1089;&#1086;&#1073;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;"</span>, 
      matchPolicy = QtGui.QPageSize.FuzzyMatch) 
  pl.printer.setPageSize(ps)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPageSize</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qpagesize.html" target="_blank"><b>https://doc.qt.io/qt-5/qpagesize.html</b></a>): 
</p><ul>
 <li> <b>size (&lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> &#1080; <b>rect (&lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072;&#1093; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSizeF</b> &#1080;&#1083;&#1080; <b>QRectF</b> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>size (&lt;<i>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;  
&#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072;&#1093; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSizeF</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  s = QtGui.QPageSize.size(QtGui.QPageSize.&#1040;0, QtGui,QPageSize.Millimeter) 
  <span class="tp">print</span> (s.width(), <span class="pech">"x"</span>, s.height())
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: 841.0 x 1189.0</span>
</pre></div>
 </li><li> <b>sizePixels (&lt;<i>Pa&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</i>&gt;) &#1080; rectPixels (&lt;<i>&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; 
&#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093; &#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> &#1080;&#1083;&#1080; <b>QRect</b> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;:
<div class="fon"><pre>
  ps = QtGui.QPageSize(QtGui.QPageSize.A5)
  s = ps.sizePixels(600)
  <span class="tp">print</span>(s.width(), <span class="pech">"x"</span>, s.height())
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: 3500 x 4958</span>
</pre></div>
 </li><li> <b>sizePixels (&lt;<i>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1056;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> -  &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;  &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;
&#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093; &#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1080; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>. &#1052;&#1077;&#1090;&#1086;&#1076; 
&#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>sizePoints</b> () &#1080; <b>rectPoints ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> &#1080;&#1083;&#1080; <b>QRect</b> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>sizePoints (&lt;<i>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072;&#1093; 
&#1076;&#1083;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1072; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>swap (&lt;QPageSize&gt;)</b> - &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1084; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>name ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>name (&lt;<i>&#1048;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>isEquivalentTo (&lt;QPageSize&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1088;&#1072;&#1074;&#1085;&#1099; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;, &#1080; 
<b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1072;&#1082;&#1078;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPageSize</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1099; &#1089;&#1088;&#1072;&#1074;&#1085;&#1077;&#1085;&#1080;&#1103; == &#1080; !=:
</p><div class="fon"><pre>
  s1 = QtGui.QPageSize(QtGui.QPageSize.A4) 
  s2 = QtGui.QPageSize(QtGui.QPageSize.A4) 
  s3 = QtGui.QPageSize(QtGui.QPageSize.A3)
  rint(s1 == s2)   <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: True</span>
  <span class="tp">print</span>(s1 != s3)  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: True</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QPageLayout</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_302.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_304.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>