<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_054.html]
* At UTC datetime: [2023-08-19 09:56:27.402243]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 54.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1055;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090; &#1074;&#1089;&#1077;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1102; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1086;&#1073;&#1084;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1086;&#1073;&#1097;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080;. &#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;, - &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; 
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1072;&#1095;&#1077;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; &#1080; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074; &#1085;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; &#1089;&#1086; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, - &#1090;&#1072;&#1082;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; 
&#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>keyPressEvent()</b>. &#1057;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081; &#1076;&#1077;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1080;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1086;&#1076; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;. &#1042;&#1089;&#1077; &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; 
&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QEvent</b> &#1080; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>accept ()</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1097;&#1080;&#1081; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1091;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1057;&#1082;&#1072;&#1078;&#1077;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>closeEvent()</b> &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>accept()</b> &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;. &#1069;&#1090;&#1086;&#1090; &#1092;&#1083;&#1072;&#1075; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
 </li><li> <b>ignore ()</b> - &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1083;&#1072;&#1075;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1097;&#1080;&#1081; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1091;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1058;&#1072;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>closeEvent()</b> &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>ignore()</b> &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1086;&#1082;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;;
 </li><li> <b>setAccept&#1077;d (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1092;&#1083;&#1072;&#1075;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1097;&#1080;&#1081;  &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1091;&#1102;  &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091;  &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;,  &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;  (&#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;  
&#1074;&#1099;&#1079;&#1086;&#1074;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>accept()</b>), &#1072; &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1089;&#1073;&#1088;&#1086;&#1096;&#1077;&#1085; (&#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>ignore()</b>);
 </li><li> <b>isAccepted ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072;, &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1091;&#1102; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;;
 </li><li> <b>spontaneous ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;, &#1080; <b>False</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;;
 </li><li> <b>type ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1080;&#1087; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090;&#1089;&#1103; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QEvent</b> &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qevent.html" target="_blank"><b>https://doc.qt.io/qt-5/qevent.html</b></a>):
<ul>
 <li> <b>0</b> - &#1085;&#1077;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;;
 </li><li> <b>1 - Timer</b> - &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1090;&#1072;&#1081;&#1084;&#1077;&#1088;&#1072;;
 </li><li> <b>2 - MouseButtonPress</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>3 - MouseButtonRelease</b> - &#1086;&#1090;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>4 - MouseButtonDbiClick</b> - &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1081; &#1097;&#1077;&#1083;&#1095;&#1086;&#1082; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>5 - MouseMove</b> - &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>6 - KeyPress</b> - &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1072;;
 </li><li> <b>7 - KeyRelease</b> - &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077; &#1086;&#1090;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072;;
 </li><li> <b>8 - FocusIn</b> - &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;;
 </li><li> <b>9 - FocusOut</b> - &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1085; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;;
 </li><li> <b>10 - Enter</b> - &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>11 - Leave</b> - &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1082;&#1080;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>12 - Paint</b> - &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>13 - Move</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1072;&#1089;&#1100;;
 </li><li> <b>14 - Resize</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>17 - Show</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;;
 </li><li> <b>18 - Hide</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;;
 </li><li> <b>19 - Close</b> - &#1086;&#1082;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;;
 </li><li> <b>24 - WindowActivate</b> - &#1086;&#1082;&#1085;&#1086; &#1089;&#1090;&#1072;&#1083;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;;
 </li><li> <b>25 - WindowDeactivate</b> - &#1086;&#1082;&#1085;&#1086; &#1089;&#1090;&#1072;&#1083;&#1086; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;;
 </li><li> <b>26 - ShowToParent</b> - &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;;
 </li><li> <b>27 - HideToParent</b> - &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;;
 </li><li> <b>31 - Wheel</b> - &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1095;&#1077;&#1085;&#1086; &#1082;&#1086;&#1083;&#1077;&#1089;&#1080;&#1082;&#1086; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>40 - Clipboard</b> - &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1073;&#1091;&#1092;&#1077;&#1088;&#1072; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1086;;
 </li><li> <b>60 - DragEnter</b> - &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;;
 </li><li> <b>61 - DragMove</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;;
 </li><li> <b>62 - DragLeave</b> - &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1084;&#1099;&#1096;&#1080; &#1087;&#1086;&#1082;&#1080;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;;
 </li><li> <b>63 - Drop</b> - &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1072;;
 </li><li> <b>68 - ChildAdded</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;;
 </li><li> <b>69 - ChildPolished</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>71 - ChildRemoved</b> - &#1091;&#1076;&#1072;&#1083;&#1077;&#1085; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;;
 </li><li> <b>74 - PolishRequest</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;;
 </li><li> <b>75 - Polish</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>82 - ContextMenu</b> - &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1102;;
 </li><li> <b>99 - ActivationChange</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1082;&#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;;
 </li><li> <b>103 - WindowBlocked</b> - &#1086;&#1082;&#1085;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;;
 </li><li> <b>104 - WindowUnblocked</b> - &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086; &#1088;&#1072;&#1079;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;;
 </li><li> <b>105 - WindowStateChange</b> - &#1089;&#1090;&#1072;&#1090;&#1091;&#1089; &#1086;&#1082;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103;;
 </li><li> <b>121 - ApplicationActivate</b> - &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1083;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;;
 </li><li> <b>122 - ApplicationDeactivate</b> - &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1083;&#1086; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;;
 </li><li> <b>1000 - User</b> - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;;
 </li><li> <b>65535 - MaxUser</b> - &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <b>registerEventType ([&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;])</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1090;&#1080;&#1087; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1079;&#1072;&#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1086;&#1090; <b>QEvent.User(1000)</b> &#1076;&#1086; <b>QEvent.MaxUser(65535)</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090; &#1074;&#1089;&#1077;&#1093; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1089; &#1087;&#1088;&#1077;&#1076;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; <b>event(self, &lt;event&gt;)</b>. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; 
&#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1080;. &#1069;&#1090;&#1086;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1090;&#1080;&#1087;&#1086;&#1074; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1076;&#1083;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; <b>MouseButtonPress</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMouseEvent</b>, &#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; 
<b>KeyPress</b> - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QKeyEvent</b>. &#1052;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1074;&#1089;&#1077;&#1084;&#1080; &#1101;&#1090;&#1080;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084;&#1080;, &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1079; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>event()</b> &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, 
&#1090;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>event()</b> &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1101;&#1090;&#1086; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  <span class="sl_sl">return</span> QtWidgets.QWidget.event(self, e)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>event()</b>. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1090;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. 
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLabel</b> &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  <span class="sl_sl">return</span> QtWidgets.QLabel.event(self, e)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1087;&#1077;&#1088;&#1077;&#1093;&#1074;&#1072;&#1090;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080;, &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding:  utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">import</span> time
<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent)
        self.resize(300, 100)
    <span class="sl_sl">def</span> <span class="vyvod">event</span>(self, e):
        <span class="sl_sl">if</span> e.type() == QtCore.QEvent.KeyPress:
            <span class="tp">print</span>(<span class="pech">"&#1053;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;"</span>)
            <span class="tp">print</span>(<span class="pech">"&#1050;&#1086;&#1076;:"</span>, e.key(), <span class="pech">", &#1090;&#1077;&#1082;&#1089;&#1090;:"</span>, e.text())
        <span class="sl_sl">elif</span> e.type() == QtCore.QEvent.Close:
            <span class="tp">print</span>(<span class="pech">"&#1054;&#1082;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086;"</span>)
        <span class="sl_sl">elif</span> e.type() == QtCore.QEvent.MouseButtonPress:
            <span class="tp">print</span> (<span class="pech">"&#1065;&#1077;&#1083;&#1095;&#1086;&#1082; &#1084;&#1099;&#1096;&#1100;&#1102;. &#1050;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099;:"</span>, e.x(), e.y())
        <span class="sl_sl">return</span> QtWidgets.QWidget.event(self, e) <span class="comm"># &#1054;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1076;&#1072;&#1083;&#1100;&#1096;&#1077;</span>

<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr54_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris54_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1084;&#1099; &#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; <b><i>&#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_053.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_055.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</li></ul></div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>