<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_126.html]
* At UTC datetime: [2023-08-19 09:59:30.607429]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 126.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1064;&#1082;&#1072;&#1083;&#1072; &#1089; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1086;&#1084; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAbstractSlider</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:

</p><ul>
 <li> <b>actionTriggered (&lt;<i>&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;</i>&gt;)</b> -   &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;,   &#1082;&#1086;&#1075;&#1076;&#1072;   &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;   &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1089; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1086;&#1084; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>PageUp</b>). &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; 
&#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;. &#1058;&#1072;&#1082; &#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;  &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;:
<ul>
 <li> <b>SliderNoAction (<i>&#1080;&#1083;&#1080;</i> 0)</b>,
 </li><li> <b>SliderSingleStepAdd (<i>&#1080;&#1083;&#1080;</i> 1)</b>,
 </li><li> <b>SliderSingleStepSub (<i>&#1080;&#1083;&#1080;</i> 2)</b>,
 </li><li> <b>SliderPageStepAdd (<i>&#1080;&#1083;&#1080;</i> 3)</b>,
 </li><li> <b>SliderPageStepSub (<i>&#1080;&#1083;&#1080;</i> 4)</b>,
 </li><li> <b>SliderToMinimum (<i>&#1080;&#1083;&#1080;</i> 5)</b>,
 </li><li> <b>SliderToMaximum (<i>&#1080;&#1083;&#1080;</i> 6)</b> &#1080;
 </li><li> <b>SliderMove (<i>&#1080;&#1083;&#1080;</i> 7)</b>
</li></ul>
 &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractslider</b>;
<p align="JUSTIFY">
 </p></li><li> <b>rangeChanged (&lt;<i>&#1052;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;</i>&gt;, &lt;<i>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1085;&#1086;&#1074;&#1099;&#1077; 
&#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1094;&#1077;&#1083;&#1099;&#1084;&#1080; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>sliderPressed</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>sliderMoved (&lt;<i>&#1055;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> -   &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;   &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086;   &#1087;&#1088;&#1080;   &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1080;   &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072;, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>sliderReleased</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1085;&#1080;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077; &#1085;&#1072;&#1078;&#1072;&#1090;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>valueChanged (&lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSlider</b> &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qslider.html" target="_blank"><b>https://doc.qt.io/qt-5/qslider.html</b></a>):
</p><ul>
 <li> <b>setTickPosition (&lt;<i>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1088;&#1080;&#1089;&#1086;&#1082;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSlider</b>:
<ul>
 <li> <b>NoTicks</b> - &#1073;&#1077;&#1079; &#1088;&#1080;&#1089;&#1086;&#1082;;
 </li><li> <b>TicksBothSides</b> - &#1088;&#1080;&#1089;&#1082;&#1080; &#1087;&#1086; &#1086;&#1073;&#1077; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;;
 </li><li> <b>TicksAbove</b> - &#1088;&#1080;&#1089;&#1082;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;;
 </li><li> <b>TicksBelow</b> - &#1088;&#1080;&#1089;&#1082;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1089;&#1085;&#1080;&#1079;&#1091;;
 </li><li> <b>TicksLeft</b> - &#1088;&#1080;&#1089;&#1082;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1074;&#1072;;
 </li><li> <b>TicksRight</b> - &#1088;&#1080;&#1089;&#1082;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setTickInterval (&lt;<i>&#1056;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1080;&#1089;&#1082;&#1072;&#1084;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1088;&#1091;&#1075;&#1086;&#1074;&#1091;&#1102; &#1096;&#1082;&#1072;&#1083;&#1091; &#1089; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1086;&#1084;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_125.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_127.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>