<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_041.html]
* At UTC datetime: [2023-08-19 09:55:48.812973]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 41.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1079;&#1072;&#1076;&#1072;&#1095;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072; (&#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;), &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1091; &#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1100;&#1102; <b>Window</b> (&#1080;&#1083;&#1080; <b>Background</b>). &#1062;&#1074;&#1077;&#1090;&#1086;&#1074;&#1072;&#1103; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1072; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1094;&#1074;&#1077;&#1090;&#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1080; 
&#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPalette</b> (&#1084;&#1086;&#1076;&#1091;&#1083;&#1100; <b>QtGui</b>):
</p><ul>
 <li> <b>Active</b> &#1080; <b>Normal</b>  - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; (&#1086;&#1082;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072;);
 </li><li> <b>Disabled</b> (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1) - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085;;
 </li><li> <b>Inactive</b> (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 2) - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1077;&#1085; (&#1086;&#1082;&#1085;&#1086; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;&#1085;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;).
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <b>palette()</b>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1076;&#1083;&#1103; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1088;&#1086;&#1083;&#1080; &#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>setColor()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPalette</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  setColor ([&lt;<i>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</i>&gt;, ]&lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;, &lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1076;&#1083;&#1103; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1094;&#1074;&#1077;&#1090;. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>Window</b> (&#1080;&#1083;&#1080; <b>Background</b>) &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072;, a 
<b>WindowText</b> (&#1080;&#1083;&#1080; <b>Foreground</b>) - &#1094;&#1074;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QPalette</b> (&#1089;&#1084;. <a href="https://doc.qt.io/qt-5/qpalette.html" target="-blank"><b>https://doc.qt.io/qt-5/qpalette.html</b></a>).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1074;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>black</b>, <b>white</b> &#1080; &#1090;. &#1076;.) &#1080;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, 
<b>QColor("red")</b>, <b>QColor("#ff0000")</b>, <b>QColor(255, 0, 0)</b> &#1080;  &#1076;&#1088;.).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setPalette()</b> &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1099;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;-&#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; 
&#1080;&#1084;&#1077;&#1102;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1092;&#1086;&#1085; &#1080; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1091;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b> &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <b>setAutoFillBackground()</b> &#1086;&#1082;&#1085;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>CSS</b>-&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>background-&#1089;&#1086;lor</b>. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setStyleSheet()</b> &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081; 
&#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1084;&#1080; (&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;), &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setStyleSheet()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QApplication</b>) &#1080;&#1083;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072; 
&#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setStyleSheet()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>). &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;&#1080;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077;. 
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080;&#1089;&#1100; <b>Web</b>-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084;, &#1090;&#1086; <b>CSS</b> &#1074;&#1072;&#1084; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1085;&#1077;&#1090;, &#1090;&#1086; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1080;&#1079;&#1091;&#1095;&#1080;&#1090;&#1100; <b>HTML</b> &#1080; <b>CSS</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1086;&#1082;&#1085;&#1086; &#1089; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;&#1102;. &#1044;&#1083;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;, &#1072; &#1076;&#1083;&#1103; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; - &#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1081;. &#1062;&#1074;&#1077;&#1090; &#1092;&#1086;&#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1073;&#1077;&#1083;&#1099;&#1084;. &#1044;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1091;, &#1072; &#1076;&#1083;&#1103; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; - <b>CSS</b>-&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>background-&#1089;&#1086;lor</b>.
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:  utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtGui, QtWidgets
<span class="sl_sl">import</span> sys
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"&#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072;"</span>)
window.resize(300, 100)
pal = window.palette()
pal.setColor(QtGui.QPalette.Normal, QtGui.QPalette.Window, QtGui.QColor(<span class="pech">"#008800"</span>))
pal.setColor(QtGui.QPalette.Inactive, QtGui.QPalette.Window, QtGui.QColor(<span class="pech">"#ff0000"</span>))
window.setPalette(pal)
label = QtWidgets.QLabel(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;"</span>)
label.setAlignment(QtCore.Qt.AlignHCenter)
label.setStyleSheet(<span class="pech">"background-color: #ffffff;"</span>)
label.setAutoFillBackground(<span class="sl_sl">True</span>)
vbox = QtWidgets.QVBoxLayout()
vbox.addWidget(label)
window.setLayout(vbox)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr41_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris41_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; (&#1074;&#1074;&#1077;&#1088;&#1093;&#1091;) &#1080; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; (&#1074;&#1085;&#1080;&#1079;&#1091;) &#1086;&#1082;&#1085;&#1072;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_040.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_042.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>