<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_241.html]
* At UTC datetime: [2023-08-19 10:04:20.356344]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 241.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1044;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;. &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1081; &#1090;&#1072;&#1082;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialog</b> &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1086;&#1082;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b><i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b> &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QDialog
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDialog ([parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;] [, flags=&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1090;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;. &#1045;&#1089;&#1083;&#1080; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1090;&#1086; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1094;&#1077;&#1085;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;, - &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; 
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1082;&#1085;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1072; &#1085;&#1077; &#1074;&#1089;&#1077; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1082;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>flags</b>, &#1084;&#1099; &#1091;&#1078;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_025.html" target="_blank">25 &#1096;&#1072;&#1075;&#1077;</a>. &#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - <b>Dialog</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialog</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qdialog.html" target="_blank"><b>https://doc.qt.io/qt-5/qdialog.html</b></a>):
</p><ul>
 <li> <b>exec ()</b> - &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1076;&#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b>:
<ul>
 <li> <b>Accepted (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>&#1054;&#1050;</b>;
 </li><li> <b>Rejected (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Cancel</b>, &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b> &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072; &#1080;&#1083;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Esc</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>&#1077;&#1093;&#1077;&#1089;_()</b>, &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1089; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1084;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080; <b>PyQt</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1090;&#1072;&#1090;&#1091;&#1089;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; (&#1082;&#1083;&#1072;&#1089;&#1089; <b>MyDialog</b> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b>, a <b>window</b> - &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;):
</p><div class="fon"><pre>
  <span class="sl_sl">def</span> <span class="vyvod">on_clicked</span>():
      dialog = MyDialog(window)
      result = dialog.exec_()
      <span class="sl_sl">if</span> result == QtWidgets.QDialog.Accepted:
          <span class="tp">print</span>(<span class="pech">"&#1053;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1054;&#1050;"</span>)
          <span class="comm"># &#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; </span>
      <span class="sl_sl">else</span>:
          <span class="tp">print</span>(<span class="pech">"&#1053;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; Cancel"</span>)
</pre></div>
 </li><li> <b>accept ()</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Accepted</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090; &#1089; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b>:
<div class="fon"><pre>
  self.btnOK.clicked.connect(self.accept)
</pre></div>
 </li><li> <b>reject ()</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Rejected</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1077;&#1075;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090; &#1089; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>Cancel</b>:
<div class="fon"><pre>
  self.btnCancel.clicked.connect(self.reject)
</pre></div>
 </li><li> <b>done (&lt;<i>Ko&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setResult (&lt;<i>Ko&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;</i>&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>result ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>setSizeGripEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1090;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090; (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;);
<p align="JUSTIFY">
 </p></li><li> <b>isSizeGripEnabled ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084; &#1085;&#1080;&#1078;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setVisible (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1086;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> - &#1090;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1086;. &#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1086;&#1083;&#1077;&#1077; &#1091;&#1076;&#1086;&#1073;&#1085;&#1099;&#1084;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080; <b>show()</b> &#1080; <b>hide()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>open ()</b> - &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1074; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;, &#1085;&#1086; &#1085;&#1077; &#1076;&#1086;&#1078;&#1080;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103;. &#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1072; &#1085;&#1077; &#1074;&#1089;&#1077; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setModal (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>exec()</b>, &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, - 
&#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setModal()</b>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1073;&#1099;&#1083;&#1086; &#1085;&#1077; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>show()</b> &#1080;&#1083;&#1080; <b>setVisible()</b>. 
&#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1101;&#1090;&#1080;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090;  &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100;   &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;   <b>raise_()</b>   (&#1095;&#1090;&#1086;&#1073;&#1099;   &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100;  &#1086;&#1082;&#1085;&#1086;   &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;   &#1074;&#1089;&#1077;&#1093;   &#1086;&#1082;&#1086;&#1085;)   &#1080; <b>activateWindow()</b> (&#1095;&#1090;&#1086;&#1073;&#1099; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;, &#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;).
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setWindowModality(&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
</p><ul>
 <li> <b>NonModal (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1086;&#1082;&#1085;&#1086; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;;
 </li><li> <b>WindowModal (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1086;&#1082;&#1085;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;;
 </li><li> <b>ApplicationModal (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1086;&#1082;&#1085;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1086;&#1082;&#1085;&#1072; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1082;&#1085;&#1072;, &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1080;&#1079; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;, &#1085;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setWindowModality()</b> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1076;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>windowModality()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080; &#1086;&#1082;&#1085;&#1086; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>isModal()</b> &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, 
&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1082;&#1085;&#1086; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</p></li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialog</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>accepted ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; <b>Accepted</b> (&#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>&#1054;&#1050;</b>). &#1053;&#1077; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>hide()</b> &#1080;&#1083;&#1080; <b>setVisible()</b>;
 </li><li> <b>rejected ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1092;&#1083;&#1072;&#1075;&#1072; <b>Rejected</b> (&#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Cancel</b>, &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b> &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072; &#1080;&#1083;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Esc</b>). He &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1086;&#1082;&#1085;&#1072; 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>hide()</b> &#1080;&#1083;&#1080; <b>setVisible()</b>;
 </li><li> <b>finished (&lt;<i>Ko&#1076; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1077; &#1082;&#1086;&#1076;&#1072; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1080;&#1083;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>accept()</b>, <b>reject()</b> &#1080; <b>done()</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103;. 
&#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1085;&#1077; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>hide()</b> &#1080;&#1083;&#1080; <b>setVisible()</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setAutoDefault()</b> &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; <b>True</b> &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Enter</b> &#1087;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1085;&#1072;&#1078;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b><i>&#1055;&#1088;&#1086;&#1073;&#1077;&#1083;</i></b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setDefauit()</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1069;&#1090;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Enter</b>, &#1082;&#1086;&#1075;&#1076;&#1072; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1085;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QDialogButtonBox</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_240.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_242.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>