<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_116.html]
* At UTC datetime: [2023-08-19 09:59:05.289274]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 116.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1058;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;, &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084;  &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QTextBrowser</b> &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextEdit</b> &#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088; &#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;. 
&#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QFrame -
        QAbstractScrollArea - QTextEdit - QTextBrowser
</pre></div>
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextBrowser</b>: 
<div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QTextBrowser([parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QTextBrowser</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qtextbrowser.html" target="_blank"><b>https://doc.qt.io/qt-5/qtextbrowser.html</b></a>):
</p><ul>
 <li> <b>setSource (&lt;QUrl&gt;)</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QUrl</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  <span class="comm"># &#1047;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084; &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;&#1084; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; </span>
  url = QtCore.QUrl(<span class="pech">"text.txt"</span>) 
  browser.setSource(url)
</pre></div>
 </li><li> <b>source ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QUrl</b> &#1089; &#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>reload ()</b> - &#1087;&#1077;&#1088;&#1077;&#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>home ()</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>backward ()</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>forward ()</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>backwardHistoryCount ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>forwardHistoryCount ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1080;&#1079; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>isBackwardAvailable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isForwardAvailable ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>clearHistory ()</b> - &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>historyTitle (&lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1081;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1090;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;, 
&#1086;&#1090;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1075;&#1086; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1081;, &#1077;&#1089;&#1083;&#1080; 0 - &#1090;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; - &#1090;&#1086; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;, 
&#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1090;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1075;&#1086; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1081;;
<p align="JUSTIFY">
 </p></li><li> <b>historyUrl (&lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1081;</i>&gt;)</b> - &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1095;&#1090;&#1086; <b>historyTitle()</b>, &#1085;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1072;&#1076;&#1088;&#1077;&#1089; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QUrl</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setOpenLinks (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085; (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;). 
&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_115.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_117.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>