<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_017.html]
* At UTC datetime: [2023-08-19 09:54:43.887247]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 17.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1086;&#1076;&#1091;&#1083;&#1100; queue: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;, &#1080; &#1080;&#1093; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1083;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1086;&#1073;&#1084;&#1077;&#1085;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1084;, &#1095;&#1090;&#1086; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1099; &#1076;&#1077;&#1089;&#1103;&#1090;&#1100; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1073;&#1077;&#1089;&#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;&#1084; &#1094;&#1080;&#1082;&#1083;&#1077;. 
&#1050;&#1072;&#1082; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1084;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1091;, &#1072; &#1085;&#1077; &#1074;&#1089;&#1077;&#1084; &#1089;&#1088;&#1072;&#1079;&#1091;? &#1048; &#1082;&#1072;&#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077;? &#1052;&#1086;&#1078;&#1085;&#1086;, &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1086;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1077; &#1080;&#1084;&#1077;&#1085; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1101;&#1090;&#1086;&#1090; 
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1085;&#1086; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1088;&#1080;&#1076;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1096;&#1072;&#1090;&#1100; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089; &#1086; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1089;&#1088;&#1072;&#1079;&#1091; &#1076;&#1077;&#1089;&#1103;&#1090;&#1100;&#1102; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080;. &#1042;&#1077;&#1076;&#1100; &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1090;&#1086; &#1086;&#1076;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; 
&#1084;&#1086;&#1075;&#1091;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;, &#1080; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1091; &#1085;&#1077; &#1093;&#1074;&#1072;&#1090;&#1080;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081;, - &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1077;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;&#1103; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;. &#1055;&#1086;&#1087;&#1088;&#1086;&#1089;&#1090;&#1091; &#1075;&#1086;&#1074;&#1086;&#1088;&#1103;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1089;&#1077;&#1089;&#1090;&#1100; &#1085;&#1072; &#1089;&#1090;&#1091;&#1083;, 
&#1072; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1095;&#1077;&#1083;&#1086;&#1074;&#1077;&#1082; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080;&#1079;-&#1087;&#1086;&#1076; &#1074;&#1072;&#1089;. &#1044;&#1091;&#1084;&#1072;&#1077;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1091;&#1089;&#1087;&#1077;&#1077;&#1090;&#1077; &#1089;&#1077;&#1089;&#1090;&#1100;?
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1086;&#1076;&#1091;&#1083;&#1100; <b>queue</b>, &#1074;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; <b>Python</b>, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091;. &#1052;&#1086;&#1076;&#1091;&#1083;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1090; &#1088;&#1072;&#1079;&#1085;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072; 
&#1087;&#1086;&#1090;&#1086;&#1082;&#1086;-&#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1099;&#1077; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;. &#1055;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1101;&#1090;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;:
</p><ul>
 <li>  <b>Queue</b> - <b><i>&#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; (&#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1088;&#1080;&#1096;&#1077;&#1083;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1074;&#1099;&#1096;&#1077;&#1083;)</i></b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;:
<div class="fon"><pre>
  &lt;<i>O&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = Queue([maxsize=0])
</pre></div>
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; <span class="sl_sl">import</span> queue
&gt;&gt;&gt; q = queue.Queue()
&gt;&gt;&gt; q.put_nowait (<span class="pech">"elem1"</span>)
&gt;&gt;&gt; q.put_nowait (<span class="pech">"elem2"</span>)
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">'elem1'</span>
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">'elem2'</span>
</pre></div>
 </li><li>  <b>LifoQueue</b> - <b><i>&#1089;&#1090;&#1077;&#1082; (&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084; &#1087;&#1088;&#1080;&#1096;&#1077;&#1083;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1074;&#1099;&#1096;&#1077;&#1083;)</i></b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;:
<div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = LifoQueue([maxsize=0]) 
</pre></div>
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; q = queue.LifoQueue()
&gt;&gt;&gt; q.put_nowait (<span class="pech">"elem1"</span>)
&gt;&gt;&gt; q.put_nowait (<span class="pech">"elem2"</span>)
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">'elem2'</span>
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">'elem1'</span>
</pre></div>
 </li><li> <b>PriorityQueue</b> - <b><i>&#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1089; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1072;&#1084;&#1080;</i></b>. &#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1072;&#1084;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1086;, &#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1097;&#1077;&#1077; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;, &#1072; &#1074;&#1090;&#1086;&#1088;&#1099;&#1084; - 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;. &#1055;&#1088;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089; &#1085;&#1072;&#1080;&#1074;&#1099;&#1089;&#1096;&#1080;&#1084; &#1087;&#1088;&#1080;&#1086;&#1088;&#1080;&#1090;&#1077;&#1090;&#1086;&#1084; (&#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;&#1072;). &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
<div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = PriorityQueue([maxsize=0])
</pre></div>
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; q = queue.PriorityQueue ()
&gt;&gt;&gt; q.put_nowait ( (10, <span class="pech">"elem1"</span>) )
&gt;&gt;&gt; q.put_nowait ( (3, <span class="pech">"elem2"</span>) )
&gt;&gt;&gt; q.put_nowait ( (12, <span class="pech">"elem3"</span>) )
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">(3, 'elem2')</span>
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">(10, 'elem1')</span>
&gt;&gt;&gt; q.get_nowait()
<span class="vyvod">(12, 'elem3')</span>
</pre></div>
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>maxsize</b> &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1090;&#1088;&#1077;&#1093; &#1089;&#1083;&#1091;&#1095;&#1072;&#1103;&#1093; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1088;&#1072;&#1074;&#1077;&#1085; &#1085;&#1091;&#1083;&#1102; (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;) &#1080;&#1083;&#1080; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102;, &#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1085;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1069;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1101;&#1090;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;;
</p><ul>
 <li> <b>put (&lt;<i>&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;</i>&gt;[, block=True] [, timeout=None])</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>block</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1086;&#1090;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100; 
&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, - &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>timeout</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;  &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;.  &#1045;&#1089;&#1083;&#1080;  &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1090;&#1086;  &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;  &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; 
<b>queue.Full</b>. &#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; <b>block</b> &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; <b>False</b> &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1085;&#1077;&#1077; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1080; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; 
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1073;&#1091;&#1076;&#1080;&#1090; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <b>queue.Full</b> &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;;
 </li><li> <b>put_nowait (&lt;<i>&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;</i>&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1077;&#1079; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103;. &#1069;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086;: <b>put(&lt;&#1069;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&gt;, False)</b>;
 </li><li> <b>get ([block=True] [, timeout=None])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1091;&#1076;&#1072;&#1083;&#1103;&#1103; &#1077;&#1075;&#1086; &#1080;&#1079; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>block</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; 
&#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, - &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>timeout</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1086;&#1089;&#1100; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1074;&#1086;&#1079;&#1073;&#1091;&#1078;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <b>queue.Empty</b>. 
&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; <b>block</b> &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; <b>False</b> &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1078;&#1080;&#1076;&#1072;&#1090;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1100; &#1080;&#1079; &#1085;&#1077;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1080; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1073;&#1091;&#1076;&#1080;&#1090; 
&#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; <b>queue.Empty</b> &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086;;
 </li><li> <b>get_nowait ()</b> - &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1077;&#1079; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103;. &#1069;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1091; <b>get(False)</b>;
 </li><li> <b>join()</b> - &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090; &#1087;&#1086;&#1090;&#1086;&#1082;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099; &#1074;&#1089;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>task_done()</b>. &#1050;&#1072;&#1082; 
&#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1089;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1085;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1079;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;;
 </li><li> <b>task_done ()</b> - &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103;;
 </li><li> <b>qsize()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1073;&#1083;&#1080;&#1079;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080;. &#1058;&#1072;&#1082; &#1082;&#1072;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1080;&#1084;&#1077;&#1102;&#1090; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;, &#1076;&#1086;&#1074;&#1077;&#1088;&#1103;&#1090;&#1100; &#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1085;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; - 
&#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100;&#1089;&#1103;;
 </li><li> <b>empty ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1087;&#1091;&#1089;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
 </li><li> <b>full ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_016.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_018.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>