<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_151.html]
* At UTC datetime: [2023-08-19 10:00:35.006962]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 151.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1055;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1091;&#1082;&#1072;&#1078;&#1077;&#1084; &#1077;&#1075;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. 
</p><ul>
 <li> <b>collapse (&lt;QModelIndex&gt;)</b> - &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1084;&#1080; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;, &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>collapseAll ()</b> - &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>isExpanded (&lt;QModelIndex&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1084;&#1080; &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1099;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setItemsExpandable (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1090;&#1086; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;;
<p align="JUSTIFY">
 </p></li><li> <b>setAnimated (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1089;&#1086;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089; &#1072;&#1085;&#1080;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081;;
<p align="JUSTIFY">
 </p></li><li> <b>setIndentation (&lt;<i>O&#1090;&#1089;&#1090;&#1091;&#1087;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087; &#1076;&#1083;&#1103; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>setRootIsDecorated (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1076;&#1083;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080; &#1089;&#1086;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>setFirstColumnSpanned (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;</i>&gt;, &lt;QModelIndex&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1090;&#1100;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1080; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; (&#1082;&#1072;&#1082; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>), &#1079;&#1072;&#1081;&#1084;&#1077;&#1090; &#1074;&#1089;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setExpandsOnDoubleClick (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1089;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1088;&#1072;&#1079;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1084;&#1091; &#1097;&#1077;&#1083;&#1095;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setsortingEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;  &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1085;&#1072;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>sortByColumn (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;</i>&gt;[, AscendingOrder])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>AscendingOrder</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, &#1090;&#1086; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>DescendingOrder</b> - &#1090;&#1086; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setWordWrap (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1077;&#1082;&#1089;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1080;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QTreeView</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>expanded (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;;
 </li><li> <b>collapsed (&lt;QModelIndex&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;&#1084;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082; &#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_150.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif">
<a href="https://it.kgsu.ru/Python_Qt/oglav8.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_152.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>