<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_040.html]
* At UTC datetime: [2023-08-19 09:55:46.296355]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 40.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1084;&#1077;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1074; &#1083;&#1077;&#1074;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1091;&#1075;&#1083;&#1091; &#1086;&#1082;&#1085;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;. &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setWindowIcon()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076; 
&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QIcon</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1091; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100;, &#1090;&#1086; &#1087;&#1086;&#1080;&#1089;&#1082; &#1092;&#1072;&#1081;&#1083;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1088;&#1072;&#1073;&#1086;&#1095;&#1077;&#1075;&#1086; 
&#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1072;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>supportedImageFormats()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImageReader</b>, &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtGui</b>. 
&#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QByteArray</b>. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1086;&#1074;:
</p><div class="fon"><pre>
&gt;&gt;&gt; <span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtGui
&gt;&gt;&gt; <span class="sl_sl">for</span> i <span class="sl_sl">in</span> QtGui.QImageReader.supportedImageFormats(): 
            <span class="tp">print</span>(<span class="tp">str</span>(i,<span class="pech">"ascii"</span>).upper(), end=<span class="pech">" "</span>)

<span class="vyvod">BMP CUR DDS GIF ICNS ICO JP2 JPEG JPG MNG PBM PGM PNG 
PPM SVG SVGZ TGA TIF TIFF WEBP XBM XPM </span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1076;&#1083;&#1103; &#1086;&#1082;&#1085;&#1072; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setWindowIcon()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QApplication</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076; &#1090;&#1072;&#1082;&#1078;&#1077; 
&#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QIcon</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1084;&#1077;&#1089;&#1090;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074;. &#1047;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1081; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1082;&#1086;&#1076;:
</p><div class="fon"><pre>
ico = window.style().standardIcon(QtWidgets.QStyle.SP_MessageBoxCritical) 
window.setWindowIcon(ico)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1082;&#1086;&#1074; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1082; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QStyle</b> (&#1089;&#1084;. <a href="https://doc.qt.io/qt-5/qstyle.html#StandardPixmap-enum" target="_blank"><b>https://doc.qt.io/qt-5/qstyle.html#StandardPixmap-enum</b></a>).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 16 &#1085;&#1072; 16 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>ICO</b> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1077;&#1075;&#1086; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077; &#1089; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1086;&#1081;, &#1087;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1101;&#1090;&#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1076;&#1083;&#1103; &#1086;&#1082;&#1085;&#1072; &#1080; &#1074;&#1089;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;.
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:  utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtGui, QtWidgets
<span class="sl_sl">import</span> sys
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"&#1057;&#1084;&#1077;&#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1072; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072;"</span>)
window.resize(300, 100)
ico = QtGui.QIcon(<span class="pech">"icon.ico"</span>)
window.setWindowIcon(ico) <span class="comm"># &#1047;&#1085;&#1072;&#1095;&#1086;&#1082; &#1076;&#1083;&#1103; &#1086;&#1082;&#1085;&#1072;</span>
app.setWindowIcon(ico)    <span class="comm"># &#1047;&#1085;&#1072;&#1095;&#1086;&#1082; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</span>
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr40_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris40_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_039.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_041.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>