<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_019.html]
* At UTC datetime: [2023-08-19 09:54:49.381606]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 19.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1083;&#1072;&#1089;&#1089; QMutex
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1082; &#1074;&#1099; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077;, &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1085;&#1086;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1074;&#1077;&#1089;&#1090;&#1080; &#1082; &#1085;&#1077;&#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1091;&#1077;&#1084;&#1086;&#1084;&#1091; &#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1080;&#1083;&#1080; &#1076;&#1072;&#1078;&#1077; &#1072;&#1074;&#1072;&#1088;&#1080;&#1081;&#1085;&#1086;&#1084;&#1091; &#1077;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1102;. 
&#1058;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; &#1074; &#1086;&#1076;&#1080;&#1085; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1080;&#1084;&#1077;&#1090;&#1100; &#1083;&#1080;&#1096;&#1100; &#1086;&#1076;&#1080;&#1085; &#1087;&#1086;&#1090;&#1086;&#1082;. &#1057;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084; 
&#1080; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1077; &#1077;&#1075;&#1086; &#1088;&#1072;&#1079;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072; &#1074; <b>PyQt</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <b>QMutex</b> &#1080; <b>QMutexLocker</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutex</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; <b><i>&#1084;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089;</i></b> &#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QMutex([mode=QtCore.QMutex.NonRecursive])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>mode</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; <b>NonRecursive</b> (&#1087;&#1086;&#1090;&#1086;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1077;&#1076;&#1080;&#1085;&#1086;&#1078;&#1076;&#1099;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1085;&#1103;&#1090;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1096;&#1077;&#1085;&#1072; 
&#1089;&#1085;&#1086;&#1074;&#1072;, - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;) &#1080; <b>Recursive</b> (&#1087;&#1086;&#1090;&#1086;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1080;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;, &#1080; &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1089;&#1085;&#1103;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>unlock()</b> &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1088;&#1072;&#1079;).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMutex</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>lock ()</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1073;&#1099;&#1083; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1076;&#1086; &#1089;&#1085;&#1103;&#1090;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;;
 </li><li> <b>tryLock ([timeout=0])</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>. &#1045;&#1089;&#1083;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084;, 
&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> &#1073;&#1077;&#1079; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; 
<b>timeout</b>. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <b>tryLock()</b> &#1074;&#1077;&#1076;&#1077;&#1090; &#1089;&#1077;&#1073;&#1103; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <b>lock()</b>;
 </li><li> <b>unlock ()</b> - &#1089;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;;
 </li><li> <b>isRecursive ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;   <b>True</b>,   &#1077;&#1089;&#1083;&#1080;   &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1091;   &#1073;&#1099;&#1083;&#1086;   &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086;   &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>Recursive</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutex</b> &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;.
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:   utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets

<span class="sl_sl">class</span> <span class="vyvod">MyThread</span>(QtCore.QThread):
    x = 10	<span class="comm"># &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
    mutex = QtCore.QMutex ()	<span class="comm"># &#1052;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089;</span>
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, <span class="tp">id</span>, parent=<span class="sl_sl">None</span>):
        QtCore.QThread.__init__(self, parent)
        self.id = <span class="tp">id</span>
    <span class="sl_sl">def</span> <span class="vyvod">run</span>(self):
        self.change_x()
    <span class="sl_sl">def</span> <span class="vyvod">change_x</span>(self):
        MyThread.mutex.lock()	<span class="comm"># &#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1084;</span>
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        MyThread.x += 5
        self.sleep(2)
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        MyThread.x += 34
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        MyThread.mutex.unlock() <span class="comm"># &#1057;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;</span>

<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QPushButton):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span> (self):
        QtWidgets.QPushButton.__init__ (self)
        self.setText("&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;")
        self.thread1 = MyThread(1)
        self.thread2 = MyThread(2)
        self.clicked.connect(self.on_start)
    <span class="sl_sl">def</span> <span class="vyvod">on_start</span> (self):
        <span class="sl_sl">if</span> <span class="sl_sl">not</span> self.thread1.isRunning():
            self.thread1.start()
        <span class="sl_sl">if</span> <span class="sl_sl">not</span> self.thread2.isRunning():
            self.thread2.start()
 
<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.setWindowTitle(<span class="pech">"&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; QMutex"</span>)
    window.resize(300, 30)
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr19_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>&#1093;</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1074;&#1089;&#1077;&#1084; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1087;&#1086;&#1074;&#1083;&#1077;&#1095;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; 
&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, &#1090;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1077;&#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;. &#1057;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; 
&#1087;&#1086;&#1089;&#1083;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutex</b> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1077; <b>mutex</b>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; 
&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1072; &#1085;&#1077; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1083;&#1072;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1079;&#1072;&#1097;&#1080;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1080; &#1084;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1083;&#1080;&#1089;&#1100; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;. 
&#1044;&#1072;&#1083;&#1077;&#1077; &#1074;&#1077;&#1089;&#1100; &#1082;&#1086;&#1076; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>change_x()</b>, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>&#1093;</b>, &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;&#1084;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>lock()</b> &#1080; <b>unlock()</b> &#1084;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089;&#1072;, - &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; 
&#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1086;&#1076;&#1085;&#1080;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084; &#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084; - &#1076;&#1088;&#1091;&#1075;&#1080;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b> &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1076;&#1074;&#1091;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;. &#1055;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b><i>&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100;</i></b> 
&#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; <b>on_start()</b>, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1089;&#1088;&#1072;&#1079;&#1091; &#1076;&#1074;&#1091;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;, - &#1087;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1080;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1085;&#1077; &#1073;&#1099;&#1083;&#1080; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1099; &#1088;&#1072;&#1085;&#1077;&#1077;. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1084; &#1074; &#1086;&#1082;&#1085;&#1077; 
&#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1):
</p><p align="CENTER"><img src="images/ris19_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1080;&#1076;&#1077;&#1090;&#1100;, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1083; &#1087;&#1086;&#1090;&#1086;&#1082; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; 1, a &#1083;&#1080;&#1096;&#1100; &#1079;&#1072;&#1090;&#1077;&#1084; - &#1087;&#1086;&#1090;&#1086;&#1082; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; 2. &#1045;&#1089;&#1083;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1090;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1085;&#1099;&#1084;:
</p><div class="fon"><pre>
<span class="vyvod">x = 10   id = 1
x = 10   id = 2
x = 20   id = 1
x = 20   id = 2
x = 54   id = 1
x = 88   id = 2
x = 132   id = 1
x = 166   id = 2</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; 2 &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>&#1093;</b> &#1076;&#1086; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>changes()</b> &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1089; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1084; 1.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_018.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav1.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a>  <img src="../images/redball.gif"> 
<a href="pyqt5_020.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>