<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_023.html]
* At UTC datetime: [2023-08-19 09:55:01.160064]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 23.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086; &#1080; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080;&#1084; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b>. &#1054;&#1085; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <b>QObject</b> &#1080; <b>QPaintDevice</b> &#1080;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1102;&#1073;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1081; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;. &#1053;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1101;&#1090;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b> &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1082; &#1086;&#1082;&#1085;&#1091; 
&#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1086;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1090;&#1077; &#1078;&#1077; &#1089;&#1072;&#1084;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1080; &#1082; &#1083;&#1102;&#1073;&#1099;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;. &#1058;&#1072;&#1082;, &#1084;&#1077;&#1090;&#1086;&#1076;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1086;&#1082;&#1085;&#1072;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1083;&#1103; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1077;&#1075;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;. &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1086;&#1082;&#1086;&#1085; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1077;&#1090;&#1086;&#1076;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; 
&#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072;, &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1093;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>, &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1077;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QFrame</b> (&#1086;&#1082;&#1085;&#1086; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081;) &#1080;&#1083;&#1080; 
<b>QDialog</b> (&#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;). &#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b> &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; &#1080;&#1083;&#1080; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1080; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;: 
<b><i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QMainWindow</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1084;&#1077;&#1085;&#1102;, &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; 
&#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QDialog</b> &#1080; <b>QMainWindow</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1080; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_022.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_024.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>