<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_252.html]
* At UTC datetime: [2023-08-19 10:04:49.127148]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 252.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1044;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QInputDialog. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QInputDialog</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082; &#1085;&#1080;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qinputdialog.html" target="_blank"><b>https://doc.qt.io/qt-5/qinputdialog.html</b></a>):
</p><ul>
 <li> <b>setLabelText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084;&#1099;&#1081; &#1085;&#1072;&#1076; &#1087;&#1086;&#1083;&#1077;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setOkButtonText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1083;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b>:
  <div class="fon"><pre>
dialog,setOkButtonText(<span class="pech">"&amp;&#1042;&#1074;&#1086;&#1076;"</span>)
</pre></div>
 </li><li> <b>setCancelButtonText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1076;&#1083;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>Cancel</b>:
<div class="fon"><pre>
  dialog.setCancelButtonText(<span class="pech">"&amp;&#1054;&#1090;&#1084;&#1077;&#1085;&#1072;"</span>)
</pre></div>
 </li><li> setInputMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;) - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QInputDialog</b>:
<ul>
 <li> <b>TextInput (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1074;&#1074;&#1086;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;;
 </li><li> <b>IntInput (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1074;&#1074;&#1086;&#1076; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
 </li><li> <b>DoubleInput (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1074;&#1074;&#1086;&#1076; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setTextEchoMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1087;&#1086;&#1083;&#1077;. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLineEdit</b>:
<ul>
 <li> <b>Normal (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099;;
 </li><li> <b>NoEcho (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;;
 </li><li> <b>Password (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1082;&#1072; (*);
 </li><li> <b>PasswordEchoOnEdit (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1087;&#1088;&#1080; &#1074;&#1074;&#1086;&#1076;&#1077;, &#1072; &#1087;&#1088;&#1080; &#1087;&#1086;&#1090;&#1077;&#1088;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1080;&#1093; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1082;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setTextValue (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>textValue ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setIntValue (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>intValue ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1087;&#1086;&#1083;&#1077;, &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setIntRange (&lt;<i>&#1052;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;</i>&gt;, &lt;<i>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b>, <b>setIntMinimum (&lt;<i>&#1052;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b>  &#1080; <b>setIntMaximum (&lt;<i>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setIntStep (&lt;<i>&#1064;&#1072;&#1075;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1072;&#1075; &#1087;&#1088;&#1080;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1089;&#1086; &#1089;&#1090;&#1088;&#1077;&#1083;&#1082;&#1072;&#1084;&#1080; &#1074; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1087;&#1086;&#1083;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDoubleValue (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>doubleValue ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1074; &#1087;&#1086;&#1083;&#1077;, &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDoubleRange (&lt;<i>&#1052;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;</i>&gt;, &lt;<i>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b>,  <b>setDoubleMinimum (&lt;<i>&#1052;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b>  &#1080; 
<b>setDoubleMaximum (&lt;<i>&#1052;&#1072;&#1082;&#1089;&#1080;&#1084;&#1091;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1093; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDoubleDecimals (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1094;&#1080;&#1092;&#1088; &#1087;&#1086;&#1089;&#1083;&#1077; &#1076;&#1077;&#1089;&#1103;&#1090;&#1080;&#1095;&#1085;&#1086;&#1081; &#1090;&#1086;&#1095;&#1082;&#1080; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setComboBoxItems (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1085;&#1082;&#1090;&#1099;,  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090;  &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1074; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1084;&#1089;&#1103; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072;. 
&#1053;&#1072;&#1073;&#1086;&#1088; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>setComboBoxEditable (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1082;&#1072;&#1082; &#1077;&#1089;&#1083;&#1080; &#1073;&#1099; &#1086;&#1085; &#1073;&#1099;&#1083; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1084; &#1087;&#1086;&#1083;&#1077;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setOption (&lt;<i>&#1054;&#1087;&#1094;&#1080;&#1103;</i>&gt;[, on=True])</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1086;&#1087;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1089;&#1073;&#1088;&#1086;&#1096;&#1077;&#1085;&#1072;. &#1054;&#1087;&#1094;&#1080;&#1080; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QInputDialog</b>:
<ul>
 <li> <b>NoButtons (<i>&#1080;&#1083;&#1080;</i> l)</b> - &#1085;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b> &#1080; <b>Cancel</b>;
 </li><li> <b>UseListViewForComboBoxItems (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QListView</b> (&#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;), &#1072; &#1085;&#1077; <b>QComboBox</b> (&#1088;&#1072;&#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;);
 </li><li> <b>UsePlainTextEditForTextInput (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLineEdit</b> (&#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;) &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPlainTextEdit</b> (&#1084;&#1085;&#1086;&#1075;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;);
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setOptions (&lt;<i>&#1054;&#1087;&#1094;&#1080;&#1080;</i>&gt;)</b> -   &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1087;&#1094;&#1080;&#1081; (&#1089;&#1084;. &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setOption()</b>) &#1089;&#1088;&#1072;&#1079;&#1091;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QInputDialog</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>textValueChanged (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TextInput</b>;
 </li><li> <b>textValueSelected (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TextInput</b>;
 </li><li> <b>intValueChanged (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1086;&#1083;&#1077;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
 </li><li> <b>intValueSelected (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>IntInput</b>;
 </li><li> <b>doubleValueChanged (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1086;&#1083;&#1077;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>;
 </li><li> <b>doubleValueSelected (&lt;&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b>&#1054;&#1050;</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>DoubleInput</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1086;&#1082;&#1085;&#1086; &#1076;&#1083;&#1103; &#1074;&#1074;&#1086;&#1076;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_251.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_253.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>