<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_311.html]
* At UTC datetime: [2023-08-19 10:07:26.792340]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 311.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;&#1102;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1081; &#1086; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;. &#1050;&#1083;&#1072;&#1089;&#1089; QPrinterInfo
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1095;&#1077;&#1085;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPrinterInfo</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1082;&#1072;&#1082; &#1086;&#1073;&#1086; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;&#1093;, &#1090;&#1072;&#1082; &#1080; &#1086; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072;&#1084;&#1080;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPrinterInfo(&lt;QPrinter&gt;) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPrinterInfo(&lt;QPrinterInfo&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1087;&#1080;&#1102; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QPrinterInfo</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>availablePrinters ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1074;, 
&#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinterInfo</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>availablePrinterNames ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1084;&#1077;&#1085; &#1074;&#1089;&#1077;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1074;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  l = QtPrintSupport.QPrinterInfo.availablePrinterNames()
  <span class="sl_sl">for</span> p <span class="sl_sl">in</span> l: <span class="tp">print</span>(p)
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;:</span>
  <span class="comm"># Microsoft XPS Document Writer</span>
  <span class="comm"># Fax</span>
  <span class="comm"># Samsung ML-191x252x Series</span>
</pre></div>
 </li><li> <b>defaultPrinter ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinterInfo</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>defaultPrinterName ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  <span class="tp">print</span>(QtPrintSupport.QPrinterInfo.defaultPrinterName())
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: Samsung ML-191x252x Series</span>
</pre></div>
 </li><li> <b>printerInfo (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinterInfo</b>, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1085;&#1077;&#1090;, 
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1082;&#1086;&#1088;&#1088;&#1077;&#1082;&#1090;&#1085;&#1099;&#1081;, "&#1087;&#1091;&#1089;&#1090;&#1086;&#1081;" &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  &#1088; = QtPrintSupport.QPrinterInfo.printerInfo(<span class="pech">"Samsung ML-191x252x Series"</span>)
</pre></div>
 </li><li> <b>isNull ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1099;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; "&#1087;&#1091;&#1089;&#1090;&#1099;&#1084;";
<p align="JUSTIFY">
 </p></li><li> <b>printerName ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>makeAndModel ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1086;&#1077; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1077;&#1075;&#1086; &#1080;&#1079;&#1075;&#1086;&#1090;&#1086;&#1074;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1102;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080;, &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>description ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080;, &#1080;&#1083;&#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1080;&#1084;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>location ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090;&#1089;&#1103; &#1074; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080;, &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isDefault ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085; &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isRemote ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1081; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081;;
<p align="JUSTIFY">
 </p></li><li> <b>state ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>:
<ul>
 <li> <b>Idle (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1088;&#1086;&#1089;&#1090;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;;
 </li><li> <b>Active (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1076;&#1077;&#1090; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;;
 </li><li> <b>Aborted (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1073;&#1099;&#1083;&#1072; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1085;&#1072;;
 </li><li> <b>Error (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1072; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>supportedPageSizes ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>;
<p align="JUSTIFY">
 </p></li><li> <b>supportsCustomPageSizes ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>supportedResolutions ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1080; &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>supportedDuplexModes ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084;&#1086;&#1074; &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;. &#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setDuplex()</b>  (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_299.html" target="_blank">299 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>defaultPageSize ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>:
<div class="fon"><pre>
  ps = p.defaultPageSize()
  <span class="tp">print</span>(ps.name())
  s = ps.size(QtGui.QPageSize.Millimeter)
  <span class="tp">print</span>(s.width() ,<span class="pech">"x"</span>, s.height())
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;:</span>
  <span class="comm"># &#1040;4</span>
  <span class="comm"># 210.0 &#1093; 297.0</span>
</pre></div>
 </li><li> <b>defaultDuplexMode ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>minimumPhysicalPageSize ()</b> &#1080; <b>maximumPhysicalPageSize ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QPdfWriter</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_310.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav17.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_312.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>