<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_104.html]
* At UTC datetime: [2023-08-19 09:58:35.872368]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 104.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1054;&#1076;&#1085;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1090;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QLineEdit</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1072; &#1087;&#1086;&#1083;&#1085;&#1099;&#1084; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qlineedit.html" target="_blank"><b>https://doc.qt.io/qt-5/qlineedit.html</b></a>):
</p><ul>
 <li> <b>setText (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>insert (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1086;&#1083;&#1077; 
&#1073;&#1099;&#1083; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;;
<p align="JUSTIFY">
 </p></li><li> <b>text ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1084; &#1087;&#1086;&#1083;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>displayText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1080;&#1076;&#1080;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; 
&#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setEchoMode()</b>, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077; <b>Password</b> &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1100; &#1080;&#1079; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1077;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1080;&#1079; &#1087;&#1086;&#1083;&#1103;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>backspace ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077;&#1090;, &#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>del ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077;&#1090;, &#1090;&#1086; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; 
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1089;&#1090;&#1086;&#1103;&#1097;&#1080;&#1081; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setSelection (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1044;&#1083;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1076;&#1083;&#1080;&#1085;&#1086;&#1081; <b>&lt;<i>&#1044;&#1083;&#1080;&#1085;&#1072;</i>&gt;</b>, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; 
&#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; <b>&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;</b>. &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>selectedText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>selectAll ()</b> - &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1074;&#1077;&#1089;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>selectionStart ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1072; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; -1, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>hasSelectedText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>deselect ()</b> - &#1089;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isModified ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077; &#1073;&#1099;&#1083; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1047;&#1072;&#1084;&#1077;&#1090;&#1100;&#1090;&#1077;, 
&#1095;&#1090;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setText ()</b> &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090; &#1087;&#1086;&#1083;&#1077; &#1082;&#1072;&#1082; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1086;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setModified (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1086;&#1083;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1082;&#1072;&#1082; &#1085;&#1077;&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1086;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setEchoMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLineEdit</b>:
<ul>
 <li> <b>Normal (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1082;&#1072;&#1082; &#1086;&#1085;&#1080; &#1073;&#1099;&#1083;&#1080; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099;;
 </li><li> <b>NoEcho (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1074;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099;;
 </li><li> <b>Password (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1082;&#1080; (*);
 </li><li> <b>PasswordEchoOnEdit (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1087;&#1088;&#1080; &#1074;&#1074;&#1086;&#1076;&#1077;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1080;&#1093; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100; &#1079;&#1074;&#1077;&#1079;&#1076;&#1086;&#1095;&#1082;&#1080; (*);
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setCompleter(&lt;QCompleter&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1077; &#1074;&#1072;&#1088;&#1080;&#1072;&#1085;&#1090;&#1099; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, 
&#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1089; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QCompleter</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  lineEdit = QtWidgets.QLineEdit() 
  arr = [<span class="pech">"&#1082;&#1072;&#1076;&#1088;"</span>, <span class="pech">"&#1082;&#1072;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081;"</span>, <span class="pech">"&#1082;&#1072;&#1084;&#1077;&#1085;&#1100;"</span>, <span class="pech">"&#1082;&#1072;&#1084;&#1077;&#1088;&#1072;"</span>] 
  completer = QtWidgets.QCompleter(arr, parent=window) 
  lineEdit.setCompleter(completer)
</pre></div>
 </li><li> <b>setReadOnly (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1086;&#1083;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>isReadOnly ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setAlignment (&lt;<i>&#1042;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1086;&#1083;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>setMaxLength (&lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>setFrame (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1090;&#1086; &#1087;&#1086;&#1083;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1073;&#1077;&#1079; &#1088;&#1072;&#1084;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setDragEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084; 
&#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1079; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_103.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav5.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_105.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>