<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_014.html]
* At UTC datetime: [2023-08-19 09:54:35.605887]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 14.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1083;&#1072;&#1089;&#1089; QThread: &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QThread</b> &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets

<span class="sl_sl">class</span> MyThread(QtCore.QThread):
    mysignal = QtCore.pyqtSignal(<span class="tp">str</span>)
    <span class="sl_sl">def</span>  <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtCore.QThread.__init__(self, parent)
    <span class="sl_sl">def</span> <span class="vyvod">run</span>(self):
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(1, 21):
            self.sleep(3)	<span class="comm"># "&#1047;&#1072;&#1089;&#1099;&#1087;&#1072;&#1077;&#1084;" &#1085;&#1072; 3 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;</span>
            <span class="comm"># &#1055;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;</span>
            self.mysignal.emit(<span class="pech">"i = %s"</span> % i)

<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent)
        self.label = QtWidgets.QLabel(<span class="pech">"&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;"</span>)
        self.label.setAlignment(QtCore.Qt.AlignHCenter)
        self.button = QtWidgets.QPushButton(<span class="pech">"&#1047;&#1072;&#1087;&#1091;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;"</span>)
        self.vbox = QtWidgets.QVBoxLayout()
        self.vbox.addWidget(self.label)
        self.vbox.addWidget(self.button)
        self.setLayout(self.vbox)
        self.mythread = MyThread()    <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
        self.button.clicked.connect(self.on_clicked)
        self.mythread.started.connect(self.on_started)
        self.mythread.finished.connect(self.on_finished)
        self.mythread.mysignal.connect(self.on_change, QtCore.Qt.QueuedConnection)
    <span class="sl_sl">def</span> <span class="vyvod">on_clicked</span>(self):
        self.button.setDisabled(<span class="sl_sl">True</span>) <span class="comm"># &#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;</span>
        self.mythread.start()         <span class="comm"># &#1047;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;</span>
    <span class="sl_sl">def</span> <span class="vyvod">on_started</span>(self):	<span class="comm"># &#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;</span>
        self.label.setText(<span class="pech">"&#1042;&#1099;&#1079;&#1074;&#1072;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; on_started ()"</span>)
    <span class="sl_sl">def</span> <span class="vyvod">on_finished</span>(self):      <span class="comm"># &#1042;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;</span>
        self.label.setText(<span class="pech">"&#1042;&#1099;&#1079;&#1074;&#1072;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; on_finished()"</span>)
        self.button.setDisabled(<span class="sl_sl">False</span>) <span class="comm"># &#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;</span>
    <span class="sl_sl">def</span> <span class="vyvod">on_change</span>(self, s):
        self.label.setText(s)
        
<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.setWindowTitle(<span class="pech">"&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; QThread"</span>)
    window.resize(300, 70)
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr14_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1076;&#1077;&#1089;&#1100; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089; <b>MyThread</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QThread</b>. &#1042; &#1085;&#1077;&#1084; &#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>mysignal</b>, &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; 
&#1078;&#1077; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1080; &#1079;&#1072;&#1085;&#1077;&#1089;&#1083;&#1080; &#1074; &#1085;&#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081; <b>pyqtSignal()</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>. &#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1080; <b>pyqtSignal()</b> &#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1090;&#1080;&#1087; <b>str</b> (&#1089;&#1090;&#1088;&#1086;&#1082;&#1072; <b>Python</b>), 
&#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; <b>PyQt</b>, &#1095;&#1090;&#1086; &#1074;&#1085;&#1086;&#1074;&#1100; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1090;&#1080;&#1087;&#1072;:
</p><div class="fon"><pre>
  mysignal = QtCore.pyqtSignal(<span class="tp">str</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1090;&#1086;&#1084; &#1078;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077; &#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1083;&#1080; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1076;&#1083;&#1103; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>run()</b> - &#1074; &#1085;&#1077;&#1084; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1084;&#1080;&#1090;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1094;&#1080;&#1082;&#1083;&#1072; <b>for</b> &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>sleep()</b>: &#1082;&#1072;&#1078;&#1076;&#1099;&#1077; &#1090;&#1088;&#1080; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; <b>mysignal</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <b>i</b> &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;:
</p><div class="fon"><pre>
  self.mysignal.emit(<span class="pech">"i = %s"</span> % i)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b> &#1084;&#1099; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1083;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  self.mythread.mysignal.connect(self.on_change,  QtCore.Qt.QueuedConnection)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1076;&#1077;&#1089;&#1100; &#1074;&#1089;&#1077; &#1085;&#1072;&#1084; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1086;: &#1091; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <b>mysignal</b> &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1076;&#1085;&#1086;&#1080;&#1084;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;, &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>connect()</b>, &#1080; &#1077;&#1084;&#1091; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;. 
&#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>connect()</b> &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>QueuedConnection</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; 
&#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;, &#1090;. &#1077;. &#1074; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082;&#1077;. &#1048;&#1079; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1089;&#1084;&#1077;&#1083;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1082;&#1086;&#1076; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; <b>mysignal</b>:
</p><div class="fon"><pre>
    <span class="sl_sl">def</span> <span class="vyvod">on_change</span>(self, s):
        self.label.setText(s)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1077;&#1084;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1101;&#1090;&#1086;&#1084;&#1091; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1091;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1074; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setText()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1097;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b> &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>MyThread</b> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1077;&#1075;&#1086; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1077; <b>mythread</b>. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1084; &#1080; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; <b>started()</b>, <b>finished()</b> &#1080; <b>mysignal</b>. 
&#1047;&#1072;&#1087;&#1091;&#1089;&#1082; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>start()</b> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;, &#1084;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setDisabled()</b> &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; 
&#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; <b>finished()</b> &#1086;&#1087;&#1103;&#1090;&#1100; &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1076;&#1083;&#1103; &#1080;&#1084;&#1080;&#1090;&#1072;&#1094;&#1080;&#1080; &#1076;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <b>sleep()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QThread</b>, &#1072; &#1085;&#1077; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1102; <b>sleep()</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>time</b>. 
&#1042;&#1086;&#1086;&#1073;&#1097;&#1077;, &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QThread</b>:
</p><ul>
 <li> <b>sleep ()</b> - &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;:
<div class="fon"><pre>
QtCore.QThread.sleep(3)	         <span class="comm">#  "&#1047;&#1072;&#1089;&#1099;&#1087;&#1072;&#1077;&#1084;"  &#1085;&#1072; 3 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;</span>
</pre></div>
 </li><li> <b>msleep ()</b> - &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;:
<div class="fon"><pre>
QtCore.QThread.msleep(3000)      <span class="comm">#  "&#1047;&#1072;&#1089;&#1099;&#1087;&#1072;&#1077;&#1084;" &#1085;&#1072; 3 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;</span>
</pre></div>
 </li><li> <b>usleep ()</b> - &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1084;&#1080;&#1082;&#1088;&#1086;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;:
<div class="fon"><pre>
QtCore.QThread.usleep(3000000)   <span class="comm">#   "&#1047;&#1072;&#1089;&#1099;&#1087;&#1072;&#1077;&#1084;" &#1085;&#1072; 3 &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1099;</span>
</pre></div>
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1097;&#1077; &#1086;&#1076;&#1080;&#1085; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1081; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QThread</b> - <b>yieldCurrentThread()</b> - &#1085;&#1077;&#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1086; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1086;&#1078;&#1080;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084;&#1091; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; 
&#1087;&#1086;&#1090;&#1086;&#1082;&#1091;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1077;&#1089;&#1090;&#1100;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  QtCore.QThread.yieldCurrentThread()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1080;&#1082;&#1083;&#1086;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_013.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_015.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>