<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_301.html]
* At UTC datetime: [2023-08-19 10:07:01.284482]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 301.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;. &#1042;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099;  <b><i>&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1088;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1077; &#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1085;&#1080;&#1078;&#1077;  &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1082;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>PrintList</b>, &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1074; &#1080;&#1083;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077; &#1087;&#1086;&#1083;&#1085;&#1086;&#1094;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; 
&#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtGui, QtPrintSupport

<span class="sl_sl">class</span>  <span class="vyvod">PrintList</span>:
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self) :
        self.printer = QtPrintSupport.QPrinter()
        self.headerFont = QtGui.QFont(<span class="pech">"Arial"</span>, pointSize=10,
                    weight = QtGui.QFont.Bold)
        self.bodyFont = QtGui.QFont(<span class="pech">"Arial"</span>, pointSize=10)
        self.footerFont = QtGui.QFont(<span class="pech">"Arial"</span>, pointSize=9, italic=<span class="sl_sl">True</span>)
        self.headerFlags = QtCore.Qt.AlignHCenter | QtCore.Qt.TextWordWrap
        self.bodyFlags = QtCore.Qt.TextWordWrap
        self.footerFlags = QtCore.Qt.AlignHCenter | QtCore.Qt.TextWordWrap
        color = QtGui.QColor(QtCore.Qt.black)
        self.headerPen = QtGui.QPen(color, 2)
        self.bodyPen = QtGui.QPen(color, 1)
        self.margin = 5
        self._resetData()

    <span class="sl_sl">def</span> <span class="vyvod">_resetData</span>(self):
        self.headers = <span class="sl_sl">None</span>
        self.columnWidths = <span class="sl_sl">None</span>
        self.data = <span class="sl_sl">None</span>
        self._brush = QtCore.Qt.NoBrush
        self._currentRowHeight = 0
        self._currentPageHeight = 0
        self._headerRowHeight = 0
        self._footerRowHeight = 0
        self._currentPageNumber = 1
        self._painter = <span class="sl_sl">None</span>

    <span class="sl_sl">def</span> <span class="vyvod">printData</span>(self):
        self._painter = QtGui.QPainter()
        self._painter.begin(self.printer)
        self._painter.setBrush(self._brush)
        <span class="sl_sl">if</span> self._headerRowHeight == 0:
            self._painter.setFont(self.headerFont)
            self._headerRowHeight = 
                  self._calculateRowHeight(self.columnWidths, self.headers)
        <span class="sl_sl">if</span> self._footerRowHeight == 0:
            self._painter.setFont(self.footerFont)
            self._footerRowHeight = 
                  self._calculateRowHeight([self.printer.width()], <span class="pech">"&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;"</span>)
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(<span class="tp">len</span>(self.data)):
            height = self._calculateRowHeight(self.columnWidths, self.data[i])
            <span class="sl_sl">if</span> self._currentPageHeight + height &gt; 
                  self.printer.height() - self._footerRowHeight - 2 * self.margin:
                self._printFooterRow()
                self._currentPageHeight = 0
                self._currentPageNumber += 1
                self.printer.newPage()
            <span class="sl_sl">if</span> self._currentPageHeight == 0:
                self._painter.setPen(self.headerPen)
                self._painter.setFont(self.headerFont)
                self.printRow(self.columnWidths, self.headers,
                        self._headerRowHeight, self.headerFlags)
                self._painter.setPen(self.bodyPen)
                self._painter.setFont(self.bodyFont)
            self.printRow(self.columnWidths, self.data[i],
                          height, self.bodyFlags)
        self._printFooterRow()
        self._painter.end()
        self._resetData()

    <span class="sl_sl">def</span> <span class="vyvod">_calculateRowHeight</span>(self, widths, cellData):
        height = 0
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(<span class="tp">len</span>(widths)):
            r = self._painter.boundingRect(0, 0, widths[i] -
                    2 * self.margin, 50, QtCore.Qt.TextWordWrap,
                    <span class="tp">str</span>(cellData[i]))
            h = r.height() + 2 * self.margin
            <span class="sl_sl">if</span> height &lt; h:
                height = h
        <span class="sl_sl">return</span> height

    <span class="sl_sl">def</span> <span class="vyvod">printRow</span>(self, widths, cellData, height, flags):
        x = 0
        <span class="sl_sl">for</span> i <span class="sl_sl">in</span> <span class="tp">range</span>(<span class="tp">len</span>(widths)):
            self._painter.drawText(x + self.margin,
                self._currentPageHeight + self.margin,
                widths[i] - self.margin, height - 2 * self.margin,
                flags, <span class="tp">str</span>(cellData[i]))
            self._painter.drawRect(x, self._currentPageHeight,
                widths[i], height)
            x += widths[i]
        self._currentPageHeight += height

    <span class="sl_sl">def</span> <span class="vyvod">_printFooterRow</span>(self):
        self._painter.setFont(self.footerFont)
        self._painter.drawText(self.margin, self.printer.height() -
            self._footerRowHeight - self.margin, self.printer.width() -
            2 * self.margin, self._footerRowHeight - 2 * self.margin,
            self.footerFlags, <span class="pech">"&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; "</span> + <span class="tp">str</span>(self._currentPageNumber))
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1101;&#1090;&#1080;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; &#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;: &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;, &#1074;&#1099;&#1079;&#1074;&#1072;&#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = PrintList()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077; &#1095;&#1077;&#1075;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072;, &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1074;&#1096;&#1080;&#1089;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>PrintList</b>:
</p><ul>
 <li> <b>headers</b> - &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>columnWidths</b> - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1076;&#1083;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;, &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1099;&#1077; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;;
<p align="JUSTIFY">
 </p></li><li> <b>data</b> - &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;. &#1054;&#1085;&#1080; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1103;&#1095;&#1077;&#1081;&#1082;&#1072;&#1093;, - &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1080;&#1079; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1103;&#1074;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;&#1080; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103;:
</p><ul>
 <li> <b>printer</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; (&#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>), &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1090;&#1095;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;. &#1048;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>headerFont</b> - &#1096;&#1088;&#1080;&#1092;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; "&#1096;&#1072;&#1087;&#1082;&#1080;" &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090;&#1095;&#1077;&#1090;&#1072;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1087;&#1086;&#1083;&#1091;&#1078;&#1080;&#1088;&#1085;&#1099;&#1081; &#1096;&#1088;&#1080;&#1092;&#1090; <b>Arial</b> &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 10 &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>headerPen</b> - &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1088;&#1072;&#1084;&#1082;&#1080;, &#1088;&#1080;&#1089;&#1091;&#1077;&#1084;&#1086;&#1081; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1103;&#1095;&#1077;&#1077;&#1082; "&#1096;&#1072;&#1087;&#1082;&#1080;". &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1095;&#1077;&#1088;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1086;&#1081; 2 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>headerFlags</b> - &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1103;&#1095;&#1077;&#1077;&#1082; "&#1096;&#1072;&#1087;&#1082;&#1080;". &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>bodyFont</b> - &#1096;&#1088;&#1080;&#1092;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1096;&#1088;&#1080;&#1092;&#1090; <b>Arial</b> &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 10 &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>bodyPen</b> - &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1088;&#1072;&#1084;&#1082;&#1080;, &#1088;&#1080;&#1089;&#1091;&#1077;&#1084;&#1086;&#1081; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1103;&#1095;&#1077;&#1077;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1095;&#1077;&#1088;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1090;&#1086;&#1083;&#1097;&#1080;&#1085;&#1086;&#1081; 1 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>bodyFlags</b> - &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1103;&#1095;&#1077;&#1077;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>footerFont</b> - &#1096;&#1088;&#1080;&#1092;&#1090;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; "&#1087;&#1086;&#1076;&#1076;&#1086;&#1085;&#1072;" &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1082;&#1091;&#1088;&#1089;&#1080;&#1074;&#1085;&#1099;&#1081; &#1096;&#1088;&#1080;&#1092;&#1090; <b>Arial</b> &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1084; 9 &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074;;
<p align="JUSTIFY">
 </p></li><li> <b>footerFlags</b> - &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; "&#1087;&#1086;&#1076;&#1076;&#1086;&#1085;&#1072;". &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;;
<p align="JUSTIFY">
 </p></li><li>  <b>margin</b> - &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1072; &#1087;&#1088;&#1086;&#1089;&#1074;&#1077;&#1090;&#1072; &#1084;&#1077;&#1078;&#1076;&#1091; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1103;&#1095;&#1077;&#1081;&#1082;&#1080; &#1080; &#1077;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1099;&#1084;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; - 5 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>printData()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>PrintList</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1089;&#1090;&#1074;&#1080;&#1080;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;&#1089;&#1100; &#1090;&#1077;&#1084; &#1078;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1101;&#1090;&#1086;&#1075;&#1086; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1088;&#1072;&#1089;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1082;&#1086;&#1076; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1077;&#1075;&#1086; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 1 &#1076;&#1086; 100, &#1080;&#1093; &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1099; &#1080; &#1082;&#1091;&#1073;&#1099;. &#1055;&#1086;&#1076;&#1088;&#1072;&#1079;&#1091;&#1084;&#1077;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1076; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072;, 
&#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; <b>PrintList.&#1088;&#1091;</b>.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets
<span class="sl_sl">import</span> sys
<span class="sl_sl">import</span> PrintList

app = QtWidgets.QApplication(sys.argv)
pl = PrintList.PrintList()
<span class="comm"># &#1045;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1074; &#1092;&#1072;&#1081;&#1083; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; PDF,</span>
<span class="comm"># &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1088;&#1072;&#1089;&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;:</span>
<span class="comm"># pl.printer.setOutputFileName("output.pdf")</span>
data = []
<span class="sl_sl">for</span> b <span class="sl_sl">in</span> <span class="tp">range</span>(1, 101):
    data.append([b, b ** 2, b ** 3])
pl.data = data
pl.columnWidths = [100, 100, 200]
pl.headers =  [<span class="pech">"&#1040;&#1088;&#1075;&#1091;&#1084;&#1077;&#1085;&#1090;"</span>, <span class="pech">"&#1050;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;"</span>, <span class="pech">"&#1050;&#1091;&#1073;"</span>]
pl.printData()
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr301_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1080;&#1079; &#1090;&#1088;&#1077;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1089; &#1090;&#1088;&#1077;&#1084;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;&#1084;&#1080; &#1080; &#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074; "&#1087;&#1086;&#1076;&#1076;&#1086;&#1085;&#1077;".
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; <b>pdf</b>-&#1092;&#1072;&#1081;&#1083;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris301_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1060;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1074; <b>pdf</b>-&#1092;&#1072;&#1081;&#1083;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_300.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_302.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>