<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_273.html]
* At UTC datetime: [2023-08-19 10:05:46.261011]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 273.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; SDI- &#1080; MDI-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1052;&#1077;&#1085;&#1102;. &#1050;&#1083;&#1072;&#1089;&#1089; QMenuBar
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMenuBar</b> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1077;&#1085;&#1102;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1077;&#1085;&#1102; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1072; &#1074; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; 
<b>menuBar()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMainWindow</b>. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1077;&#1085;&#1102; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setMenuBar(&lt;QMenuBar&gt;)</b>. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMenuBar</b> &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice)  - QWidget - QMenuBar 
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMenuBar</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QMenuBar([parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; parent &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMenuBar</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1089; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qmenubar.html" target="_blank"><b>https://doc.qt.io/qt-5/qmenubar.html</b></a>):
</p><ul>
 <li> <b>addMenu (&lt;QMenu&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1084;&#1077;&#1085;&#1102; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setVisible()</b>) &#1080;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setEnabled()</b>);
<p align="JUSTIFY">
 </p></li><li> <b>addMenu ([&lt;QIcon&gt;, ]&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMenu</b>). &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;</b> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; 
&#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1081;, &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1073;&#1091;&#1076;&#1077;&#1090;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;. &#1055;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Alt</b> &#1080; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1084;&#1077;&#1085;&#1102; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; 
&#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1072;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1077;&#1075;&#1086; &#1091;&#1076;&#1074;&#1086;&#1080;&#1090;&#1100;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085; &#1083;&#1077;&#1074;&#1077;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>insertMenu (&lt;QAction&gt;, &lt;QMenu&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102; <b>&lt;QMenu&gt;</b> &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1084; <b>&lt;QAction&gt;</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addAction ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074; &#1084;&#1077;&#1085;&#1102;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addAction(&lt;QAction&gt;)
  addAction(&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)                -&gt; QAction
  addAction(&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;, &lt;<i>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;</i>&gt;)  -&gt; QAction
</pre></div>
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1074;&#1080;&#1076;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>) &#1087;&#1091;&#1085;&#1082;&#1090; &#1074; &#1084;&#1077;&#1085;&#1102;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080; &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1077;&#1075;&#1086; &#1074; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1080;&#1079; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setActiveAction (&lt;QAction&gt;)</b> - &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>activeAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDefaultUp (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1091;&#1085;&#1082;&#1090;&#1099; &#1084;&#1077;&#1085;&#1102; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1099;&#1096;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102;, &#1072; &#1085;&#1077; &#1085;&#1080;&#1078;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setVisible (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1077;&#1085;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;&#1072;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b> &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1077;&#1085;&#1102;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMenuBar</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
<p align="JUSTIFY">
 </p><li> <b>hovered (&lt;QAction&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;;
 </li><li> <b>triggered (&lt;QAction&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1084;&#1077;&#1085;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QMenu</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_272.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav15.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_274.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>