<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_142.html]
* At UTC datetime: [2023-08-19 10:00:11.009629]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 142.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089; QStandardItemModel (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItemModel</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>.
</p><ul>
 <li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1080;&#1079; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>item (&lt;<i>C&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;[, &lt;<i>&#1057;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;</i>&gt;=0])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>), &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1103;&#1095;&#1077;&#1081;&#1082;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>invisibleRootItem ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1081; &#1082;&#1086;&#1088;&#1085;&#1077;&#1074;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>itemFromIndex (&lt;QModelIndex&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091;   &#1085;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;  &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>), &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;;
<p align="JUSTIFY">
 </p></li><li> <b>index (&lt;<i>C&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;, &lt;<i>&#1057;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;</i>&gt;[, parent=QModelIndex()])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>), &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; 
&#1103;&#1095;&#1077;&#1081;&#1082;&#1077;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1076;&#1083;&#1103; &#1080;&#1089;&#1082;&#1086;&#1084;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1087;&#1086;&#1080;&#1089;&#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>indexFromItem (&lt;QStandardItem&gt;)</b> -   &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;   &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;   &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;   (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>), &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setData (&lt;QModelIndex&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;[, role=EditRole])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;  &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;  &#1076;&#1083;&#1103;   &#1088;&#1086;&#1083;&#1080; <b>role</b> &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; <b>&lt;QModelIndex&gt;</b>. 
&#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>data (&lt;QModelIndex&gt;[, role=DisplayRole])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1086;&#1090;&#1085;&#1086;&#1089;&#1103;&#1097;&#1080;&#1077;&#1089;&#1103; &#1082; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; <b>&lt;QModelIndex&gt;</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setHorizontalHeaderLabels (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>setVerticalHeaderLabels (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>setHorizontalHeaderItem (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;QStandardItem&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setVerticalHeaderItem (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;QStandardItem&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>;
<p align="JUSTIFY">
 </p></li><li> <b>horizontalHeaderItem (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>);
<p align="JUSTIFY">
 </p></li><li> <b>verticalHeaderItem (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setHeaderData (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;[, role=EditRole])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1083;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; - &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; (&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>Horizontal</b> &#1080;&#1083;&#1080; <b>Vertical</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>). &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>headerData (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;[, role=DisplayRole])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; 
&#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1083;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; - &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>findItems (&lt;<i>Te&#1082;&#1089;&#1090;</i>&gt;[, flags=MatchExactly][, column=0])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1087;&#1086;&#1080;&#1089;&#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>column</b> &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1077; &#1087;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;. 
&#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>flags</b> &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_134.html" target="_blank">134 &#1096;&#1072;&#1075;&#1077;</a>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b> &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>sort (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;</i>&gt;[, order=AscendingOrder])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;.  &#1045;&#1089;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>AscendingOrder</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, 
&#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>DescendingOrder</b> - &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setSortRole (&lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1086;&#1083;&#1100; (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_137.html" target="_blank">137 &#1096;&#1072;&#1075;</a>), &#1087;&#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>parent (&lt;QModelIndex&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086;   &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;.    &#1042;   &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;   &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;   &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;   &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;   (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;   
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;-&#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>hasChildren ([parent=QModelIndex()])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1080;&#1084;&#1077;&#1077;&#1090; &#1093;&#1086;&#1090;&#1103; &#1073;&#1099; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>itemChanged(&lt;QStandardItem&gt;)</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStandardItem</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QStandardItem</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_141.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav7.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_143.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>