<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_242.html]
* At UTC datetime: [2023-08-19 10:04:22.786708]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 242.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1044;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QDialogButtonBox
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1092;&#1086;&#1088;&#1084;&#1099; &#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;, &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialogButtonBox</b> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;: &#1082;&#1072;&#1082; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1077;. &#1042;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072; &#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1074; 
&#1085;&#1077;&#1084; &#1079;&#1072;&#1074;&#1080;&#1089;&#1103;&#1090; &#1086;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialogButtonBox</b>:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QDialogButtonBox
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialogButtonBox</b>:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDialogButtonBox([parent=<span class="sl_sl">None</span>]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDialogButtonBox(&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;[, parent=<span class="sl_sl">None</span>]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDialogButtonBox(&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</i>&gt;[, parent=<span class="sl_sl">None</span>]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDialogButtonBox (&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</i>&gt;, &lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt; [, parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; <b>Horizontal</b> (&#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080; - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;) &#1080;&#1083;&#1080; <b>Vertical</b> (&#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; 
(&#1080;&#1083;&#1080; &#1080;&#1093; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialogButtonBox</b>:
</p><ul>
 <li> <b>NoButton</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1099;;
 </li><li> <b>Ok</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>&#1054;&#1050;</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>;
 </li><li> <b>Cancel</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Cancel</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>RejectRole</b>;
 </li><li> <b>Yes</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Yes</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>YesRole</b>;
 </li><li> <b>YesToAll</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Yes to All</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>YesRole</b>;
 </li><li> <b>No</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>No</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>NoRole</b>;
 </li><li> <b>NoToAll</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>No to All</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>NoRole</b>;
 </li><li> <b>Open</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Open</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>;
 </li><li> <b>Close</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Close</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>RejectRole</b>;
 </li><li> <b>Save</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Save</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>;
 </li><li> <b>SaveAll</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Save All</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>;
 </li><li> <b>Discard</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Discard</b> &#1080;&#1083;&#1080; <b>Don't Save</b> (&#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099;) &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>DestructiveRole</b>;
 </li><li> <b>Apply</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Apply</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>ApplyRole</b>;
 </li><li> <b>Reset</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Reset</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>ResetRole</b>;
 </li><li> <b>RestoreDefaults</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Restore Defaults</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>ResetRole</b>;
 </li><li> <b>Help</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Help</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>HelpRole</b>;
 </li><li> <b>Abort</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Abort</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>RejectRole</b>;
 </li><li> <b>Retry</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Retry</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>;
 </li><li> <b>Ignore</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Ignore</b> &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialogButtonBox</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1089; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qdialogbuttonbox.html" target="_blank"><b>https://doc.qt.io/qt-5/qdialogbuttonbox.html</b></a>):
</p><ul>
 <li> <b>setOrientation (&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; <b>Horizontal</b> (&#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;) &#1080;&#1083;&#1080; 
<b>Vertical</b> (&#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>;
 </li><li> <b>setStandardButtons (&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</i>&gt;)</b> -   &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;   &#1074;   &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;   &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  self.box.setStandardButtons(QtWidgets.QDialogButtonBox.Ok | 
      QtWidgets.QDialogButtonBox.Cancel)
</pre></div>
 </li><li> <b>addButton ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addButton(&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;</i>&gt;) 
  addButton(&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;, &lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;) 
  addButton(&lt;QAbstractButton&gt;, &lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1080;&#1083;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1089;&#1086;&#1073;&#1086;&#1081; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialogButtonBox</b> &#1080;&#1083;&#1080; &#1080;&#1093; 
&#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1072; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; - &#1077;&#1077; &#1088;&#1086;&#1083;&#1100;. &#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; 
&#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;-&#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractButton</b> - &#1082;&#1072;&#1082; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1086;, &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPushButton</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1086;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialogButtonBox</b>:
</p><ul>
 <li> <b>InvalidRole (<i>&#1080;&#1083;&#1080;</i> -1)</b> - &#1086;&#1096;&#1080;&#1073;&#1086;&#1095;&#1085;&#1072;&#1103; &#1088;&#1086;&#1083;&#1100;;
 </li><li> <b>AcceptRole (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Accepted</b>;
 </li><li> <b>RejectRole (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Rejected</b>;
 </li><li> <b>DestructiveRole (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1076;&#1083;&#1103; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072; &#1086;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;;
 </li><li> <b>ActionRole (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090; &#1082; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1085;&#1077; &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1072; &#1089; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077;&#1084; &#1086;&#1082;&#1085;&#1072;;
 </li><li> <b>HelpRole (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1076;&#1083;&#1103; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089;&#1087;&#1088;&#1072;&#1074;&#1082;&#1080;;
 </li><li> <b>YesRole (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>Yes</b>;
 </li><li> <b>NoRole (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b>No</b>;
 </li><li> <b>ResetRole (<i>&#1080;&#1083;&#1080;</i> 7)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1076;&#1083;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
 </li><li> <b>ApplyRole (<i>&#1080;&#1083;&#1080;</i> 8)</b> - &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1080;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1088;&#1086;&#1083;&#1100; &#1085;&#1077;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072;, &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  self.btnYes = QtWidget.QPushButton(<span class="pech">"&amp;&#1044;&#1072;"</span>) 
  self.box.addButton(self.btnYes, QtWidget.QDialogButtonBox.AcceptRole)
  self.btnNo = self.box.addButton(QtWidget.QDialogButtonBox.No) 
  self.btnCancel = self.box.addButton(<span class="pech">"&amp;Cancel"</span>, 
      QtWidget.QDialogButtonBox.RejectRole)
</pre></div>
 </li><li> <b>button (&lt;<i>&#1057;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102;, &#1080;&#1083;&#1080; <b>None</b>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1085;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>standardButton (&lt;QAbstractButton&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;  &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;  &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;, &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>NoButton</b>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1077; &#1085;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>buttonRole (&lt;QAbstractButton&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1086;&#1083;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1072; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>InvalidRole</b>;
<p align="JUSTIFY">
 </p></li><li> <b>buttons ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1074;&#1089;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1073;&#1099;&#1083;&#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;;
<p align="JUSTIFY">
 </p></li><li> <b>standardButtons ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1093; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;;
<p align="JUSTIFY">
 </p></li><li> <b>removeButton (&lt;QAbstractButton&gt;)</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1080;&#1079; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1085;&#1077; &#1091;&#1076;&#1072;&#1083;&#1103;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1086;&#1095;&#1080;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setCenterButtons (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDialogButtonBox</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>accepted ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>AcceptRole</b> &#1080;&#1083;&#1080; <b>YesRole</b>. &#1069;&#1090;&#1086;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1089;&#1086; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084; <b>accept ()</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  self.box.accepted.connect(self.accept)
</pre></div>
 </li><li> <b>rejected ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>RejectRole</b> &#1080;&#1083;&#1080; <b>NoRole</b>. &#1069;&#1090;&#1086;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1080;&#1090;&#1100; &#1089;&#1086; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084; <b>reject()</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  self.box.rejected.connect(self.reject)
</pre></div>
 </li><li> <b>helpRequested ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089; &#1088;&#1086;&#1083;&#1100;&#1102; <b>HelpRole</b>;
 </li><li> <b>clicked (&lt;QAbstractButton&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1083;&#1102;&#1073;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QMessageBox</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_241.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_243.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>