<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_284.html]
* At UTC datetime: [2023-08-19 10:06:16.245693]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 284.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; SDI- &#1080; MDI-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. MDI-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1083;&#1072;&#1089;&#1089; QMdiArea
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMdiArea</b> &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1086;&#1075;&#1091;&#1090; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>). &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QMdiArea</b> &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice)  - QWidget - QFrame -
             QAbstractScrollArea - QMdiArea
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiArea</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QMdiArea([parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;.
 </p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMdiArea</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qmdiarea.html" target="_blank"><b>https://doc.qt.io/qt-5/qmdiarea.html</b></a>):
</p><ul>
 <li> <b>addSubWindow (&lt;QWidget&gt;[, flags=0])</b> -  &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;  &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077;   &#1086;&#1082;&#1085;&#1086;   &#1089;   &#1092;&#1083;&#1072;&#1075;&#1072;&#1084;&#1080;   <b>flags</b> (&#1089;&#1084;&#1086;&#1090;&#1088;&#1080; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_025.html" target="_blank">25 &#1096;&#1072;&#1075;</a>), 
&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1085;&#1077;&#1075;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>). &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  w = MyWidget()
  sWindow = self.mdi_area.addSubWindow(w) 
  sWindow.setAttribute(QtCore.Qt.WA_DeleteOnClose)
  <span class="comm"># ... &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072;</span>
  sWindow.show()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1082;&#1085;&#1086; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1083;&#1086;&#1089;&#1100; &#1087;&#1088;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1080;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>WA_DeleteOnClose</b>, &#1072; &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086;, - &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>show()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>). &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  w = MyWidget()
  sWindow = QtWidgets.QMdiSubWindow()
  self.radi_area.addSubWindow(sWindow)
  sWindow.setAttribute(QtCore.Qt.WA_DeleteOnClose)
  <span class="comm"># ... &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1084; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1086;&#1082;&#1085;&#1072;</span>
  sWindow.setWidget(w)
  sWindow.show()
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1074; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  sWindow = QtWidgets.QMdiSubWindow(self.mdi_area)
</pre></div>
 </li><li> <b>activeSubWindow ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>;
<p align="JUSTIFY">
 </p></li><li> <b>currentSubWindow ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; 
&#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1084;&#1091; &#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>activeSubWindow()</b>, &#1077;&#1089;&#1083;&#1080; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>subWindowList ([order=CreationOrder])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1074;&#1089;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiSubWindow</b>), &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;. 
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>order</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiArea</b>:
<ul>
 <li> <b>CreationOrder (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1080;&#1093; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103;;
 </li><li> <b>StackingOrder (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1080;&#1093; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; - &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1077; &#1085;&#1080;&#1078;&#1085;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086;;
 </li><li> <b>ActivationHistoryOrder (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1072;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;. &#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1082;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1086;&#1082;&#1085;&#1086;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1077;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1084;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>removeSubWindow (&lt;QWidget&gt;)</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080;&#1079; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setActiveSubWindow (&lt;QMdiSubWindow&gt;)</b> - &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1074;&#1089;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1091;&#1090; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setActivationOrder (&lt;<i>&#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>activatePreviousSubWindow()</b>, <b>activateNextSubWindow()</b>  &#1080; &#1076;&#1088;. 
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1090;&#1077; &#1078;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1095;&#1090;&#1086; &#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>subWindowList()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>activationOrder ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>activatePreviousSubWindow ()</b> - &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;   &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;.   &#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082;   &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;   &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;  &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;   &#1089;   &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;   &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setActivationOrder()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>activateNextSubWindow ()</b> - &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;    &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;.    &#1055;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082;    &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080;   &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;   &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;    &#1089;   &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102;    &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setActivationOrder()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>closeActiveSubWindow ()</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>closeAllSubWindows ()</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>cascadeSubWindows ()</b> - &#1074;&#1099;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1086;&#1087;&#1082;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>tileSubWindows ()</b> - &#1074;&#1099;&#1089;&#1090;&#1088;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1086;&#1082;&#1085;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1084;&#1086;&#1079;&#1072;&#1080;&#1082;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setViewMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1082;&#1086;&#1085; &#1074; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiArea</b>:
<ul>
 <li> <b>SubWindowView (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1086;&#1082;&#1086;&#1085; (&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;);
 </li><li> <b>TabbedView (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1089; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;&#1084;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>viewMode ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1082;&#1086;&#1085; &#1074; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setTabPosition ( &lt;<i>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b>. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;. 
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>&lt;<i>&#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103;</i>&gt;</b> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTabWidget</b>:
<ul>
 <li> <b>North (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;;
 </li><li> <b>South (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1089;&#1085;&#1080;&#1079;&#1091;;
 </li><li> <b>West (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1083;&#1077;&#1074;&#1072;;
 </li><li> <b>East (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1089;&#1087;&#1088;&#1072;&#1074;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>tabPosition (&lt;<i>&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1074; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setTabShape (&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1091;&#1075;&#1083;&#1086;&#1074; &#1103;&#1088;&#1083;&#1099;&#1082;&#1086;&#1074; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b>. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTabWidget</b>:
<ul>
 <li> <b>Rounded (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1099; (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;);
 </li><li> <b>Triangular (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1090;&#1088;&#1077;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>tabShape ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1091;&#1075;&#1083;&#1086;&#1074; &#1103;&#1088;&#1083;&#1099;&#1082;&#1086;&#1074; &#1074;&#1082;&#1083;&#1072;&#1076;&#1086;&#1082; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setTabsMovable (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setTabsClosable (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TabbedView</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1090;&#1100; &#1097;&#1077;&#1083;&#1095;&#1082;&#1086;&#1084; &#1085;&#1072; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>setBackground (&lt;QBrush&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1080;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1085;&#1072; <b>MDI</b>-&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setOption (&lt;<i>&#1054;&#1087;&#1094;&#1080;&#1103;</i>&gt;[, on=True])</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1086;&#1087;&#1094;&#1080;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1089;&#1073;&#1088;&#1086;&#1096;&#1077;&#1085;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;  
<b><i>&lt;&#1054;&#1087;&#1094;&#1080;&#1103;&gt;</i></b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>DontMaximizeSubWindowOnActivation</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMdiArea</b>, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1102;&#1097;&#1080;&#1081; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1088;&#1072;&#1079;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1077; 
&#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1080; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1080;&#1079; &#1091;&#1078;&#1077; &#1088;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>testOption ((&lt;<i>&#1054;&#1087;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1086;&#1087;&#1094;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMdiArea</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>subWindowActivated(&lt;QMdiSubWindow&gt;)</b>, &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084;&#1099;&#1081; &#1087;&#1088;&#1080; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;. &#1042; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1077; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; 
&#1085;&#1072; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; <b>MDI</b>-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1042; &#1085;&#1077;&#1084; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1082;&#1085;&#1072; &#1080; &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089;&#1074;&#1086;&#1077; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QMainWindow, QApplication, QMdiArea, QAction, 
         QMdiSubWindow, QTextEdit


<span class="sl_sl">class</span> <span class="vyvod">Example</span>(QMainWindow):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        <span class="tp">super</span>().__init__(parent)
        self.mdi = QMdiArea()
        self.setCentralWidget(self.mdi)
        bar = self.menuBar()
        self.count = 0
		
        file = bar.addMenu(<span class="pech">"File"</span>)
        file.addAction(<span class="pech">"New"</span>)
        file.addAction(<span class="pech">"Cascade"</span>)
        file.addAction(<span class="pech">"Tiled"</span>)
        file.triggered[QAction].connect(self.windowaction)
        self.setWindowTitle(<span class="pech">"MDI demo"</span>)
    		
    <span class="sl_sl">def</span> <span class="vyvod">windowaction</span>(self, q):
        <span class="tp">print</span>(<span class="pech">"triggered"</span>)

        <span class="sl_sl">if</span> q.text() == <span class="pech">"New"</span>:
            self.count = self.count + 1
            sub = QMdiSubWindow()
            sub.setWidget(QTextEdit())
            sub.setWindowTitle(<span class="pech">"subwindow"</span> + <span class="tp">str</span>(self.count))
            self.mdi.addSubWindow(sub)
            sub.show()
        <span class="sl_sl">if</span> q.text() == <span class="pech">"Cascade"</span>:
            self.mdi.cascadeSubWindows()
        <span class="sl_sl">if</span> q.text() == <span class="pech">"Tiled"</span>:
            self.mdi.tileSubWindows()


<span class="sl_sl">if</span> __name__ == <span class="pech">'__main__'</span>:
    app = QApplication(sys.argv)
    ex = Example()
    ex.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr284_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris284_1.gif"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QMdiSubWindow</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_283.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav15.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_285.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>