<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_079.html]
* At UTC datetime: [2023-08-19 09:57:32.819516]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 79.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1082;&#1085;&#1072;&#1093;. &#1040;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1080;&#1079;&#1091;&#1095;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1099;, &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;&#1075;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1082;&#1085;&#1077;. &#1048;&#1090;&#1072;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, 
&#1090;&#1086; &#1086;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; (0, 0). &#1048;&#1085;&#1099;&#1084;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;&#1080;, &#1077;&#1089;&#1083;&#1080; &#1084;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1090;&#1086; &#1074;&#1089;&#1077; &#1086;&#1085;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1103;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1080; &#1090;&#1086;&#1081; &#1078;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1085;&#1072;&#1083;&#1086;&#1078;&#1080;&#1074;&#1096;&#1080;&#1089;&#1100; &#1076;&#1088;&#1091;&#1075; &#1085;&#1072; &#1076;&#1088;&#1091;&#1075;&#1072;. 
&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1077;&#1088;&#1096;&#1080;&#1085;&#1077; &#1101;&#1090;&#1086;&#1081; &#1082;&#1091;&#1095;&#1080;, &#1072; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1089;&#1090;&#1072;&#1085;&#1091;&#1090; &#1074;&#1080;&#1076;&#1085;&#1099; &#1083;&#1080;&#1096;&#1100; &#1095;&#1072;&#1089;&#1090;&#1080;&#1095;&#1085;&#1086; &#1080;&#1083;&#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1099;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1093; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1084;&#1091;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>move()</b>, &#1072; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; - &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>resize()</b>. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; 
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setGeometry()</b>. &#1042;&#1089;&#1077; &#1101;&#1090;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1085;&#1086;&#1078;&#1077;&#1089;&#1090;&#1074;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1084;&#1099; &#1091;&#1078;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1074; &#1096;&#1072;&#1075;&#1072;&#1093; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_026.html" target="_blank">26</a>, 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_027.html" target="_blank">27</a>, <a href="https://it.kgsu.ru/Python_Qt/pyqt5_028.html" target="_blank">28</a>, <a href="https://it.kgsu.ru/Python_Qt/pyqt5_027.html" target="_blank">29</a>. &#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, 
&#1090;&#1086; &#1101;&#1090;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1086;&#1082;&#1085;&#1072;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1082;&#1085;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets
<span class="sl_sl">import</span> sys
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"&#1040;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;"</span>)
window.resize(300, 120)
label = QtWidgets.QLabel(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;"</span>, window)
button = QtWidgets.QPushButton(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077;"</span>, window)
label.setGeometry(10, 10, 280, 60)
button.resize(280, 30)
button.move(10, 80)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr79_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris79_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1040;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1086;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1082;&#1080;:
</p><ul>
 <li> &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1086;&#1082;&#1085;&#1072; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1072;&#1084;&#1086;&#1089;&#1090;&#1086;&#1103;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1074;&#1089;&#1077;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1086;&#1084; &#1082;&#1086;&#1076;&#1077;;
 </li><li> &#1087;&#1088;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1093; &#1084;&#1086;&#1075;&#1091;&#1090; &#1074;&#1099;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1079;&#1072; &#1080;&#1093; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099;. &#1055;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1095;&#1090;&#1086; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1099;&#1093; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072;&#1093; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1090;&#1080;&#1083;&#1080; &#1086;&#1092;&#1086;&#1088;&#1084;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1074; &#1090;&#1086;&#1084; 
&#1095;&#1080;&#1089;&#1083;&#1077; &#1080; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072;. &#1055;&#1086;&#1076;&#1086;&#1075;&#1085;&#1072;&#1074; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1074; &#1086;&#1076;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1081;&#1090;&#1080; &#1074; &#1091;&#1078;&#1072;&#1089; &#1087;&#1088;&#1080; &#1074;&#1080;&#1076;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1086;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1075;&#1076;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1074; &#1076;&#1074;&#1072; &#1088;&#1072;&#1079;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077;. 
&#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1083;&#1091;&#1095;&#1096;&#1077; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1086;&#1090;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1076;&#1083;&#1103; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1103;&#1074;&#1085;&#1086;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1090;&#1100; 
&#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1103;&#1079;&#1099;&#1082;&#1086;&#1074; &#1080;&#1085;&#1090;&#1077;&#1088;&#1092;&#1077;&#1081;&#1089;&#1072;, &#1072; &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1076;&#1083;&#1080;&#1085;&#1072; &#1089;&#1083;&#1086;&#1074; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093; &#1086;&#1090;&#1083;&#1080;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1101;&#1090;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1086;&#1081; &#1080;&#1089;&#1082;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_078.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_080.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>