<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_085.html]
* At UTC datetime: [2023-08-19 09:57:47.788827]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 85.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1082;&#1085;&#1072;&#1093;. &#1042;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1092;&#1086;&#1088;&#1084;&#1099; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QFormLayout</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qformlayout.html" target="_blank"><b>https://doc.qt.io/qt-5/qformlayout.html</b></a>):
</p><ul>
 <li> <b>addRow ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addRow (&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;</i>&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</i>&gt;) 
  addRow (&lt;QLabe1&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</i>&gt;) 
  addRow (&lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt;)
</pre></div>
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1097;&#1077;&#1085;&#1072; &#1074; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1080;&#1083;&#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;, &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1091;&#1102; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1091;. &#1042; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; 
&#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &amp;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1084;&#1077;&#1090;&#1080;&#1090; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; (&#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;). &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QLabel</b> (&#1086;&#1085; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;) - 
&#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1074;&#1103;&#1079;&#1100; &#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084; (&#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1086;&#1084;) &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1090;&#1100; &#1074;&#1088;&#1091;&#1095;&#1085;&#1091;&#1102;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setBuddy()</b>. &#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; (&#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;) &#1079;&#1072;&#1085;&#1103;&#1090;&#1100; &#1089;&#1088;&#1072;&#1079;&#1091; &#1086;&#1073;&#1077; &#1082;&#1086;&#1083;&#1086;&#1085;&#1082;&#1080; &#1092;&#1086;&#1088;&#1084;&#1099;;
<p align="JUSTIFY">
 </p></li><li> <b>insertRow ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1086; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  insertRow (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;</i>&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</i>&gt;) 
  insertRow (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;QLabel&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</i>&gt;) 
  insertRow (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;</i>&gt; | &lt;<i>&#1050;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
 </p></li><li> <b>setFormAlignment (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1092;&#1086;&#1088;&#1084;&#1099;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_081.html" target="_blank">81 &#1096;&#1072;&#1075;&#1077;</a>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  form.setFormAlignment(QtCore.Qt.AlignRight | QtCore.Qt.AlignBottom)
</pre></div>
 </li><li> <b>setLabelAlignment (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_081.html" target="_blank">81 &#1096;&#1072;&#1075;&#1077;</a>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1086; &#1087;&#1088;&#1072;&#1074;&#1086;&#1084;&#1091; &#1082;&#1088;&#1072;&#1102;:
<div class="fon"><pre>
  form. setLabelAlignment(QtCore.Qt.AlignRight)
</pre></div>
 </li><li> <b>setRowWrapPolicy (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1077;&#1081;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFormLayout</b>:
<ul>
 <li> <b>DontWrapRows (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;;
 </li><li> <b>WrapLongRows (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1076;&#1083;&#1080;&#1085;&#1085;&#1099;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074;&#1099;&#1096;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1072; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1080;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; - &#1089;&#1083;&#1077;&#1074;&#1072; &#1086;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;;
 </li><li> <b>WrapAllRows (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1074;&#1099;&#1096;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setFieldGrowthPolicy (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFormLayout</b>:
<ul>
 <li> <b>FieldsStayAtSizeHint (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;&#1099;&#1077; (&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>sizeHint()</b>) &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;;
 </li><li> <b>ExpandingFieldsGrow (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; &#1087;&#1086;&#1083;&#1080;&#1090;&#1080;&#1082;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;  <b>QSizePolicy.Expanding</b> &#1080;&#1083;&#1080; <b>QSizePolicy.MinimumExpanding</b>, &#1079;&#1072;&#1081;&#1084;&#1091;&#1090; 
&#1074;&#1089;&#1102; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;&#1099;&#1084;;
 </li><li> <b>AllNonFixedFieidsGrow (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1074;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; (&#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;) &#1079;&#1072;&#1081;&#1084;&#1091;&#1090; &#1074;&#1089;&#1102; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li>  <b>setContentsMargins ()</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1099; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1086;&#1074; &#1086;&#1090; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094; &#1089;&#1077;&#1090;&#1082;&#1080; &#1076;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  setContentsMargins (&lt;<i>&#1057;&#1083;&#1077;&#1074;&#1072;</i>&gt;, &lt;<i>&#1057;&#1074;&#1077;&#1088;&#1093;&#1091;</i>&gt;, &lt;<i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1072;</i>&gt;, &lt;<i>&#1057;&#1085;&#1080;&#1079;&#1091;</i>&gt;) 
  setContentsMargins (&lt;QMargins&gt;) 
</pre></div>
 </li><li> <b>setSpacing (&lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080; &#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setHorizontalspacing (&lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setVerticalSpacing (&lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1089;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;&#1084;&#1080; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1079;&#1072;&#1084;&#1077;&#1085;&#1099; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;&#1080; <b>removeWidget()</b> &#1080; <b>replaceWidget()</b>, &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_081.html" target="_blank">81 &#1096;&#1072;&#1075;&#1077;</a>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;&#1099;</i> QStackedLayout <i>&#1080;</i> QStackedWidget</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_084.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_086.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>