<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_173.html]
* At UTC datetime: [2023-08-19 10:01:32.725344]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 173.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; <b>SQL</b>-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;... . &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QSqlRecord<i> &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i> QSqlTableModel</b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; <b>insertRecord()</b> &#1080; <b>setRecord()</b>, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;, &#1076;&#1083;&#1103; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;, &#1085;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1085;&#1072;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1042;&#1086;&#1090; &#1086;&#1085;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSqlRecord([&lt;QSqlRecord&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1087;&#1080;&#1103;. &#1054;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1085;&#1086;&#1074;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1076;&#1077;&#1089;&#1100; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, 
&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>record()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlDatabase</b> (&#1086;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1080;, &#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;), 
&#1072; &#1087;&#1088;&#1080; &#1087;&#1088;&#1072;&#1074;&#1082;&#1077; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>record()</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; <b>QSqlTableModel</b> &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QSqlQueryModel</b> (&#1086;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSqlRecord</b>, &#1074; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1082; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;&#1084;, &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1084; &#1085;&#1072;&#1084;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_161.html" target="_blank">161 &#1096;&#1072;&#1075;&#1077;</a>, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>value (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>value (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setValue (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setValue (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1090; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isNull (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1085;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isNull (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1085;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setNull (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1087;&#1086;&#1083;&#1103; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setNull (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1087;&#1086;&#1083;&#1103; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>clearValues ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1083;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setGenerated (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; <b>False</b>, &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1085;&#1077;&#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1080; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1086; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>setGenerated (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; <b>False</b>, &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1086;&#1084;&#1077;&#1095;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1085;&#1077;&#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1080; &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1077;&#1077;&#1089;&#1103; &#1074; &#1085;&#1077;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1086; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>isGenerated (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086; &#1082;&#1072;&#1082; &#1085;&#1077;&#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1080; <b>True</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isGenerated (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086; &#1082;&#1072;&#1082; &#1085;&#1077;&#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;, &#1080; <b>True</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1086;&#1076;&#1072;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1085;&#1086;&#1074;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;:
</p><div class="fon"><pre>
  con = QtSql.QSqlDatabase.addDatabase(<span class="pech">'QSQLITE'</span>)
  con.setDatabaseName('data.sqlite')
  con.open()
  stm = QtSql.QSqlTableModel()
  stm.setTable(<span class="pech">'good'</span>)
  stm.select()
  rec = con.record(<span class="pech">'good'</span>)
  rec.setValue(<span class="pech">'goodname'</span>, <span class="pech">'&#1050;&#1086;&#1074;&#1088;&#1080;&#1082; &#1076;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080;'</span>)
  rec.setValue(<span class="pech">'goodcount'</span>, 3)
  stm.insertRecord(-1, rec)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1082;&#1086;&#1076;&#1072;, &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1089; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; 3:
</p><div class="fon"><pre>
  rec = stm.record(3)
  rec.setValue(<span class="pech">'goodcount'</span>, 5)
  stm.setRecord(3, rec)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSqlTableModel</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>primeInsert (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;, &lt;QSqlRecord&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, 
&#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; - &#1089;&#1072;&#1084;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1086;&#1073;&#1099;&#1095;&#1085;&#1086; &#1087;&#1091;&#1089;&#1090;&#1072;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1085;&#1077;&#1089;&#1090;&#1080; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>beforeInsert (&lt;QSqlRecord&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1085;&#1086;&#1074;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>beforeUpdate (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;</i>&gt;, &lt;QSqlRecord&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080; &#1089;&#1072;&#1084;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1072;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>beforeDelete (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>dataChanged (&lt;QModelIndex&gt;, &lt;QModelIndex&gt;, &lt;<i>&#1056;&#1086;&#1083;&#1080;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084;. &#1055;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1081; &#1083;&#1077;&#1074;&#1086;&#1081; &#1080;&#1079; &#1085;&#1072;&#1073;&#1086;&#1088;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081;, 
&#1074;&#1090;&#1086;&#1088;&#1099;&#1084; - &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1085;&#1080;&#1078;&#1085;&#1077;&#1081;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1056;&#1086;&#1083;&#1080;</i>&gt;</b> &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1086;&#1083;&#1077;&#1081;, &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080;&#1089;&#1100;, - &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1079;&#1085;&#1072;&#1095;&#1080;&#1090;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1080;&#1089;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1088;&#1086;&#1083;&#1103;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1080;&#1075;&#1085;&#1072;&#1083; <b>dataChanged</b> - &#1080;&#1076;&#1077;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086; &#1076;&#1083;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>submit()</b> &#1080;&#1083;&#1080; <b>submitAll()</b> &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1073;&#1099;&#1083; &#1079;&#1072;&#1076;&#1072;&#1085; &#1088;&#1077;&#1078;&#1080;&#1084; 
&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; <b>OnManualSubmit</b>. &#1050;&#1072;&#1082; &#1084;&#1099; &#1079;&#1085;&#1072;&#1077;&#1084;, &#1101;&#1090;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1102;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1086;&#1090;&#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1073;&#1072;&#1079;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1082;&#1086;&#1076; &#1090;&#1077;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1085;&#1077; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1072;&#1074;&#1080;&#1090;&#1100;, &#1085;&#1086; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1080; &#1091;&#1076;&#1072;&#1083;&#1103;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082;. 
&#1040; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1 &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1074;&#1080;&#1076;&#1077;&#1090;&#1100; &#1089;&#1072;&#1084;&#1086; &#1101;&#1090;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtSql
<span class="sl_sl">import</span> sys

<span class="sl_sl">def</span> <span class="vyvod">addRecord</span>():
    <span class="comm"># &#1042;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090;</span>
    <span class="comm"># &#1074;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;</span>
    stm.insertRow(stm.rowCount())

<span class="sl_sl">def</span> <span class="vyvod">delRecord</span>():
    <span class="comm"># &#1059;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1080;&#1079; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span>
    stm.removeRow(tv.currentIndex().row())
    <span class="comm"># &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1077; &#1089;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;,</span>
    <span class="comm"># &#1095;&#1090;&#1086;&#1073;&#1099; &#1091;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; "&#1084;&#1091;&#1089;&#1086;&#1088;&#1085;&#1091;&#1102;" &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;</span>
    stm.select()
    
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"QSqlTableModel"</span>)
<span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
con = QtSql.QSqlDatabase.addDatabase(<span class="pech">'QSQLITE'</span>)
con.setDatabaseName(<span class="pech">'c:\\temp\\data.sqlite'</span>)
con.open()
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span>
stm = QtSql.QSqlTableModel(parent=window)
stm.setTable(<span class="pech">'good'</span>)
stm.setSort(1, QtCore.Qt.AscendingOrder)
stm.select()
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span>
stm.setHeaderData(1, QtCore.Qt.Horizontal, <span class="pech">'&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;'</span>)
stm.setHeaderData(2, QtCore.Qt.Horizontal, <span class="pech">'&#1050;&#1086;&#1083;-&#1074;&#1086;'</span>)
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1076;&#1083;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span>
vbox = QtWidgets.QVBoxLayout()
tv = QtWidgets.QTableView()
tv.setModel(stm)
<span class="comm"># &#1057;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;</span>
tv.hideColumn(0)
tv.setColumnWidth(1, 150)
tv.setColumnWidth(2, 60)
vbox.addWidget(tv)
btnAdd = QtWidgets.QPushButton(<span class="pech">"&amp;&#1044;&#1086;&#1073;&#1072;&#1074;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
btnAdd.clicked.connect(addRecord)
vbox.addWidget(btnAdd)
btnDel = QtWidgets.QPushButton(<span class="pech">"&amp;&#1059;&#1076;&#1072;&#1083;&#1080;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
btnDel.clicked.connect(delRecord)
vbox.addWidget(btnDel)
window.setLayout(vbox)
window.resize(300, 250)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1080; &#1080;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1081; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr173_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="CENTER"><img src="images/ris173_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1089;&#1082;&#1083;&#1072;&#1076;&#1089;&#1082;&#1086;&#1075;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100; <b>QSqlTableModel</b></font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1091;&#1102; &#1084;&#1077;&#1078;&#1090;&#1072;&#1073;&#1083;&#1080;&#1095;&#1085;&#1099;&#1077; &#1089;&#1074;&#1103;&#1079;&#1080;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_172.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_174.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>