<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_167.html]
* At UTC datetime: [2023-08-19 10:01:17.511550]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 167.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1093; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074;. &#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1074; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1099;&#1093; &#1080;&#1079; &#1041;&#1044;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (<b>SQL</b>-&#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1072; <b>SELECT</b>), &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1077;&#1075;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1099; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1083;&#1077;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>isActive ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; (&#1090;. &#1077;. &#1091; &#1085;&#1077;&#1075;&#1086; &#1088;&#1072;&#1085;&#1077;&#1077; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <b>&#1077;&#1093;&#1077;&#1089;_()</b> &#1080;&#1083;&#1080; <b>execBatch()</b>), &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isSelect ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1073;&#1099;&#1083; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1083;&#1089;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1080;&#1085;&#1086;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072;.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1072; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1089;&#1086;&#1073;&#1099;&#1081; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1076;&#1083;&#1103; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; 
&#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1101;&#1090;&#1086;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1077; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1094;&#1080;&#1088;&#1091;&#1102;&#1097;&#1077;&#1077; &#1085;&#1080;&#1082;&#1072;&#1082;&#1091;&#1102; &#1088;&#1077;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072; &#1085;&#1091;&#1078;&#1085;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;;
 </p></li><li> <b>first ()</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>next ()</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1085;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1080;&#1083;&#1080; &#1085;&#1072; &#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1073;&#1099;&#1083; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>previous ()</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1080;&#1083;&#1080; &#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1079;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;&#1102;. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>last ()</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>seek (&lt;<i>Ho&#1084;ep &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;</i>&gt;[, relative=False])</b> - &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1085;&#1086;&#1084;&#1077;&#1088;&#1086;&#1084; (&#1085;&#1091;&#1084;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1085;&#1091;&#1083;&#1103;). &#1045;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; 
<b>relative</b> &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;:  &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090; &#1089;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; "&#1074;&#1087;&#1077;&#1088;&#1077;&#1076;" (&#1082; &#1082;&#1086;&#1085;&#1094;&#1091;), &#1072; 
&#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; - "&#1085;&#1072;&#1079;&#1072;&#1076;" (&#1082; &#1085;&#1072;&#1095;&#1072;&#1083;&#1091;). &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1096;&#1083;&#1086; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isvalid ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1072; &#1082;&#1072;&#1082;&#1091;&#1102;-&#1083;&#1080;&#1073;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1080; <b>False</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1080;&#1084;&#1077;&#1077;&#1090; &#1085;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>at ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>size ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1077;&#1081;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1080;&#1083;&#1080; -1, &#1077;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1090; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1085;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1083; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1082;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1076;&#1072;&#1083;&#1077;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>value (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;. &#1055;&#1086;&#1083;&#1103; &#1085;&#1091;&#1084;&#1077;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1090;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1085;&#1080; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1074; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077; &#1073;&#1072;&#1079;&#1099; &#1080;&#1083;&#1080; 
&#1074; <b>SQL</b>-&#1082;&#1086;&#1076;&#1077; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>value (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1103; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>isNull (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084; &#1085;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isNull (&lt;<i>&#1048;&#1084;&#1103; &#1087;&#1086;&#1083;&#1103;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1085;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>record ()</b> - &#1077;&#1089;&#1083;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1080;&#1081; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1082;&#1072;&#1082;&#1091;&#1102;-&#1083;&#1080;&#1073;&#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073; &#1101;&#1090;&#1086;&#1081; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1089;&#1072;&#1084;&#1086;&#1081; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1084; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1086;&#1084; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1082;&#1086;&#1076;, &#1080;&#1079;&#1074;&#1083;&#1077;&#1082;&#1072;&#1102;&#1097;&#1080;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; <b>good</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1080;&#1093; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets, QtSql
<span class="sl_sl">import</span> sys
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1085;&#1072;&#1095;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;</span>
&#1072;&#1088;&#1088; = QtWidgets.QApplication(sys.argv)
con = QtSql.QSqlDatabase.addDatabase(<span class="pech">'QSQLITE'</span>) 
con.setDatabaseName(<span class="pech">'c:\\temp\\data.sqlite'</span>)
con.open()
query = QtSql.QSqlQuery()
query.exec(<span class="pech">"select * from good order by goodname"</span>)
lst = []
<span class="sl_sl">if</span> query.isActive():
     query.first()
     <span class="sl_sl">while</span> query.isValid():
          lst.append(query.value(<span class="pech">'goodname'</span>) + <span class="pech">': '</span> + 
             <span class="tp">str</span>(query.value(<span class="pech">'goodcount'</span>)) + <span class="pech">' &#1096;&#1090;.'</span>)
          query.next()
     <span class="sl_sl">for</span> p <span class="sl_sl">in</span> lst:
          <span class="tp">print</span>(p)
     con.close()
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr167_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
<span class="vyvod">&#1041;&#1072;&#1088;&#1072;&#1073;&#1072;&#1085; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;: 8 &#1096;&#1090;.
&#1041;&#1091;&#1084;&#1072;&#1075;&#1072; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;: 3 &#1096;&#1090;.
&#1044;&#1080;&#1089;&#1082;&#1077;&#1090;&#1072;: 10 &#1096;&#1090;.</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1086;&#1095;&#1080;&#1089;&#1090;&#1082;&#1091; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_166.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_168.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>