<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_016.html]
* At UTC datetime: [2023-08-19 09:54:41.220750]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 16.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1080;&#1082;&#1083;&#1086;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1078;&#1076;&#1099;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>&#1077;&#1093;&#1077;&#1089;_()</b>. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1073;&#1084;&#1077;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1086;&#1073;&#1086;&#1081;. 
&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1077;&#1088;&#1074;&#1072;&#1090;&#1100; &#1094;&#1080;&#1082;&#1083;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1090; <b>quit()</b> &#1080;&#1083;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076; <b>exit([returnCode=0])</b>. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1086;&#1073;&#1084;&#1077;&#1085; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;.
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:   utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">class</span> <span class="vyvod">Thread1</span>(QtCore.QThread):
    s1 = QtCore.pyqtSignal(<span class="tp">int</span>)
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtCore.QThread.__init__(self, parent)
        self.count = 0
    <span class="sl_sl">def</span> <span class="vyvod">run</span>(self):
        self.exec_()       <span class="comm"># &#1047;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;</span>
    <span class="sl_sl">def</span> <span class="vyvod">on_start</span>(self):
        self.count += 1
        self.s1.emit(self.count)

<span class="sl_sl">class</span> <span class="vyvod">Thread2</span>(QtCore.QThread):
    s2 = QtCore.pyqtSignal(<span class="tp">str</span>)
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span> (self, parent=<span class="sl_sl">None</span>):
        QtCore.QThread.__init__(self, parent)
    <span class="sl_sl">def</span> <span class="vyvod">run</span>(self):
        self.exec_()       <span class="comm"># &#1047;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;</span>
    <span class="sl_sl">def</span> <span class="vyvod">on_change</span>(self, i):
        i += 10
        self.s2.emit(<span class="pech">"%d"</span> % i)
        
<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent)
        self.label = QtWidgets.QLabel(<span class="pech">"&#1053;&#1072;&#1078;&#1084;&#1080;&#1090;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;"</span>)
        self.label.setAlignment(QtCore.Qt.AlignHCenter)
        self.button = QtWidgets.QPushButton(<span class="pech">"&#1057;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;"</span>)
        self.vbox = QtWidgets.QVBoxLayout()
        self.vbox.addWidget(self.label)
        self.vbox.addWidget(self.button)
        self.setLayout(self.vbox)
        self.thread1 = Thread1()
        self.thread2 = Thread2()
        self.thread1.start()
        self.thread2.start()
        self.button.clicked.connect(self.thread1.on_start)
        self.thread1.s1.connect(self.thread2.on_change)
        self.thread2.s2.connect(self.on_thread2_s2)
    <span class="sl_sl">def</span> <span class="vyvod">on_thread2_s2</span>(self, s):
        self.label.setText(s)

<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span>:
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()
    window.setWindowTitle(<span class="pech">"&#1054;&#1073;&#1084;&#1077;&#1085; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080; &#1084;&#1077;&#1078;&#1076;&#1091; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080;"</span>)
    window.resize(300, 70)
    window.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr16_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris16_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1083;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <b>Thread1</b>, <b>Thread2</b> &#1080; <b>MyWindow</b>. &#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082;&#1080;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1080;&#1093; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>run()</b> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>&#1077;&#1093;&#1077;&#1089;_()</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b> &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>Threadl</b> &#1080; <b>Thread2</b>. 
&#1044;&#1072;&#1083;&#1077;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1089;&#1088;&#1072;&#1079;&#1091; &#1076;&#1074;&#1091;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>on_start()</b> &#1087;&#1077;&#1088;&#1074;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; (&#1074; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1077;&#1085;&#1080;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>count</b>), &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>emit()</b> &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>s1</b>, &#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; <b>s1</b> &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085; &#1089; 
&#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>on_change()</b> &#1074;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082;&#1072;&#1103;-&#1083;&#1080;&#1073;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>s2</b>, &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. 
&#1042; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; <b>s2</b> &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085; &#1089;&#1086; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084; <b>on_thread2_s2</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1086;&#1082;&#1085;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1089; &#1101;&#1090;&#1080;&#1084; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1084;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; 
<b><i>&#1057;&#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;</i></b> &#1074;&#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; <b>on_start()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Thread1</b>, &#1079;&#1072;&#1090;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <b>on_change()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Thread2</b>, &#1072; &#1087;&#1086;&#1090;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>on_thread2_s2</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyWindow</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1081;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_015.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_017.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>