<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_171.html]
* At UTC datetime: [2023-08-19 10:01:27.576593]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 171.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1074;... . &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1072;&#1103; &#1089; SQL-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>c&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1072;&#1082;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1080;&#1079;&#1074;&#1083;&#1077;&#1095;&#1077;&#1085;&#1085;&#1099;&#1077; &#1074; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; <b>SQL</b>-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1080; &#1101;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, 
&#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QSqlQueryModel</b>. &#1054;&#1085; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089; <b>SQL</b>-&#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1086;&#1084;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  QObject - QAbstractItemModel - QAbstractTableModel - QSqlQueryModel
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSqlQueryModel([parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSqlQueryModel</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1080;&#1093; &#1089;&#1086;&#1082;&#1088;&#1072;&#1097;&#1077;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1072; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; 
<a href="https://doc.qt.io/qt-5/qsqlquerymodel.html" target="_blank"><b>https://doc.qt.io/qt-5/qsqlquerymodel.html</b></a>  &#1080; 
<a href="https://doc.qt.io/qt-5/qabstractitemmodel.html" target="_blank"><b>https://doc.qt.io/qt-5/qabstractitemmodel.html</b></a>):
</p><ul>
 <li> <b>setQuery (&lt;<i>&#1050;&#1086;&#1076; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;</i>&gt;[, db=QSqlDatabase()])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. 
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>db</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1079;&#1072;&#1087;&#1088;&#1086;&#1089; &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100;, - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>query ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1076; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>record ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1072; &#1079;&#1072;&#1087;&#1088;&#1086;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>record (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; 
&#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>lastError ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <b>QSqlError</b>, &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1102;&#1102; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1091;&#1102; &#1074; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>index (&lt;<i>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;, &lt;<i>&#1057;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;</i>&gt; [, parent=QModelIndex()])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1075;&#1086;&#1089;&#1103; &#1085;&#1072; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1095;&#1077;&#1085;&#1080;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; 
&#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1072;&#1084;&#1080;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; parent &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; 
&#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1076;&#1083;&#1103; &#1080;&#1089;&#1082;&#1086;&#1084;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1087;&#1086;&#1080;&#1089;&#1082; 
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>data (&lt;QModelIndex&gt;[, role=DispiayRole])</b> -&#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1077; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; 
&#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>role</b> &#1088;&#1086;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; <b>&lt;QModelIndex&gt;</b>;
<p align="JUSTIFY">
 </p></li><li> <b>rowCount ([parent=QModelIndex()])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; 
&#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; 
&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>sort (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;</i>&gt;[, order=AscendingOrder])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1045;&#1089;&#1083;&#1080; &#1074;&#1086;&#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; 
<b>AscendingOrder</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>, &#1090;&#1086; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>DescendingOrder</b> - &#1090;&#1086; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setHeaderData (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &amp;lt<i>;&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;, &lt;<i>3&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;[, role=EditRole])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1083;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; - &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103; (&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>Horizontal</b> &#1080;&#1083;&#1080; 
<b>Vertical</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>). &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>headerData (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt; [, role=DisplayRole])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; 
&#1088;&#1086;&#1083;&#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1083;&#1080; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;, &#1072; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; - &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1085;&#1072;&#1084;&#1080; &#1088;&#1072;&#1085;&#1077;&#1077; &#1073;&#1072;&#1079;&#1099; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;.
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtSql
<span class="sl_sl">import</span> sys
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;, &#1080;&#1085;&#1072;&#1095;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;</span>
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QTableView()
window.setWindowTitle(<span class="pech">"QSqlQueryModel"</span>)
<span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</span>
con = QtSql.QSqlDatabase.addDatabase('QSQLITE') 
con.setDatabaseName(<span class="pech">'c:\\temp\\data.sqlite'</span>)
con.open()
<span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span>
sqm = QtSql.QSqlQueryModel(parent=window)
sqm.setQuery(<span class="pech">'select * from good order by goodname'</span>)
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1080; &#1076;&#1083;&#1103; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1086;&#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;</span>
sqm.setHeaderData(1, QtCore.Qt.Horizontal, <span class="pech">'&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;'</span>)
sqm.setHeaderData(2, QtCore.Qt.Horizontal, <span class="pech">'&#1050;&#1086;&#1083;-&#1074;&#1086;'</span>)
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1076;&#1083;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1090;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;</span>
window.setModel(sqm)
<span class="comm"># &#1057;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1089;&#1090;&#1086;&#1083;&#1073;&#1077;&#1094;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;</span>
window.hideColumn(0)
window.setColumnWidth(1, 150)
window.setColumnWidth(2, 60)
window.resize(230, 130)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1080; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr171_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris171_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1089; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1077;&#1081;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_170.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_172.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>