<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_140.html]
* At UTC datetime: [2023-08-19 10:00:05.949878]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 140.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1087;&#1080;&#1089;&#1082;&#1080; &#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;. &#1052;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089; QStringListModel
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QStringListModel</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b> &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1086;&#1076;&#1085;&#1086;&#1084;&#1077;&#1088;&#1085;&#1091;&#1102; &#1084;&#1086;&#1076;&#1077;&#1083;&#1100;, &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1097;&#1091;&#1102; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1045;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QListView</b>, <b>QComboBox</b> 
&#1080; &#1076;&#1088;., &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setModel()</b> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  QObject - QAbstractItemModel - QAbstractListModel - QStringListModel
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStringListModel</b>:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QStringListModel ( [parent=None])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QStringListModel (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;</i>&gt;[, parent=None])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  lst = [<span class="pech">'Perl'</span>, <span class="pech">'PHP'</span>, <span class="pech">'Python'</span>, <span class="pech">'Ruby'</span>]
  slm = QtCore.QStringListModel (lst, parent = window)
  cbo = QtWidgets.QComboBox()
  cbo.setModel(slm)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QStringListModel</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>index()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractListModel</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QModelIndex</b>) &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  index(&lt;<i>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;[, column=0][, parent=QModelIndex()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1085;&#1091;&#1078;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>column</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; - &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QStringListModel</b>, 
&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1077;&#1075;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;&#1099;&#1077; &#1089;&#1087;&#1080;&#1089;&#1082;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1077;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1088;&#1072;&#1074;&#1085;&#1099;&#1084; 0. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1076;&#1083;&#1103; &#1080;&#1089;&#1082;&#1086;&#1084;&#1086;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; 
&#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1087;&#1086;&#1080;&#1089;&#1082; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1084; &#1091;&#1088;&#1086;&#1074;&#1085;&#1077; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QStringListModel</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qstringlistmodel.html" target="_blank"><b>https://doc.qt.io/qt-5/qstringlistmodel.html</b></a>):
</p><ul>
 <li> <b>setStringList (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;</i>&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>stringList ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1090;&#1088;&#1086;&#1082;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>insertRows (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;</i>&gt;[, parent=QModelIndex()])</b> - &#1074;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1087;&#1091;&#1089;&#1090;&#1099;&#1093; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1102;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;, 
&#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1089;&#1076;&#1074;&#1080;&#1075;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1082;&#1086;&#1085;&#1077;&#1094; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; 
&#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; &#1089;&#1072;&#1084;&#1099;&#1081; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>removeRows (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089;</i>&gt;, &lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;</i>&gt;[, parent=QModelIndex()])</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090;  &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084;. 
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099;, - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1086;&#1081; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1099; &#1080;&#1079; &#1089;&#1072;&#1084;&#1086;&#1075;&#1086; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; 
&#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setData (&lt;QModelIndex&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;[, role=EditRole])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;  &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1088;&#1086;&#1083;&#1080; <b>role</b> &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; <b>&lt;QModelIndex&gt;</b>. 
&#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  lst = QtWidgets.QComboBox()
  slm = QtCore.QStringListModel (parent = window)
  slm.insertRows(0,4) 
  slm.setData(slm.index(0), <span class="pech">'Perl'</span>) 
  slm.setData(slm.index(1), <span class="pech">'PHP'</span>) 
  slm.setData(slm.index(2), <span class="pech">'Python'</span>)
  slm.setData(slm.index(3), <span class="pech">'Ruby'</span>)
  lst.setModel(slm)
</pre></div>
 </li><li> <b>data (&lt;QModelIndex&gt;, &lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1093;&#1088;&#1072;&#1085;&#1080;&#1084;&#1099;&#1077; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1086;&#1083;&#1080; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1089;&#1099;&#1083;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; <b>&lt;QModelIndex&gt;</b>;
<p align="JUSTIFY">
 </p></li><li> <b>rowCount ([parent=QModelIndex()])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1087;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1086; 
&#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1077;&#1075;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, - &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1086; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>sort (&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1089;&#1090;&#1086;&#1083;&#1073;&#1094;&#1072;</i>&gt;[, order=AscendingOrder])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;.  &#1045;&#1089;&#1083;&#1080; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>AscendingOrder</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, 
&#1090;&#1086; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1087;&#1088;&#1103;&#1084;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;, &#1072; &#1077;&#1089;&#1083;&#1080; <b>DescendingOrder</b> - &#1090;&#1086; &#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;</i> QStandardItemModel</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_139.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav7.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_141.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>