<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_206.html]
* At UTC datetime: [2023-08-19 10:02:55.452852]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 206.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QGraphicsScene: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1055;&#1088;&#1086;&#1095;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1074;&#1072;&#1078;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qgraphicsscene.html" target="_blank"><b>https://doc.qt.io/qt-5/qgraphicsscene.html</b></a>):
</p><ul>
 <li> <b>isActive ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1089;&#1094;&#1077;&#1085;&#1072; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1072;&#1082;&#1086;&#1075;&#1086;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>views ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsView</b>), &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1089;&#1094;&#1077;&#1085;&#1072; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>mouseGrabberItem ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1083;&#1072;&#1076;&#1077;&#1077;&#1090; &#1084;&#1099;&#1096;&#1100;&#1102;, &#1080;&#1083;&#1080; <b>None</b>, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1085;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>render ()</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; &#1089;&#1094;&#1077;&#1085;&#1099; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  render(&lt;QPainter&gt;[, target=QRectF()][, source=QRectF()][, 
    mode=KeepAspectRatio])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>target</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>source</b> - &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099;, 
&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>mode</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1088;&#1077;&#1078;&#1080;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080; &#1087;&#1088;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1077;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QtCore.Qt</b>:
</p><ul>
 <li> <b>IgnoreAspectRatio (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;;
 </li><li> <b>KeepAspectRatio (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081;;
 </li><li> <b>KeepAspectRatioByExpanding (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;&#1086;&#1081; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1081;&#1090;&#1080; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1072; &#1091;&#1089;&#1090;&#1088;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>invalidate ()</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1091; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1083;&#1086;&#1077;&#1074; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1077;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  invalidate(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;[, layers=AllLayers]) 
  invalidate([rect=QRectF()][, layers=AllLayers])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>layers</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1089;&#1083;&#1086;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsScene</b>:
</p><ul>
 <li> <b>ItemLayer (<i>&#1080;&#1083;&#1080;</i> l)</b> - &#1089;&#1083;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;;
 </li><li> <b>BackgroundLayer (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1083;&#1086;&#1081; &#1079;&#1072;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1083;&#1072;&#1085;&#1072;;
 </li><li> <b>ForegroundLayer (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1089;&#1083;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1083;&#1072;&#1085;&#1072;;
 </li><li> <b>AllLayers (<i>&#1080;&#1083;&#1080;</i> 65535)</b> - &#1074;&#1089;&#1077; &#1089;&#1083;&#1086;&#1080;. &#1042;&#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1081; &#1079;&#1072;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1083;&#1072;&#1085;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; - &#1089;&#1083;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080; &#1074; &#1082;&#1086;&#1085;&#1094;&#1077; - &#1089;&#1083;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1087;&#1083;&#1072;&#1085;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
</p><p align="JUSTIFY">
 </p></li><li> <b>update ()</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1091; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  update(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;) 
  update([rect=QRectF()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;.
</p></li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>changed (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1077;&#1081;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRectF</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1084;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1074;&#1096;&#1080;&#1077;&#1089;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1089;&#1094;&#1077;&#1085;&#1099;;
 </li><li> <b>sceneRectChanged (&lt;QRectF&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1089;&#1094;&#1077;&#1085;&#1099;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRectF</b> &#1089; &#1085;&#1086;&#1074;&#1099;&#1084;&#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1089;&#1094;&#1077;&#1085;&#1099;;
 </li><li> <b>selectionChanged ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;;
 </li><li> <b>focusItemChanged (&lt;QGraphicItem&gt;, &lt;QGraphicItem&gt;, &lt;<i>&#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1085;&#1086;&#1075;&#1086; &#1074;&#1074;&#1086;&#1076;&#1072;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1074;&#1096;&#1080;&#1081; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;, 
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1087;&#1086;&#1090;&#1077;&#1088;&#1103;&#1074;&#1096;&#1080;&#1081; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1080; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_061.html" target="_blank">61 &#1096;&#1072;&#1075;</a>).
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072; &#1084;&#1099; &#1085;&#1072;&#1095;&#1085;&#1077;&#1084; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1090;&#1100; <b><i>&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1089;&#1094;&#1077;&#1085;&#1099;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_205.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav11.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_207.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>