<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_181.html]
* At UTC datetime: [2023-08-19 10:01:53.669238]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 181.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;. &#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;. &#1050;&#1083;&#1072;&#1089;&#1089; QPen: &#1087;&#1077;&#1088;&#1086;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPen</b> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1080;&#1088;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1087;&#1077;&#1088;&#1086;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1086;&#1095;&#1077;&#1082;, &#1083;&#1080;&#1085;&#1080;&#1081; &#1080; 
&#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1086;&#1074; &#1092;&#1080;&#1075;&#1091;&#1088;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPen() 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPen(&lt;QColor&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPen(&lt;&#1057;&#1090;&#1080;&#1083;&#1100;&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPen(&lt;QBrush&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;[, style=SolidLine][, cap=SquareCap]
      [, join=BevelJoin]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPen(&lt;QPen&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1077;&#1088;&#1086; &#1095;&#1077;&#1088;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072; &#1089; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072;&#1084;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1094;&#1074;&#1077;&#1090; 
&#1087;&#1077;&#1088;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>. &#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1090;&#1080;&#1083;&#1100; &#1083;&#1080;&#1085;&#1080;&#1080; - &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
</p><ul>
 <li> <b>NoPen (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1083;&#1080;&#1085;&#1080;&#1103; &#1085;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;;
 </li><li> <b>SolidLine (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;;
 </li><li> <b>DashLine (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1096;&#1090;&#1088;&#1080;&#1093;&#1086;&#1074;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;;
 </li><li> <b>DotLine (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1090;&#1086;&#1095;&#1077;&#1095;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;;
 </li><li> <b>DashDotLine (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1096;&#1090;&#1088;&#1080;&#1093; &#1080; &#1090;&#1086;&#1095;&#1082;&#1072;, &#1096;&#1090;&#1088;&#1080;&#1093; &#1080; &#1090;&#1086;&#1095;&#1082;&#1072; &#1080; &#1090;. &#1076;.;
 </li><li> <b>DashDotDotLine (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1096;&#1090;&#1088;&#1080;&#1093; &#1080; &#1076;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080;, &#1096;&#1090;&#1088;&#1080;&#1093; &#1080; &#1076;&#1074;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1080; &#1090;. &#1076;.;
 </li><li> <b>CustomDashLine (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1089;&#1090;&#1080;&#1083;&#1100;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1080;&#1089;&#1090;&#1080;&#1082;&#1080; &#1087;&#1077;&#1088;&#1072; &#1079;&#1072; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;: &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QBrush</b> &#1080;&#1083;&#1080; <b>QColor</b>, &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;, &#1089;&#1090;&#1080;&#1083;&#1100; &#1083;&#1080;&#1085;&#1080;&#1080; - &#1074; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; 
<b>style</b>, &#1072; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>cap</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1083;&#1080;&#1085;&#1080;&#1080;, &#1075;&#1076;&#1077; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; 
&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
</p><ul>
 <li> <b>FlatCap (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1077;&#1094; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1044;&#1083;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &#1085;&#1077; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1072;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1085;&#1099;&#1093; &#1090;&#1086;&#1095;&#1077;&#1082;;
 </li><li> <b>SquareCap (<i>&#1080;&#1083;&#1080;</i> 16)</b> - &#1082;&#1074;&#1072;&#1076;&#1088;&#1072;&#1090;&#1085;&#1099;&#1081; &#1082;&#1086;&#1085;&#1077;&#1094; &#1083;&#1080;&#1085;&#1080;&#1080;. &#1044;&#1083;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1086;&#1073;&#1086;&#1080;&#1093; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1085;&#1072; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1091; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1083;&#1080;&#1085;&#1080;&#1080;;
 </li><li> <b>RoundCap (<i>&#1080;&#1083;&#1080;</i> 32)</b> - &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082;&#1086;&#1085;&#1094;&#1099;. &#1044;&#1083;&#1080;&#1085;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &#1091;&#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1086;&#1073;&#1086;&#1080;&#1093; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1085;&#1072; &#1087;&#1086;&#1083;&#1086;&#1074;&#1080;&#1085;&#1091; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1083;&#1080;&#1085;&#1080;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>join</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; - &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
</p><ul>
 <li> <b>MiterJoin (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1083;&#1080;&#1085;&#1080;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; &#1086;&#1089;&#1090;&#1088;&#1099;&#1084; &#1091;&#1075;&#1083;&#1086;&#1084;;
 </li><li> <b>BevelJoin (<i>&#1080;&#1083;&#1080;</i> 64)</b> - &#1087;&#1088;&#1086;&#1089;&#1090;&#1088;&#1072;&#1085;&#1089;&#1090;&#1074;&#1086; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1085;&#1094;&#1072;&#1084;&#1080; &#1083;&#1080;&#1085;&#1080;&#1081; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084; &#1083;&#1080;&#1085;&#1080;&#1080;;
 </li><li> <b>RoundJoin (<i>&#1080;&#1083;&#1080;</i> 128)</b> - &#1089;&#1082;&#1088;&#1091;&#1075;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1091;&#1075;&#1083;&#1099;;
 </li><li> <b>SvgMiterJoin (<i>&#1080;&#1083;&#1080;</i> 256)</b> -  &#1083;&#1080;&#1085;&#1080;&#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1076; &#1086;&#1089;&#1090;&#1088;&#1099;&#1084; &#1091;&#1075;&#1083;&#1086;&#1084;, &#1082;&#1072;&#1082; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1086; &#1074; &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080; <b>SVG 1.2 Tiny</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPen</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qpen.html" target="_blank"><b>https://doc.qt.io/qt-5/qpen.html</b></a>):
</p><ul>
 <li> <b>setColor (&lt;QColor&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1083;&#1080;&#1085;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setBrush (&lt;QBrush&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1080;&#1089;&#1090;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>setWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1090;&#1080;&#1087;&#1072;</i> int&gt;)</b> &#1080; <b>setWidthF (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1090;&#1080;&#1087;&#1072;</i> float&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; 
&#1083;&#1080;&#1085;&#1080;&#1080; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1080;&#1083;&#1080; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084; &#1089; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1090;&#1086;&#1095;&#1082;&#1086;&#1081; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setStyle (&lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1083;&#1080;&#1085;&#1080;&#1080; (&#1089;&#1084;. &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>style</b> &#1074; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1084; 
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPen</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setCapstyle (&lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1082;&#1086;&#1085;&#1094;&#1086;&#1074; &#1083;&#1080;&#1085;&#1080;&#1080; (&#1089;&#1084;, &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>cap</b> &#1074; 
&#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPen</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setJoinStyle (&lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; (&#1089;&#1084;. &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>join</b> &#1074; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPen</b>).
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QBrush</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_180.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav10.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_182.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>