<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_032.html]
* At UTC datetime: [2023-08-19 09:55:25.355451]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 32.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;. &#1050;&#1083;&#1072;&#1089;&#1089; QSize: &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QSize</b> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;. &#1044;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1086;&#1074;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSize()
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSize(&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QSize(&lt;<i>QSize</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089; &#1086;&#1090;&#1088;&#1080;&#1094;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1081; &#1096;&#1080;&#1088;&#1080;&#1085;&#1086;&#1081; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1086;&#1081;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1103;&#1074;&#1085;&#1086; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091;. &#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
&gt;&gt;&gt; <span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore
&gt;&gt;&gt; s1=QtCore.QSize(); s2=QtCore.QSize(10, 55); s3=QtCore.QSize(s2)
&gt;&gt;&gt; s1
<span class="vyvod">PyQt5.QtCore.QSize(-1, -1)</span>
&gt;&gt;&gt; s2, s3
<span class="vyvod">(PyQt5.QtCore.QSize(10, 55), PyQt5.QtCore.QSize(10, 55))</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1077;&#1088;&#1077;&#1079; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>width ()</b> &#1080; <b>height ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;;
<p align="JUSTIFY">
 </p></li><li> <b>setWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> &#1080; <b>setHeight (&lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;:
<div class="fon"><pre>
&gt;&gt;&gt; s  = QtCore.QSize()
&gt;&gt;&gt; s.setWidth(10); s.setHeight (55)
&gt;&gt;&gt; s.width(), s.height()
<span class="vyvod">(10, 55)</span>
</pre></div>
 </li><li> <b>isNull ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; &#1088;&#1072;&#1074;&#1085;&#1099; &#1085;&#1091;&#1083;&#1102;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isValid ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; &#1088;&#1072;&#1074;&#1085;&#1099; &#1085;&#1091;&#1083;&#1102;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isEmpty ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1076;&#1080;&#1085; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; (&#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1080;&#1083;&#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072;) &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; &#1080;&#1083;&#1080; 
&#1088;&#1072;&#1074;&#1077;&#1085; &#1085;&#1091;&#1083;&#1102;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>scale ()</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1080; &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;
&#1084;&#1077;&#1090;&#1088;&#1072; <b>&lt;<i>&#1058;&#1080;&#1087; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;</b>.  &#1052;&#1077;&#1090;&#1086;&#1076; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;. 
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  scale (&lt;QSize&gt;, &lt;<i>&#1058;&#1080;&#1087; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;)
  scale (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;, &lt;<i>&#1058;&#1080;&#1087; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1058;&#1080;&#1087; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;</b> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QtCore.Qt</b>:
</p><ul>
 <li> <b>IgnoreAspectRatio (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;;
 </li><li> <b>KeepAspectRatio (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1084;&#1072;&#1089;&#1096;&#1090;&#1072;&#1073;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1090;&#1072;&#1088;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; 
&#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1086;&#1074;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1073;&#1077;&#1079; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081;;
 </li><li> <b>KeepAspectRatioByExpanding (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1073;&#1077;&#1079; &#1085;&#1072;&#1088;&#1091;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1072;&#1088;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1085;&#1086;&#1074;&#1072;&#1103; &#1096;&#1080;&#1088;&#1080;&#1085;&#1072; &#1080;&#1083;&#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1072; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 0, &#1090;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081;, 
&#1074;&#1085;&#1077; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &lt;<b>&lt;<i>&#1058;&#1080;&#1087; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
</p><div class="fon"><pre>
&gt;&gt;&gt; s = QtCore.QSize(50, 20)
&gt;&gt;&gt; s.scale (70, 60, QtCore.Qt.IgnoreAspectRatio); s
<span class="vyvod">PyQt5.QtCore.QSize(70, 60)</span>
&gt;&gt;&gt; s = QtCore.QSize(50, 20)
&gt;&gt;&gt; s.scale (70, 60, QtCore.Qt.KeepAspectRatio); s
<span class="vyvod">PyQt5.QtCore.QSize(70, 28)</span>
&gt;&gt;&gt; s = QtCore.QSize(50, 20)
&gt;&gt;&gt; s.scale (70, 60, QtCore.Qt.KeepAspectRatioByExpanding); s
<span class="vyvod">PyQt5.QtCore.QSize(150, 60)</span>
</pre></div>
 </li><li> <b>scaled ()</b> - &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1095;&#1090;&#1086; <b>scale()</b>, &#1085;&#1086; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
<div class="fon"><pre>
&gt;&gt;&gt; s1 = QtCore.QSize(50, 20)
&gt;&gt;&gt; s2 = s1.scaled(70, 60, QtCore.Qt.IgnoreAspectRatio)
&gt;&gt;&gt; s1, s2
<span class="vyvod">(PyQt5.QtCore.QSize(50, 20), PyQt5.QtCore.QSize(70, 60))</span>
</pre></div>
 </li><li> <b>boundedTo (&lt;QSize&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; 
&#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1080;&#1079; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
<div class="fon"><pre>
&gt;&gt;&gt; s = QtCore.QSize (50, 20)
&gt;&gt;&gt; s.boundedTo(QtCore.QSize(400, 5))
<span class="vyvod">PyQt5.QtCore.QSize(50, 5)</span>
&gt;&gt;&gt; s.boundedTo(QtCore.QSize(40, 50))
<span class="vyvod">PyQt5.QtCore.QSize(40, 20)</span>
</pre></div>
 </li><li> <b>expandedTo (&lt;QSize&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; 
&#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1080;&#1079; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; s = QtCore.QSize(50, 20)
&gt;&gt;&gt; s.expandedTo (QtCore.QSize(400, 5))
<span class="vyvod">PyQt5.QtCore.QSize(400, 20)</span>
&gt;&gt;&gt; s.expandedTo(QtCore.QSize(40, 50))
<span class="vyvod">PyQt5.QtCore.QSize(50, 50)</span>
</pre></div>
 </li><li> <b>transpose ()</b> - &#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1089;&#1090;&#1072;&#1084;&#1080;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; s = QtCore.QSize(50, 20)
&gt;&gt;&gt; s.transpose (); s
<span class="vyvod">PyQt5.QtCore.QSize(20, 50)</span>
</pre></div>
 </li><li> <b>transposed ()</b> - &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1095;&#1090;&#1086; <b>transpose()</b>, &#1085;&#1086; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1089;&#1072;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1072; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QSize</b> &#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1084;&#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
&gt;&gt;&gt; s1 = QtCore.QSize (50, 20)
&gt;&gt;&gt; s2 = s1.transposed()
&gt;&gt;&gt; s1, s2
<span class="vyvod">(PyQt5.QtCore.QSize(50, 20), PyQt5.QtCore.QSize(20, 50))</span>
</pre></div>
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072;&#1076; &#1076;&#1074;&#1091;&#1084;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1099; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; +, +=, - (&#1084;&#1080;&#1085;&#1091;&#1089;), -=, = &#1080; !=. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1084;&#1085;&#1086;&#1078;&#1080;&#1090;&#1100; &#1080;&#1083;&#1080; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1072; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1095;&#1080;&#1089;&#1083;&#1086; (&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;&#1084;&#1080; *, *=, / &#1080; /=). &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
&gt;&gt;&gt; s1 = QtCore.QSize(50, 20); s2 = QtCore.QSize (10, 5)
&gt;&gt;&gt; s1 + s2, s1 - s2
<span class="vyvod">(PyQt5.QtCore.QSize(60, 25), PyQt5.QtCore.QSize(40, 15))</span>
&gt;&gt;&gt; s1 * 2.5, s1 / 2
<span class="vyvod">(PyQt5.QtCore.QSize(125, 50), PyQt5.QtCore.QSize(25, 10))</span>
&gt;&gt;&gt; s1 == s2, s1 != s2
<span class="vyvod">(False, True)</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QRect</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_031.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_033.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>