<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_020.html]
* At UTC datetime: [2023-08-19 09:54:52.088799]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 20.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1052;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1083;&#1072;&#1089;&#1089; QMutexLocker
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>change_x()</b> &#1088;&#1077;&#1089;&#1091;&#1088;&#1089; &#1086;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084;, &#1090;. &#1082;. &#1074;&#1099;&#1079;&#1086;&#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>unlock()</b> &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1086; &#1089;&#1083;&#1091;&#1095;&#1072;&#1081;&#1085;&#1086;&#1089;&#1090;&#1080; 
&#1079;&#1072;&#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>unlock()</b>, &#1095;&#1090;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1074;&#1077;&#1095;&#1085;&#1086;&#1081; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1089;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1091;&#1102; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QMutexLocker</b>. &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1084;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089;&#1072; &#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; 
&#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1076;&#1077;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1072;&#1074;&#1090;&#1077;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1057;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutexLocker</b> &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1090;&#1086; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; 
&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1085;&#1103;&#1090;&#1072;. &#1055;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <b>change_x()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QMutexLocker</b>.
</p><div class="fon"><pre>
    <span class="sl_sl">def</span> <span class="vyvod">change_x</span>(self):
        m1 = QtCore.QMutexLocker(MyThread.mutex)
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        MyThread.x += 5
        self.sleep(2)
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        MyThread.x += 34
        <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
        <span class="comm"># &#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1085;&#1080;&#1084;&#1077;&#1090;&#1089;&#1103;</span>
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr20_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutexLocker</b> &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100; &#1086; &#1088;&#1072;&#1079;&#1085;&#1080;&#1094;&#1077; &#1084;&#1077;&#1078;&#1076;&#1091; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1103;&#1084;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074; &#1103;&#1079;&#1099;&#1082;&#1072;&#1093; <b>C++</b> &#1080; <b>Python</b>. &#1042; &#1103;&#1079;&#1099;&#1082;&#1077; <b>C++</b> &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; 
&#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1072; &#1073;&#1083;&#1086;&#1082;&#1086;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1084;&#1086;&#1078;&#1077;&#1090; &#1103;&#1074;&#1083;&#1103;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1103;, &#1090;&#1072;&#1082; &#1080; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1092;&#1080;&#1075;&#1091;&#1088;&#1085;&#1099;&#1084;&#1080; &#1089;&#1082;&#1086;&#1073;&#1082;&#1072;&#1084;&#1080;. &#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1073;&#1083;&#1086;&#1082;&#1072; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;, 
&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>if</b>, &#1090;&#1086; &#1087;&#1088;&#1080; &#1074;&#1099;&#1093;&#1086;&#1076;&#1077; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1091;&#1078;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1072;:
</p><div class="fon"><pre>
  <span class="vyvod">if</span> (<i>&#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;</i>) {
    <span class="vyvod">int</span> &#1093; = 10; <span class="pech">// &#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102;</span>
    <span class="pech">//.... </span>
  }
  <span class="pech">// &#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1093; &#1091;&#1078;&#1077; &#1085;&#1077; &#1074;&#1080;&#1076;&#1085;&#1072;!</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1103;&#1079;&#1099;&#1082;&#1077; <b>Python</b> &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1075;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1096;&#1080;&#1088;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1084;&#1099; &#1086;&#1073;&#1098;&#1103;&#1074;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1091;&#1089;&#1083;&#1086;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;, &#1090;&#1086; &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1080;&#1076;&#1085;&#1072; &#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1101;&#1090;&#1086;&#1075;&#1086; &#1073;&#1083;&#1086;&#1082;&#1072;:
</p><div class="fon"><pre>
  <span class="sl_sl">if</span> &#1091;&#1089;&#1083;&#1086;&#1074;&#1080;&#1077;:
      &#1093; = 10     <span class="comm"># &#1054;&#1073;&#1098;&#1103;&#1074;&#1083;&#1103;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1091;&#1102;</span>
      <span class="comm"># ... </span>
  <span class="comm"># &#1047;&#1076;&#1077;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1072;&#1103; &#1093; &#1077;&#1097;&#1077; &#1074;&#1080;&#1076;&#1085;&#1072;</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; &#1103;&#1079;&#1099;&#1082;&#1077; <b><i>Python</i></b> &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1072; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1077;&#1081;, &#1072; &#1085;&#1077; &#1083;&#1102;&#1073;&#1099;&#1084; &#1073;&#1083;&#1086;&#1082;&#1086;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMutexLocker</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; &#1084;&#1077;&#1085;&#1077;&#1076;&#1078;&#1077;&#1088;&#1086;&#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1073;&#1083;&#1086;&#1082;&#1086;&#1084; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <b>with...as</b>. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083; &#1075;&#1072;&#1088;&#1072;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; 
&#1089;&#1085;&#1103;&#1090;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1076;&#1072;&#1078;&#1077; &#1087;&#1088;&#1080; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1080; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1080; <b>with...as</b>. &#1055;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <b>change_x()</b> &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>MyThread</b> &#1089;&#1085;&#1086;&#1074;&#1072; &#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1074; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1094;&#1080;&#1102; 
<b>with...as</b>.
</p><div class="fon"><pre>
    <span class="sl_sl">def</span> <span class="vyvod">change_x</span>(self):
        <span class="sl_sl">with</span> QtCore.QMutexLocker(MyThread.mutex):
            <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
            MyThread.x += 5
            self.sleep(2)
            <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
            MyThread.x += 34
            <span class="tp">print</span>(<span class="pech">"x ="</span>, MyThread.x, <span class="pech">"id ="</span>, self.id)
            <span class="comm"># &#1041;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1089;&#1085;&#1080;&#1084;&#1077;&#1090;&#1089;&#1103;</span>
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr20_2.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1074;&#1099; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1077;&#1090;&#1077; &#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1072;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1081;:
</p><ul>
 <li> &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1080; &#1089;&#1085;&#1103;&#1090;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1082; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080;, &#1090;&#1077;&#1084; &#1089;&#1072;&#1084;&#1099;&#1084; &#1089;&#1085;&#1080;&#1078;&#1072;&#1103; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1089;&#1077;&#1081; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1099;&#1077; &#1090;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077; &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1102;&#1090; &#1073;&#1077;&#1079;&#1086;&#1087;&#1072;&#1089;&#1085;&#1091;&#1102; 
&#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1074; &#1084;&#1085;&#1086;&#1075;&#1086;&#1087;&#1086;&#1090;&#1086;&#1095;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1048; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;, &#1087;&#1086;&#1076;&#1091;&#1084;&#1072;&#1081;&#1090;&#1077; - &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100;, &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1086;&#1085;&#1080; &#1080; &#1085;&#1077; &#1085;&#1091;&#1078;&#1085;&#1099;;
 </li><li> &#1074;&#1090;&#1086;&#1088;&#1086;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1091; &#1082; &#1079;&#1072;&#1097;&#1080;&#1097;&#1077;&#1085;&#1085;&#1086;&#1084;&#1091; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; &#1080;&#1079; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082;&#1072;. &#1054;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1077; &#1089;&#1085;&#1103;&#1090;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082;, &#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1089;&#1090;&#1072;&#1085;&#1077;&#1090; 
&#1088;&#1077;&#1072;&#1075;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1055;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1090;&#1072;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;, &#1072; &#1085;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1081; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;;
 </li><li> &#1080; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1077; &#1079;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1089;&#1103; &#1082; <b><i>&#1074;&#1079;&#1072;&#1080;&#1084;&#1085;&#1086;&#1081; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1077;</i></b>. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082;, &#1074;&#1083;&#1072;&#1076;&#1077;&#1103; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1084; <b>&#1040;</b>, &#1079;&#1072;&#1093;&#1086;&#1095;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; <b>B</b>, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1090;&#1086;&#1082;, &#1074;&#1083;&#1072;&#1076;&#1077;&#1103; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1084; <b>B</b>, 
&#1079;&#1072;&#1093;&#1086;&#1095;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1091; <b>&#1040;</b>, &#1090;&#1086; &#1086;&#1073;&#1072; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1078;&#1076;&#1072;&#1090;&#1100; &#1089;&#1085;&#1103;&#1090;&#1080;&#1103; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1074;&#1077;&#1095;&#1085;&#1086;. &#1042; &#1101;&#1090;&#1086;&#1081; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1091;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1100; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1103; 
&#1088;&#1077;&#1089;&#1091;&#1088;&#1089;&#1086;&#1074; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1087;&#1086;&#1089;&#1083;&#1077; &#1087;&#1088;&#1077;&#1074;&#1099;&#1096;&#1077;&#1085;&#1080;&#1103; &#1087;&#1077;&#1088;&#1080;&#1086;&#1076;&#1072; &#1086;&#1078;&#1080;&#1076;&#1072;&#1085;&#1080;&#1103;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMutexLocker</b> &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <b>unlock()</b> &#1080; <b>relock()</b>. &#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1084;&#1100;&#1102;&#1090;&#1077;&#1082;&#1089;&#1072; &#1073;&#1077;&#1079; &#1091;&#1085;&#1080;&#1095;&#1090;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMutexLocker</b>, &#1072; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1085;&#1086;&#1077; &#1085;&#1072;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080;.
</p><p align="JUSTIFY">
</p><hr><i>
&#160;&#160;&#160;<b><i><i>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</i>.</i></b> 
&#1044;&#1083;&#1103; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1080; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <b>QSemaphore</b> &#1080; <b>QWaitCondition</b>. &#1047;&#1072; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1087;&#1086; &#1101;&#1090;&#1080;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;&#1084; &#1086;&#1073;&#1088;&#1072;&#1097;&#1072;&#1081;&#1090;&#1077;&#1089;&#1100; &#1082; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; 
<b>PyQt</b>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;&#1084;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1084; &#1074; &#1087;&#1072;&#1087;&#1082;&#1077; <b>C:\Python34\Lib\site-packages\PyQt5\examples\threads</b>. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1074; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1091;&#1102; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; &#1103;&#1079;&#1099;&#1082;&#1072; 
<b>Python</b> &#1074;&#1093;&#1086;&#1076;&#1103;&#1090; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080; <b>multiprocessing</b> &#1080; <b>threading</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1084;&#1080; &#1074; &#1083;&#1102;&#1073;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; <b>PyQt</b> &#1085;&#1091;&#1078;&#1085;&#1086; &#1086;&#1090;&#1076;&#1072;&#1090;&#1100; 
&#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1090;&#1077;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QThread</b>, &#1090;. &#1082;. &#1086;&#1085; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;&#1084;&#1080;.</i><hr>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1099;&#1074;&#1086;&#1076; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_019.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_021.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>