<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_106.html]
* At UTC datetime: [2023-08-19 09:58:40.572868]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 106.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1054;&#1076;&#1085;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;. &#1042;&#1074;&#1086;&#1076; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1086; &#1084;&#1072;&#1089;&#1082;&#1077;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1074;&#1074;&#1086;&#1076;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setInputMask(&lt;<i>Mac&#1082;a</i>&gt;)</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1074;&#1074;&#1086;&#1076; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074; &#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1084; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1086;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1072;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
 "&lt;<i>&#1055;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;</i>&gt;[;&lt;<i>&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;-&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;]"
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;:
</p><ul>
 <li> <b>9</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 9;
 </li><li> <b>0</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 9;
 </li><li> <b>D</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 1 &#1076;&#1086; 9;
 </li><li> <b>d</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 1 &#1076;&#1086; 9;
 </li><li> <b>B</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; 0 &#1080;&#1083;&#1080; 1;
 </li><li> <b>b</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072; 0 &#1080;&#1083;&#1080; 1;
 </li><li> <b>H</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; (0-9, <b>A-F</b>, <b>a-f</b>);
 </li><li> <b>h</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085; &#1096;&#1077;&#1089;&#1090;&#1085;&#1072;&#1076;&#1094;&#1072;&#1090;&#1077;&#1088;&#1080;&#1095;&#1085;&#1099;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; (0-9, <b>A-F</b>, <b>a-f</b>);
 </li><li> <b>#</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1094;&#1080;&#1092;&#1088;&#1072;, &#1079;&#1085;&#1072;&#1082; &#1087;&#1083;&#1102;&#1089; &#1080;&#1083;&#1080; &#1084;&#1080;&#1085;&#1091;&#1089;;
 </li><li> <b>&#1040;</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1073;&#1091;&#1082;&#1074;&#1072; &#1074; &#1083;&#1102;&#1073;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077;;
 </li><li> <b>&#1072;</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1073;&#1091;&#1082;&#1074;&#1072;;
 </li><li> <b>N</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1073;&#1091;&#1082;&#1074;&#1072; &#1074; &#1083;&#1102;&#1073;&#1086;&#1084; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1077; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 9;
 </li><li> <b>n</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1072;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1072; &#1073;&#1091;&#1082;&#1074;&#1072; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 9;
 </li><li> <b>X</b> - &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;;
 </li><li> <b>&#1093;</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;, &#1085;&#1086; &#1085;&#1077; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1077;&#1085; &#1083;&#1102;&#1073;&#1086;&#1081; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;;
 </li><li> <b>&gt;</b> - &#1074;&#1089;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;;
 </li><li> <b>&lt;</b> - &#1074;&#1089;&#1077; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1073;&#1091;&#1082;&#1074;&#1099; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1085;&#1080;&#1078;&#1085;&#1080;&#1081; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;;
 </li><li> <b>!</b> - &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1075;&#1080;&#1089;&#1090;&#1088;&#1072;;
 </li><li> <b>\</b> - &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1086;&#1090;&#1084;&#1077;&#1085;&#1099; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089;&#1087;&#1077;&#1094;&#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1086;&#1074;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1089;&#1077; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1090;&#1088;&#1072;&#1082;&#1090;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1077;&#1089;&#1090;&#1100;. &#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1057;&#1080;&#1084;&#1074;&#1086;&#1083;-&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; 
&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1087;&#1086;&#1083;&#1077;, &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1103; &#1084;&#1077;&#1089;&#1090;&#1086; &#1074;&#1074;&#1086;&#1076;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1077;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1083;&#1091;&#1078;&#1080;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  lineEdit.setInputMask(<span class="pech">"&#1044;&#1072;&#1090;&#1072;: 99.B9.9999;_"</span>)     <span class="comm"># &#1044;&#1072;&#1090;&#1072;:  __.__.____</span>
  lineEdit.setInputMask(<span class="pech">"&#1044;&#1072;&#1090;&#1072;: 99.B9.9999;#"</span>)     <span class="comm"># &#1044;&#1072;&#1090;&#1072;:  ##.##.####</span>
  lineEdit.setInputMask(<span class="pech">"&#1044;&#1072;&#1090;&#1072;: 99.&#1042;9.9999 &#1075;."</span>)    <span class="comm"># &#1044;&#1072;&#1090;&#1072;:    .  .     &#1075;.</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1084;&#1072;&#1089;&#1082;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>hasAcceptableInput()</b>. &#1045;&#1089;&#1083;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1084;&#1072;&#1089;&#1082;&#1077;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1072; &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; - <b>False</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1100; &#1074;&#1074;&#1086;&#1076;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_105.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav5.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_107.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>