<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_178.html]
* At UTC datetime: [2023-08-19 10:01:46.438180]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 178.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;. &#1042;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;. &#1050;&#1083;&#1072;&#1089;&#1089; QColor: &#1094;&#1074;&#1077;&#1090;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1092;&#1086;&#1088;&#1084;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;  &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; </i>RGB</b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QColor</b> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1074; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1099;&#1093; &#1084;&#1086;&#1076;&#1077;&#1083;&#1103;&#1093; <b>RGB</b>, <b>CMYK</b>, <b>HSV</b> &#1080;&#1083;&#1080; <b>HSL</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor()
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor(&lt;<i>&#1050;&#1088;&#1072;&#1089;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;[, alpha=255])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor(&lt;<i>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor(&lt;<i>&#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1094;&#1074;&#1077;&#1090;&#1072;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor(&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QColor(&lt;QColor&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1085;&#1077;&#1074;&#1072;&#1083;&#1080;&#1076;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072; &#1074;&#1072;&#1083;&#1080;&#1076;&#1085;&#1086;&#1089;&#1090;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>isValid()</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074;&#1072;&#1083;&#1080;&#1076;&#1085;&#1099;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1081;, &#1079;&#1077;&#1083;&#1077;&#1085;&#1086;&#1081; &#1080; &#1089;&#1080;&#1085;&#1077;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>RGB</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; &#1086; &#1076;&#1086; 255. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>alpha</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091; 
&#1094;&#1074;&#1077;&#1090;&#1091;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 255- &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072;:
</p><div class="fon"><pre>
  red = QtGui.QColor(255, 0, 0)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1094;&#1074;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093; <b>"#RGB", "#RRGGBB", "#AARRGGBB"</b>    (&#1079;&#1076;&#1077;&#1089;&#1100; <b>&#1040;&#1040;</b> &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1077;&#1090;    
&#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072;), <b>"#RRRGGGBBB", "#RRRRGGGGBBBB"</b>, <b><i>"&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;"</i></b> &#1080;&#1083;&#1080; <b>"transparent"</b> 
(&#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072;). &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
</p><div class="fon"><pre>
red = QtGui.QColor(<span class="pech">"#f00"</span>) 
darkBlue = QtGui.QColor(<span class="pech">"#000080"</span>)
semiTransparentDarkBlue = QtGui.QColor(<span class="pech">"#7F000080"</span>) 
white = QtGui.QColor(<span class="pech">"white"</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1081; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <b>colorNames()</b>. &#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089; 
&#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1094;&#1074;&#1077;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>isValidColor(&lt;<i>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;)</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, 
&#1077;&#1089;&#1083;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1099;&#1084; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
</p><div class="fon"><pre>
  <span class="tp">print</span>(QtGui.QColor.colorNames())  <span class="comm"># ['aliceblue', 'antiquewhite', ...] </span>
  <span class="tp">print</span>(QtGui.QColor.isValidColor(<span class="pech">"lightcyan"</span>))  <span class="comm"># True</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1095;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1086;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt: white, black, red, darkRed, green, darkGreen, blue, darkBlue, cyan, darkCyan, magenta, darkMagenta, yellow, darkYellow, gray, darkGray, lightGray, color0, color1</b> 
&#1080;&#1083;&#1080; <b>transparent</b> (&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;). &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; <b>color0</b> (&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;) &#1080; <b>color1</b> (&#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;) &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1076;&#1074;&#1091;&#1093;&#1094;&#1074;&#1077;&#1090;&#1085;&#1099;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1093;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  black = QtCore.Qt.black
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1103;&#1090;&#1086;&#1084; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1072; &#1096;&#1077;&#1089;&#1090;&#1086;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>RGB</b> <b>(Red, Green, Blue</b> - &#1082;&#1088;&#1072;&#1089;&#1085;&#1099;&#1081;, &#1079;&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;, &#1089;&#1080;&#1085;&#1080;&#1081;) &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>setNamedColor (&lt;<i>&#1057;&#1090;&#1088;&#1086;&#1082;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093; <b>"#RGB", "#RRGGBB",  "#AARRGGBB",  "#RRRGGGBBB",  "#RRRRGGGGBBBB",</b>  <b><i>"&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;  &#1094;&#1074;&#1077;&#1090;&#1072;"</i></b>  &#1080;&#1083;&#1080; <b>"transparent"</b> (&#1076;&#1083;&#1103; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072;);
<p align="JUSTIFY">
 </p></li><li> <b>name ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1077; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>"#RRGGBB"</b>;
<p align="JUSTIFY">
 </p></li><li> <b>name (&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1074;&#1086;&#1077;  &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;  &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;. 
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>: <b>HexRgb(0, <i>&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;</i> "#RRGGBB")</b> &#1080;&#1083;&#1080; 
<b>HexArgb(l, <i>&#1092;&#1086;&#1088;&#1084;&#1072;&#1090;</i> "#AARRGGBB")</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setRgb (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;[, alpha=255])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1088;&#1072;&#1089;&#1081;&#1086;&#1081;, &#1079;&#1077;&#1083;&#1077;&#1085;&#1086;&#1081; &#1080; &#1089;&#1080;&#1085;&#1077;&#1081; 
&#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>RGB</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; &#1086; &#1076;&#1086; 255. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>alpha</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; 
&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072;: &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091; &#1094;&#1074;&#1077;&#1090;&#1091;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 255 - &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>setRgb (&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)</b>  &#1080; <b>setRgba (&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; - &#1089;&#1086; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100;&#1102; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setRed (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;), setGreen (&lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;), setBlue (&lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;)</b> &#1080; <b>setAlpha (&lt;<i>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - 
&#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 255;
<p align="JUSTIFY">
 </p></li><li> <b>fromRgb (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;[, alpha=255])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QColor</b> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 255. 
&#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  white = QtGui.QColor.fromRgb(255, 255, 255, 255)
</pre></div>
 </li><li> <b>fromRgb (&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)</b> &#1080; <b>fromRgba (&lt;<i>&#1063;&#1080;&#1089;&#1083;&#1086;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> &#1089;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;, 
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1072;&#1084;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1093;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  white = QtGui.QColor.fromRgba(4294967295)
</pre></div>
 </li><li> <b>getRgb ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078; &#1080;&#1079; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; <b>(&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;, 
&lt;<i>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b>;
<p align="JUSTIFY">
 </p></li><li> <b>red (), green (), blue ()</b> &#1080; <b>alpha ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>rgb ()</b> &#1080; <b>rgba ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setRgbF (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;[, alpha=1.0])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082;&#1088;&#1072;&#1089;&#1085;&#1086;&#1081;, &#1079;&#1077;&#1083;&#1077;&#1085;&#1086;&#1081; &#1080; &#1089;&#1080;&#1085;&#1077;&#1081; 
&#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072; &#1084;&#1086;&#1076;&#1077;&#1083;&#1080; <b>RGB</b>. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0.0 &#1076;&#1086; 1.0. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>alpha</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1077;&#1087;&#1077;&#1085;&#1100; 
&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1080; &#1094;&#1074;&#1077;&#1090;&#1072;: &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 0.0 &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091; &#1094;&#1074;&#1077;&#1090;&#1091;, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; 1.0 - &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1077;&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1084;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>setRedF (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;), setGreenF (&lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;&gt;), setBlueF (&lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;)</b> &#1080; 
<b>setAlphaF(&lt;<i>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1102;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; 
&#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0.0 &#1076;&#1086; 1.0;
<p align="JUSTIFY">
 </p></li><li> <b>fromRgbF (&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;[, alpha=1.0])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QColor</b> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0.0 &#1076;&#1086; 1.0. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  white = QtGui.QColor.fromRgbF(1.0, 1.0, 1.0, 1.0)
</pre></div>
 </li><li> <b>getRgbF ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078; &#1080;&#1079; &#1095;&#1077;&#1090;&#1099;&#1088;&#1077;&#1093; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; <b>(&lt;<i>Kpac&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>3&#1077;&#1083;&#1077;&#1085;&#1099;&#1081;</i>&gt;, &lt;<i>&#1057;&#1080;&#1085;&#1080;&#1081;</i>&gt;, 
&lt;<i>&#1055;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b>;
<p align="JUSTIFY">
 </p></li><li> <b>redF (), greenF (), blueF ()</b> &#1080; <b>alphaF ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1074;&#1077;&#1097;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>lighter ([factor=l50])</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 100, &#1090;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1077;&#1090;&#1083;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 100 - &#1090;&#1086; &#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1077;&#1084;&#1085;&#1099;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>darker ([factor=200])</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1073;&#1086;&#1083;&#1100;&#1096;&#1077; 100, &#1090;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1090;&#1077;&#1084;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1100;&#1096;&#1077; 100 - &#1090;&#1086; &#1089; &#1073;&#1086;&#1083;&#1077;&#1077; &#1089;&#1074;&#1077;&#1090;&#1083;&#1099;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_177.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_179.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>