<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_090.html]
* At UTC datetime: [2023-08-19 09:58:01.110024]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 90.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1086;&#1082;&#1085;&#1072;&#1093;. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1090;&#1072;&#1082;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QFrame</b> &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1103;&#1077;&#1090; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b> &#1079;&#1072; &#1089;&#1095;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1084;&#1082;&#1080; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;, &#1074; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; 
&#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1084;&#1085;&#1086;&#1075;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1099;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1077; &#1087;&#1086;&#1083;&#1103; &#1080; &#1076;&#1088;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QFrame 
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFrame</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;:
</p><div class="fon"><pre>
 &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QFrame([parent=&lt;<i>Po&#1076;&#1080;&#1090;e&#1083;&#1100;</i>&gt;][, flags=&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;. 
&#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>flags</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1090;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;, &#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1080;&#1084;&#1077;&#1103; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089;&#1074;&#1086;&#1080;&#1084; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;, &#1085;&#1086; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080;&#1074;&#1103;&#1079;&#1072;&#1085; &#1082; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1102;. &#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; 
&#1084;&#1086;&#1076;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1082;&#1085;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;, &#1085;&#1086; &#1085;&#1077; &#1074;&#1089;&#1077; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1050;&#1072;&#1082;&#1080;&#1077; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>flags</b>, &#1084;&#1099; &#1091;&#1078;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; 
&#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_025.html" target="_blank">25 &#1096;&#1072;&#1075;&#1077;</a>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QFrame</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1090;&#1077; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qframe.html" target="_blank"><b>https://doc.qt.io/qt-5/qframe.html</b></a>):
</p><ul>
 <li> <b>setFrameShape (&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1088;&#1072;&#1084;&#1082;&#1080;. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFrame</b>:
<ul>
 <li> <b>NoFrame (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1077;&#1090; &#1088;&#1072;&#1084;&#1082;&#1080;;
 </li><li> <b>Box (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1072;&#1103; &#1088;&#1072;&#1084;&#1082;&#1072;;
 </li><li> <b>Panel (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1091;&#1082;&#1083;&#1086;&#1081; &#1080;&#1083;&#1080; &#1074;&#1086;&#1075;&#1085;&#1091;&#1090;&#1086;&#1081;;
 </li><li> <b>WinPanel (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074; &#1089;&#1090;&#1080;&#1083;&#1077; <b>Windows 2000</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1091;&#1082;&#1083;&#1086;&#1081; &#1080;&#1083;&#1080; &#1074;&#1086;&#1075;&#1085;&#1091;&#1090;&#1086;&#1081;. &#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; 2 &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;. &#1069;&#1090;&#1086;&#1090; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1076;&#1083;&#1103; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; 
&#1089;&#1086; &#1089;&#1090;&#1072;&#1088;&#1099;&#1084;&#1080; &#1074;&#1077;&#1088;&#1089;&#1080;&#1103;&#1084;&#1080; <b>Qt</b>;
 </li><li> <b>HLine (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100;;
 </li><li> <b>VLine (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1072;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1073;&#1077;&#1079; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1075;&#1086;;
 </li><li> <b>StyledPanel (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;, &#1074;&#1085;&#1077;&#1096;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1089;&#1090;&#1080;&#1083;&#1103;. &#1054;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1091;&#1082;&#1083;&#1086;&#1081; &#1080;&#1083;&#1080; &#1074;&#1086;&#1075;&#1085;&#1091;&#1090;&#1086;&#1081;. &#1069;&#1090;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1084;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072; &#1088;&#1072;&#1084;&#1082;&#1080; &#1076;&#1083;&#1103; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setFrameShadow (&lt;<i>Te&#1085;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1080;&#1083;&#1100; &#1090;&#1077;&#1085;&#1080;. &#1052;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFrame</b>:
<ul>
 <li> <b>Plain (<i>&#1080;&#1083;&#1080;</i> 16)</b> - &#1085;&#1077;&#1090; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1086;&#1074;;
 </li><li> <b>Raised (<i>&#1080;&#1083;&#1080;</i> 32)</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1087;&#1091;&#1082;&#1083;&#1086;&#1081;;
 </li><li> <b>Sunken (<i>&#1080;&#1083;&#1080;</i> 48)</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1086;&#1075;&#1085;&#1091;&#1090;&#1086;&#1081;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setFrameStyle (&lt;<i>C&#1090;&#1080;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1091; &#1088;&#1072;&#1084;&#1082;&#1080; &#1080; &#1089;&#1090;&#1080;&#1083;&#1100; &#1090;&#1077;&#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFrame</b> &#1095;&#1077;&#1088;&#1077;&#1079;
&#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  frame.setFrameStyle(QtWidgets.QFrame.Panel | QtWidgets.QFrame.Raised)
</pre></div>
 </li><li> <b>setLineWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1083;&#1080;&#1085;&#1080;&#1081; &#1091; &#1088;&#1072;&#1084;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setMidLineWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1081; &#1083;&#1080;&#1085;&#1080;&#1080; &#1091; &#1088;&#1072;&#1084;&#1082;&#1080;. &#1057;&#1088;&#1077;&#1076;&#1085;&#1103;&#1103; &#1083;&#1080;&#1085;&#1080;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1087;&#1091;&#1082;&#1083;&#1086;&#1089;&#1090;&#1080; &#1080; &#1074;&#1086;&#1075;&#1085;&#1091;&#1090;&#1086;&#1089;&#1090;&#1080; &#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; 
&#1092;&#1086;&#1088;&#1084; &#1088;&#1072;&#1084;&#1082;&#1080; <b>Box</b>, <b>HLine</b> &#1080; <b>VLine</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1089; &#1074;&#1082;&#1083;&#1072;&#1076;&#1082;&#1072;&#1084;&#1080;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_089.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_091.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>