<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_176.html]
* At UTC datetime: [2023-08-19 10:01:41.677193]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 176.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1074; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;, &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1085;&#1072;&#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1099;. &#1058;&#1086; &#1077;&#1089;&#1090;&#1100;, &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1082;&#1086;&#1075;&#1076;&#1072; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1084; (&#1074; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1088;&#1072;&#1079;, &#1087;&#1088;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080; &#1095;&#1072;&#1089;&#1090;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1088;&#1072;&#1085;&#1077;&#1077; &#1087;&#1077;&#1088;&#1077;&#1082;&#1088;&#1099;&#1090;&#1086;&#1081; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1086;&#1082;&#1085;&#1086;&#1084;, 
&#1080;&#1083;&#1080; &#1087;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;), &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>paintEvent()</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_058.html" target="_blank">58 &#1096;&#1072;&#1075;</a>). 
&#1042;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1077; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080; &#1080;&#1089;&#1082;&#1091;&#1089;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; - &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>repaint()</b> &#1080; 
<b>update()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>paintEvent()</b> &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1089; 
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPainter</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPainter</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1074;&#1089;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1075;&#1077;&#1086;&#1084;&#1077;&#1090;&#1088;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1092;&#1080;&#1075;&#1091;&#1088; 
&#1080; &#1074;&#1099;&#1074;&#1086;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; <b>QPaintDevice</b>. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; 
<b>QPaintDevice</b>. &#1042; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1074;&#1089;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100; 
&#1085;&#1072; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080; &#1083;&#1102;&#1073;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QPaintDevice</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; <b>QPicture, QPixmap, QImage, QPagedPaintDevice</b> &#1080; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPicture</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1084;&#1077;&#1090;&#1072;&#1092;&#1072;&#1081;&#1083;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1089;&#1095;&#1080;&#1090;&#1072;&#1090;&#1100; &#1080;&#1093; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1074;&#1086;&#1089;&#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; 
&#1085;&#1072; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089;&#1099; <b>QPixmap</b> &#1080; <b>QImage</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; 
&#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPagedPaintDevice</b> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QPrinter</b> (&#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1072; 
&#1087;&#1077;&#1095;&#1072;&#1090;&#1100;) &#1080; <b>QPdfWriter</b> (&#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1101;&#1082;&#1089;&#1087;&#1086;&#1088;&#1090;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; <b>PDF</b>-&#1092;&#1072;&#1081;&#1083;&#1099;). &#1052;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1080;&#1093; &#1087;&#1086;&#1079;&#1078;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1089;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1096;&#1072;&#1075;&#1072;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1074; &#1084;&#1086;&#1076;&#1091;&#1083;&#1077; <b>QtGui</b>, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>PyQt5</b> &#1090;&#1072;&#1082;&#1078;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; <b>SVG</b>-&#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081; &#1080; &#1074;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1074; &#1089;&#1074;&#1086;&#1081; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; 
&#1090;&#1077;&#1093;&#1085;&#1086;&#1083;&#1086;&#1075;&#1080;&#1080; <b>OpenGL</b>, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1086;&#1081; &#1076;&#1083;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1076;&#1074;&#1091;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1080; &#1090;&#1088;&#1077;&#1093;&#1084;&#1077;&#1088;&#1085;&#1086;&#1081; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1080;. &#1056;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1080;&#1093; 
&#1085;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1096;&#1072;&#1075;&#1080;, &#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1079;&#1072; &#1087;&#1086;&#1076;&#1088;&#1086;&#1073;&#1085;&#1086;&#1081; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; &#1085;&#1080;&#1093; &#1074;&#1072;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100;&#1089;&#1103; &#1082; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1089;&#1087;&#1086;&#1084;&#1086;&#1075;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_175.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_177.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>