<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_226.html]
* At UTC datetime: [2023-08-19 10:03:42.182291]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 226.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1099;&#1074;&#1086;&#1076; &#1074; &#1086;&#1082;&#1085;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsTextItem</b> &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  (QObject, QGraphicsItem) - QGraphicsObject - QGraphicsTextItem
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QGraphicsTextItem([parent=<span class="sl_sl">None</span>]) 
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QGraphicsTextItem(&lt;&#1058;&#1077;&#1082;&#1089;&#1090;&gt;[, parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsTextItem</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qgraphicstextitem.html" target="_blank"><b>https://doc.qt.io/qt-5/qgraphicstextitem.html</b></a>):
</p><ul>
 <li> <b>setPlainText (&lt;<i>&#1055;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>toPlainText ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>setHtml (&lt;HTML-<i>&#1082;&#1086;&#1076;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; <b>HTML</b>-&#1082;&#1086;&#1076;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>toHtml ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; <b>HTML</b>-&#1082;&#1086;&#1076;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setFont (&lt;QFont&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1096;&#1088;&#1080;&#1092;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>font ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1096;&#1088;&#1080;&#1092;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QFont</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDefaultTextColor (&lt;QColor&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>defaultTextColor ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setTextWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091;, &#1090;&#1086; &#1086;&#1085; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085; &#1085;&#1072; &#1085;&#1086;&#1074;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>textwidth ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1077;&#1084;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setDocument (&lt;QTextDocument&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextDocument</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_112.html" target="_balnk">112 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>document ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextDocument</b>; &#1089;&#1084;. (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_112.html" target="_balnk">112 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>setTextCursor (&lt;QTextCursor&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextCursor</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_114.html" target="_balnk">114 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>textCursor ()</b>   -   &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;   &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;   &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;   (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;   <b>QtextCursor </b>  - &#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_114.html" target="_balnk">114 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>setTextInteractionFlags (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1088;&#1077;&#1078;&#1080;&#1084; <b>NoTextInteraction</b>, &#1087;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; 
&#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;. &#1044;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1099; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_099.html" target="_balnk">99 &#1096;&#1072;&#1075;&#1077;</a> (&#1089;&#1084;. &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setTextInteractionFlags()</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setTabChangesFocus (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1090;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;. 
&#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Tab</b> &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setOpenExternalLinks (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1097;&#1077;&#1083;&#1095;&#1086;&#1082; &#1085;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1090; &#1082; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1102; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; 
&#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1080; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077; <b>URL</b>-&#1072;&#1076;&#1088;&#1077;&#1089;&#1086;&#1084;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; <b>TextBrowserInteraction</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsTextItem</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>linkActivated (&lt;URL&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1077; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; <b>URL</b>-&#1072;&#1076;&#1088;&#1077;&#1089; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
 </li><li> <b>linkHovered (&lt;URL&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1091;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; <b>URL</b>-&#1072;&#1076;&#1088;&#1077;&#1089; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1084; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;, &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1091;&#1102; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077;: &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081;. &#1053;&#1080;&#1078;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1080; &#1082;&#1086;&#1085;&#1077;&#1094; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1099; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080;):
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtGui
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QApplication, QMainWindow, QGraphicsScene, 
     QGraphicsView, QGraphicsItem, QGraphicsPixmapItem, QGraphicsTextItem
<span class="sl_sl">from</span> PyQt5.QtGui <span class="sl_sl">import</span> QPixmap, QPainter, QFont
<span class="sl_sl">from</span> PyQt5.Qt <span class="sl_sl">import</span> Qt
 
<span class="sl_sl">import</span> sys
 
<span class="sl_sl">class</span> <span class="vyvod">Window</span>(QMainWindow):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        <span class="tp">super</span>().__init__()
 
        self.title = <span class="pech">"&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; PyQt5"</span>
        self.top = 200
        self.left = 500
        self.width = 400
        self.height = 400
  
        self.setWindowTitle(self.title)
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1086;&#1082;&#1085;&#1072;</span>
        self.setGeometry(self.left, self.top, self.width, self.height)
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;</span>
        self.scene = QGraphicsScene()
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1076;&#1083;&#1103; &#1086;&#1090;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;</span>
        self.graphicView = QGraphicsView(self.scene, self)
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1089;&#1090;&#1086;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1089;&#1094;&#1077;&#1085;&#1099;</span>
        self.graphicView.setGeometry(0, 0, self.width, self.height)
        
    <span class="sl_sl">def</span> <span class="vyvod">plot</span>(self):
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; QPixmap</span>
        picture = QPixmap(<span class="pech">'IMG2.jpg'</span>)
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; "&#1087;&#1091;&#1089;&#1090;&#1086;&#1075;&#1086;" &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; QGraphicsPixmapItem</span>
        image = QGraphicsPixmapItem()
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; QGraphicsPixmapItem</span>
        image.setPixmap(picture)
        <span class="comm"># &#1055;&#1086;&#1079;&#1080;&#1094;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; QGraphicsPixmapItem</span>
        image.setOffset(0, 0)
        <span class="comm"># &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; QGraphicsPixmapItem &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;</span>
        self.scene.addItem(image)

        <span class="comm"># ======= &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; ===========</span>
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; QGraphicsTextItem</span>
        text = QGraphicsTextItem(<span class="pech">'&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;'</span>)
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1080; &#1077;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;</span>
        font = QFont(<span class="pech">'Courier New'</span>, pointSize=20, weight=900)
        <span class="comm"># &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1072; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;</span>
        text.setFont(font)
        <span class="comm"># ======= &#1050;&#1086;&#1085;&#1077;&#1094; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; =============</span>
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1080;&#1094;&#1080;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;</span>
        text.setX(0)
        text.setY(200)
        <span class="comm"># &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;</span>
        self.scene.addItem(text)
 
 
App = QApplication(sys.argv)
window = Window()
window.show() <span class="comm"># &#1044;&#1077;&#1084;&#1086;&#1085;&#1089;&#1090;&#1088;&#1072;&#1094;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072;</span>
window.plot() <span class="comm"># &#1055;&#1086;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1080;&#1077; &#1080; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1072; &#1086;&#1082;&#1085;&#1072;</span>

sys.exit(App.exec())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr226_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris226_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>

<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1075;&#1088;&#1091;&#1087;&#1087;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_225.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav12.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_227.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>