<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_159.html]
* At UTC datetime: [2023-08-19 10:00:56.583294]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 159.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1057;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; </i>QSqlDatabase</b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1081; &#1086;&#1090;&#1074;&#1077;&#1095;&#1072;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QSqlDatabase</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <b>addDatabase()</b> &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;:
</p><div class="fon"><pre>
  addDatabase(&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;
    [, connectionName=<span class="pech">"qt_sql_default_connection"</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;, &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1097;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1081; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099;: 
</p><ul>
 <li> <b>QMYSQL</b> &#1080; <b>QMYSQL3</b> (<b>MySQL</b>),
 </li><li> <b>QODBC</b> &#1080; <b>QODBC3</b> (<b>ODBC</b>),
 </li><li> <b>QPSQL</b> &#1080; <b>QPSQL7</b> (<b>PostgreSQL</b>) &#1080;
 </li><li> <b>QSQLITE</b> (<b>SQLite</b> &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 3).
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1099;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1080;&#1084;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;, &#1095;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1084;, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1089;&#1088;&#1072;&#1079;&#1091; &#1089; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1073;&#1072;&#1079;&#1072;&#1084;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1084;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; 
&#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086; &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; <b>addDatabase()</b> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlDatabase</b>, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1073;&#1072;&#1079;&#1099;, 
&#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1074;&#1096;&#1080;&#1089;&#1100; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080;&#1079; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1072;&#1083;&#1077;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>QSqlDatabase</b>:
</p><ul>
 <li> <b>setHostName (&lt;<i>&#1061;&#1086;&#1089;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1093;&#1086;&#1089;&#1090;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1072;&#1087;&#1086;&#1076;&#1086;&#1073;&#1080;&#1077; <b>MySQL</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setPort (&lt;<i>&#1053;&#1086;&#1084;&#1077;&#1088; &#1087;&#1086;&#1088;&#1090;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1086;&#1084;&#1077;&#1088; &#1087;&#1086;&#1088;&#1090;&#1072;, &#1095;&#1077;&#1088;&#1077;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1093;&#1086;&#1089;&#1090;&#1091;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1083;&#1080;&#1096;&#1100; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085; &#1085;&#1072; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1088;&#1090;&#1072;, &#1086;&#1090;&#1083;&#1080;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1090; &#1087;&#1086;&#1088;&#1090;&#1072; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setDatabaseName (&lt;<i>&#1048;&#1084;&#1103; &#1080;&#1083;&#1080; &#1087;&#1091;&#1090;&#1100; &#1082; &#1073;&#1072;&#1079;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; (&#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;), &#1087;&#1091;&#1090;&#1100; &#1082; &#1085;&#1077;&#1081; (&#1076;&#1083;&#1103; "&#1085;&#1072;&#1089;&#1090;&#1086;&#1083;&#1100;&#1085;&#1099;&#1093;" &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1090;&#1072;&#1082;&#1080;&#1093; &#1082;&#1072;&#1082; <b>SQLite</b>) &#1080;&#1083;&#1080; &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1085;&#1072;&#1073;&#1086;&#1088; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; (&#1077;&#1089;&#1083;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; <b>ODBC</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setUserName (&lt;<i>&#1048;&#1084;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1084;&#1103; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082; &#1073;&#1072;&#1079;&#1077;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>setPassword (&lt;<i>&#1055;&#1072;&#1088;&#1086;&#1083;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1086;&#1083;&#1100; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082; &#1073;&#1072;&#1079;&#1077;. &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>setConnectOptions (&lt;<i>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1073;&#1086;&#1088; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1076;&#1083;&#1103; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1103; &#1082; &#1073;&#1072;&#1079;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1053;&#1072;&#1073;&#1086;&#1088; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; 
&#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1077;&#1085; &#1074; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1080; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1091; <b>QSqlDatabase</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlDatabase</b>:
</p><ul>
 <li> <b>open ()</b> - &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1073;&#1072;&#1079;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
</p><hr><i>
&#160;&#160;&#160;<b><i><u>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</u>.</i></b> 
&#1055;&#1077;&#1088;&#1077;&#1076; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; <b>QApplication</b>). &#1045;&#1089;&#1083;&#1080; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, <b>PyQt</b> &#1085;&#1077; &#1089;&#1084;&#1086;&#1078;&#1077;&#1090; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1080;&#1090;&#1100; &#1076;&#1088;&#1072;&#1081;&#1074;&#1077;&#1088; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1073;&#1072;&#1079; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1080; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086;.
</i><p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1091;&#1078;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1072; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072; &#1076;&#1080;&#1089;&#1082;&#1077; &#1080;&#1083;&#1080; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1077;. &#1045;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086;&#1077; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; - &#1073;&#1072;&#1079;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; <b>SQLite</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103;, &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1077;&#1077; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1103;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;.
</p><hr>
 </li><li> <b>open (&lt;<i>&#1048;&#1084;&#1103;</i>&gt;, &lt;<i>&#1055;&#1072;&#1088;&#1086;&#1083;&#1100;</i>&gt;)</b> - &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1080; &#1087;&#1072;&#1088;&#1086;&#1083;&#1077;&#1084;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1073;&#1072;&#1079;&#1072; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isOpen ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1073;&#1072;&#1079;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1085;&#1072;&#1089;&#1090;&#1086;&#1103;&#1097;&#1077;&#1077; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isOpenError ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080; &#1087;&#1086;&#1087;&#1099;&#1090;&#1082;&#1077; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1080;&#1103; &#1073;&#1072;&#1079;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1080; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>transaction ()</b> - &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, 
&#1077;&#1089;&#1083;&#1080; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1087;&#1091;&#1097;&#1077;&#1085;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>commit ()</b> - &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; 
&#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>rollback ()</b> - &#1086;&#1090;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1102;, &#1077;&#1089;&#1083;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1078;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1072;&#1079;&#1099; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1080;, &#1090;&#1086; &#1085;&#1077; &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086;. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; 
&#1090;&#1088;&#1072;&#1085;&#1079;&#1072;&#1082;&#1094;&#1080;&#1103; &#1073;&#1099;&#1083;&#1072; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1086;&#1090;&#1084;&#1077;&#1085;&#1077;&#1085;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>lastError ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1077;&#1081; &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlError</b>;
<p align="JUSTIFY">
 </p></li><li> <b>connectionName ()</b> -  &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1089; &#1073;&#1072;&#1079;&#1086;&#1081; &#1080;&#1083;&#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; <b>qt_sql_default_connection</b> &#1076;&#1083;&#1103; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>tables ([type=Tables])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1073;&#1072;&#1079;&#1077;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>type</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1080;&#1087; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094; &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSql</b> &#1080;&#1083;&#1080; &#1080;&#1093; 
&#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |:
<ul>
 <li> <b>Tables (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;;
 </li><li> <b>SystemTables (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1083;&#1091;&#1078;&#1077;&#1073;&#1085;&#1099;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;;
 </li><li> <b>Views (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;;
 </li><li> <b>AllTables (<i>&#1080;&#1083;&#1080;</i> 255)</b> - &#1074;&#1089;&#1077; &#1074;&#1099;&#1096;&#1077;&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>record (&lt;<i>&#1048;&#1084;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1091;&#1088;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlRecord</b>, &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1085;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>primaryIndex (&lt;<i>&#1048;&#1084;&#1103; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099;</i>&gt;)</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1082;&#1083;&#1102;&#1095;&#1077;&#1074;&#1086;&#1084; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089;&#1077; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSqlIndex</b>, &#1080;&#1083;&#1080; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1099; &#1089; &#1090;&#1072;&#1082;&#1080;&#1084; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1085;&#1077;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>close ()</b> - &#1079;&#1072;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1073;&#1072;&#1079;&#1091; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_158.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav8.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_160.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>