<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_203.html]
* At UTC datetime: [2023-08-19 10:02:48.646181]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 203.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QGraphicsScene: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1080;&#1089;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1093;&#1089;&#1103; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1077;, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsScene</b>:
</p><ul>
 <li> <b>itemAt()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1074;&#1077;&#1088;&#1093;&#1085;&#1080;&#1081; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;, &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1077;&#1089;&#1083;&#1080; &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1090;&#1072;&#1084; &#1085;&#1077;&#1090;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  itemAt(&lt;X&gt;, &lt;Y&gt;, &lt;QTransform&gt;) 
  itemAt(&lt;QPointF&gt;, &lt;QTransform&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1088;&#1077;&#1090;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082; &#1089;&#1094;&#1077;&#1085;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_191.html" target="_blank">191 &#1096;&#1072;&#1075;</a>). &#1045;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1077; 
&#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTransform</b>;
</p><p align="JUSTIFY">
 </p></li><li>  <b>&#1089;&#1086;llidingItems (&lt;QGraphicsItem&gt;[, mode=IntersectsItemShape])</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1074; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1080;&#1083;&#1080; 
&#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1085;&#1080;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1085;&#1077;&#1090;, &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>mode</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086;&#1080;&#1089;&#1082;&#1072; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1080; &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1079;&#1072;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; 
&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
<ul>
 <li> <b>ContainsItemShape (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1080;&#1097;&#1091;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1095;&#1100;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;;
 </li><li> <b>IntersectsItemShape (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1097;&#1091;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1095;&#1100;&#1080; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1077;&#1075;&#1086; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077;&#1081;;
 </li><li> <b>ContainsItemBoundingRect (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1080;&#1097;&#1091;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;), &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;;
 </li><li> <b>IntersectsItemBoundingRect(<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1080;&#1097;&#1091;&#1090;&#1089;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080; (&#1090;&#1086; &#1077;&#1089;&#1090;&#1100; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1101;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1102;&#1090;&#1089;&#1103;  &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;),  &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; 
&#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103;  &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1080;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1089;&#1077;&#1082;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1077;&#1075;&#1086; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li>  <b>items ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089;&#1086; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; &#1085;&#1072; &#1074;&#1089;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;&#1083;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;, &#1080;&#1083;&#1080; &#1085;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;. &#1045;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; 
&#1085;&#1077;&#1090;, &#1090;&#1086; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  items()
  items([order=DescendingOrder])
  items(&lt;QPointF&gt;[, mode=IntersectsltemShape][, order=DescendingOrder][,
    deviceTransform=QTransform()]) 
  items(&lt;X&gt;, &lt;Y&gt;, &lt;&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;&gt;, &lt;&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;&gt;[, mode=IntersectsItemShape][,
    order=DescendingOrder][, deviceTransform=QTransform()]) 
  items (&lt;QRectF&gt;[, mode=IntersectsItemShape][, order=DescendingOrder] [,
    deviceTransfom=QTransform()])
  items(&lt;QPolygonF&gt;[, mode=lntersectsltemShape][, order=DescendingOrder][,
    deviceTransfom=QTransform()]) 
  items(&lt;QPainterPath&gt;[, mode=IntersectsItemShape][, order=DescendingOrder][,
    deviceTransform=QTransform()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>order</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1077;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1089;&#1086;&#1088;&#1090;&#1080;&#1088;&#1086;&#1074;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; <b>AscendingOrder</b> (&#1074; &#1072;&#1083;&#1092;&#1072;&#1074;&#1080;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;) &#1080;&#1083;&#1080; <b>DescendingOrder</b> (&#1074; &#1086;&#1073;&#1088;&#1072;&#1090;&#1085;&#1086;&#1084; &#1087;&#1086;&#1088;&#1103;&#1076;&#1082;&#1077;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>mode</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
</p><ul>
 <li> <b>ContainsItemShape (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1087;&#1072;&#1076;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1074;&#1089;&#1077; &#1090;&#1086;&#1095;&#1082;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
 </li><li> <b>IntersectsItemShape (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1087;&#1072;&#1076;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1083;&#1102;&#1073;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;;
 </li><li> <b>ContainsItemBoundingRect (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1087;&#1072;&#1076;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1080;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
 </li><li> <b>IntersectsItemBoundingRect(<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1087;&#1072;&#1076;&#1077;&#1090; &#1074; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;, &#1077;&#1089;&#1083;&#1080; &#1083;&#1102;&#1073;&#1072;&#1103; &#1090;&#1086;&#1095;&#1082;&#1072; &#1086;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072; &#1087;&#1086;&#1087;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>deviceTransform</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1077; &#1082; &#1089;&#1094;&#1077;&#1085;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090; (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_191.html" target="_blank">191 &#1096;&#1072;&#1075;</a>). &#1045;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;, 
&#1077;&#1089;&#1083;&#1080; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1077; &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099;, &#1080;&#1075;&#1085;&#1086;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
</p></li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089;&#1086;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_202.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav11.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_204.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>