<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_025.html]
* At UTC datetime: [2023-08-19 09:55:06.163451]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 25.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1090;&#1080;&#1087;&#1072; &#1086;&#1082;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1090;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072; </i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b> &#1086;&#1082;&#1085;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082;, &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1082;&#1086;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;, &#1090;&#1077;&#1082;&#1089;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; 
<b><i>&#1057;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b>, <b><i>&#1056;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1090;&#1080;&#1087; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setWindowFiags()</b> &#1080;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>flags</b> &#1074; 
&#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, &#1095;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setWindowFiags()</b> &#1076;&#1086;&#1083;&#1078;&#1077;&#1085; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1082;&#1085;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  setWindowFiags (&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1058;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072;</i>&gt;</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
</p><ul>
 <li> <b>Widget</b> - &#1090;&#1080;&#1087; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>;
 </li><li> <b>Window</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086;&#1084;, &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086; &#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1085; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1054;&#1082;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; 
<b><i>&#1057;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b>, <b><i>&#1056;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1055;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>Dialog</b> - &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b><i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089; 
&#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072; &#1076;&#1083;&#1103; &#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;: <b>window.setWindowFlags(QtCore.Qt.Dialog)</b>;
 </li><li> <b>Sheet</b> &#1080; <b>Drawer</b> - &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1090;&#1080;&#1083;&#1077; <b>Apple Macintosh</b>;
 </li><li> <b>Popup</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1084;&#1077;&#1085;&#1102;. &#1054;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1088;&#1072;&#1084;&#1082;&#1080; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072; &#1080;, &#1082;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1077;&#1085;&#1100;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;;
 </li><li> <b>Tool</b> - &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084; (&#1084;&#1077;&#1085;&#1100;&#1096;&#1077;&#1084; &#1087;&#1086; &#1074;&#1099;&#1089;&#1086;&#1090;&#1077;, &#1095;&#1077;&#1084; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;), &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1072; 
&#1082;&#1085;&#1086;&#1087;&#1082;&#1072; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>ToolTip</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1091;&#1102; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1091;. &#1054;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1088;&#1072;&#1084;&#1082;&#1080; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;;
 </li><li> <b>splashScreen</b> - &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1079;&#1072;&#1089;&#1090;&#1072;&#1074;&#1082;&#1091;. &#1054;&#1085;&#1086; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1077;&#1079; &#1088;&#1072;&#1084;&#1082;&#1080; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; 
&#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1076;&#1083;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSplashScreen</b>;
 </li><li> <b>Desktop</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1088;&#1072;&#1073;&#1086;&#1095;&#1080;&#1081; &#1089;&#1090;&#1086;&#1083;. &#1054;&#1085;&#1086; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;;
 </li><li> <b>SubWindow</b> - &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1086;&#1090; &#1090;&#1086;&#1075;&#1086;, &#1080;&#1084;&#1077;&#1077;&#1090; &#1086;&#1085; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; &#1080;&#1083;&#1080; &#1085;&#1077;&#1090;. &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1085;&#1086; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084; (&#1084;&#1077;&#1085;&#1100;&#1096;&#1080;&#1084; &#1087;&#1086; 
&#1074;&#1099;&#1089;&#1086;&#1090;&#1077;, &#1095;&#1077;&#1084; &#1091; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;), &#1085;&#1086; &#1073;&#1077;&#1079; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;;
 </li><li> <b>ForeignWindow</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1086; &#1076;&#1088;&#1091;&#1075;&#1080;&#1084; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1086;&#1084;;
 </li><li> <b>CoverWindow</b> - &#1086;&#1082;&#1085;&#1086;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1077;&#1077; &#1084;&#1080;&#1085;&#1080;&#1084;&#1080;&#1079;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1086;&#1073;&#1080;&#1083;&#1100;&#1085;&#1099;&#1093; &#1087;&#1083;&#1072;&#1090;&#1092;&#1086;&#1088;&#1084;&#1072;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1090;&#1080;&#1087; &#1086;&#1082;&#1085;&#1072; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>windowType()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1086;&#1082;&#1086;&#1085; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; <b>|</b> &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b> (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1080;&#1097;&#1080;&#1090;&#1077; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;):
</p><ul>
 <li> <b>MSWindowsFixedSizeDialogHint</b> - &#1079;&#1072;&#1087;&#1088;&#1077;&#1097;&#1072;&#1077;&#1090; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1086;&#1082;&#1085;&#1072;. &#1050;&#1085;&#1086;&#1087;&#1082;&#1072; <b><i>&#1056;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b> &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072; &#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1089;&#1103; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1081;;
<p align="JUSTIFY">
 </p></li><li> <b>FramelessWindowHint</b> - &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1088;&#1072;&#1084;&#1082;&#1091; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1086;&#1082;&#1085;&#1072;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>NoDropShadowWindowHint</b> - &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1086;&#1090;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1091;&#1102; &#1086;&#1082;&#1085;&#1086;&#1084; &#1090;&#1077;&#1085;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>customizeWindowHint</b> - &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1088;&#1072;&#1084;&#1082;&#1091; &#1080; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1086;&#1082;&#1085;&#1072;, &#1085;&#1086; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1101;&#1092;&#1092;&#1077;&#1082;&#1090; &#1086;&#1073;&#1098;&#1077;&#1084;&#1085;&#1086;&#1089;&#1090;&#1080;. &#1056;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100;;
<p align="JUSTIFY">
 </p></li><li> <b>windowTitieHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1086;&#1082;&#1085;&#1072;. &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1084; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1086;&#1082;&#1085;&#1086; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072; &#1089; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1086;&#1084;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;: 
<div class="fon"><pre>
  window.setWindowFlags(QtCore.Qt.Window |
                        QtCore.Qt.FramelessWindowHint | 
                        QtCore.Qt.WindowTitleHint)
</pre></div>
 </li><li> <b>WindowS&#1091;stemMenuHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1086;&#1082;&#1086;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowMinimizeButtonHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1057;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowMaximizeButtonHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1056;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowMinMaxButtonsHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; <b><i>&#1057;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b> &#1080; <b><i>&#1056;&#1072;&#1079;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowCloseButtonHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowContextHelpButtonHint</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</i></b>;
<p align="JUSTIFY">
 </p></li><li> <b>WindowStaysOnTopHint</b> - &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093; &#1074;&#1089;&#1077;&#1093; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1082;&#1086;&#1085;;
<p align="JUSTIFY">
 </p></li><li> <b>WindowStaysOnBottomHint</b> - &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1090; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1095;&#1090;&#1086; &#1086;&#1082;&#1085;&#1086; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1086; &#1087;&#1086;&#1079;&#1072;&#1076;&#1080; &#1074;&#1089;&#1077;&#1093; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1086;&#1082;&#1086;&#1085;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1077; &#1092;&#1083;&#1072;&#1075;&#1080; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>windowFlags()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1086;&#1074; &#1086;&#1082;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_024.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif">
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_026.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>