<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_196.html]
* At UTC datetime: [2023-08-19 10:02:31.789094]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 196.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;. &#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089; QImage
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QImage</b> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;&#1084;&#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;-&#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1084; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  QPaintDevice - QImage
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QImage</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPaintDevice</b>, &#1084;&#1099; &#1084;&#1086;&#1078;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1082;&#1072;&#1082; &#1087;&#1086;&#1074;&#1077;&#1088;&#1093;&#1085;&#1086;&#1089;&#1090;&#1100; &#1076;&#1083;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; 
&#1091;&#1095;&#1080;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1085;&#1077; &#1085;&#1072; &#1074;&#1089;&#1077;&#1093; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086;    &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1090;&#1100;, -    &#1076;&#1083;&#1103;    &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;    &#1083;&#1091;&#1095;&#1096;&#1077;    &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;    &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;    &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; 
<b>Format_ARGB32_Premultiplied</b>. &#1042;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>drawImage()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPainter</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_190.html" target="_blank">190 &#1096;&#1072;&#1075;</a>).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QImage()
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QImage(&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;, &lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QImage(&lt;QSize&gt;, &lt;&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QImage(&lt;<i>&#1055;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;</i>&gt;[, &lt;<i>&#1058;&#1080;&#1087; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</i>&gt;])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QImage(&lt;QImage&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080; &#1090;&#1088;&#1077;&#1090;&#1080;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; - &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1088;&#1072;&#1074;&#1085;&#1099; &#1085;&#1091;&#1083;&#1102;, 
&#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;. &#1063;&#1077;&#1090;&#1074;&#1077;&#1088;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; &#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1080;&#1087; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; - &#1077;&#1089;&#1083;&#1080; 
&#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085; &#1087;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1102; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1055;&#1103;&#1090;&#1099;&#1081; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1087;&#1080;&#1102; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b> (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qimage.html#Format-enum" target="_blank"><b>https://doc.qt.io/qt-5/qimage.html#Format-enum</b></a>):
</p><ul>
 <li> <b>Format_Invalid (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1077;&#1074;&#1077;&#1088;&#1085;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;;
 </li><li> <b>Format_Mono (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 1 &#1073;&#1080;&#1090;;
 </li><li> <b>Format_MonoLSB (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 1 &#1073;&#1080;&#1090;;
 </li><li> <b>Format_Indexed8 (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 8 &#1073;&#1080;&#1090;&#1086;&#1074;;
 </li><li> <b>Format_RGB32 (<i>&#1080;&#1083;&#1080;</i> 4)</b> - <b>RGB</b> &#1073;&#1077;&#1079; &#1072;&#1083;&#1100;&#1092;&#1072;-&#1082;&#1072;&#1085;&#1072;&#1083;&#1072;, &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 32 &#1073;&#1080;&#1090;&#1072;;
 </li><li> <b>Format_ARGB32 (<i>&#1080;&#1083;&#1080;</i> 5)</b> - <b>RGB</b> &#1089; &#1072;&#1083;&#1100;&#1092;&#1072;-&#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1084;, &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 32 &#1073;&#1080;&#1090;&#1072;;
 </li><li> <b>Fomat_ARGB32_Premultiplied (<i>&#1080;&#1083;&#1080;</i> 6)</b> - <b>RGB</b> &#1089; &#1072;&#1083;&#1100;&#1092;&#1072;-&#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1084;, &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; 32 &#1073;&#1080;&#1090;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1083;&#1091;&#1095;&#1096;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1076;&#1083;&#1103; &#1088;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QImage</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1083;&#1080;&#1096;&#1100; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qimage.html" target="_blank"><b>https://doc.qt.io/qt-5/qimage.html</b></a>):
</p><ul>
 <li> <b>isNull ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1089;&#1090;&#1099;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li><b> l&#1086;&#1072;d (&lt;<i>&#1055;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;</i>&gt;[, format=None])</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1099;&#1081; &#1080;&#1083;&#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;. &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; 
&#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>loadFromData (&lt;QByteArray&gt;[, fomat=None])</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QByteArray</b>. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1090;&#1080;&#1087; <b>bytes</b>. &#1042;&#1086; 
&#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1080;&#1087; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>"PNG"</b>). &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>fromData (&lt;QByteArray&gt; [, format=None])</b> - &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QByteArray</b>. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;, &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1077; &#1090;&#1080;&#1087; <b>bytes</b>. &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; 
&#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1080;&#1087; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>"PNG"</b>). &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>save (&lt;<i>&#1055;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;</i>&gt;[, format=None] [, quality=-1])</b> - &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1092;&#1072;&#1081;&#1083;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1099;&#1081; &#1080;&#1083;&#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;. &#1042;&#1086; &#1074;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; 
&#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; - &#1077;&#1089;&#1083;&#1080; &#1086;&#1085; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072;. &#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>quality</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1074; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1077; &#1086;&#1090; 0 &#1076;&#1086; 100. 
&#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1086;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>fill (&lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;)</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1079;&#1072;&#1083;&#1080;&#1074;&#1082;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1084; &#1094;&#1074;&#1077;&#1090;&#1086;&#1084;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1094;&#1074;&#1077;&#1090;&#1072; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QtCcore.Qt.white</b>), &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> &#1080;&#1083;&#1080; 
&#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <b>rgb()</b> &#1080; <b>rgba()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
<div class="fon"><pre>
  img.fill(QtCore.Qt.red)
  img.fill(QtGui.QColor(<span class="pech">"#ff0000"</span>))
  img.fill(QtGui.QColor(<span class="pech">"#ff0000"</span>).rgb())
</pre></div>
 </li><li> <b>width ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>height ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>size ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QSize</b> &#1089; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>rect ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRect</b> &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1074;&#1072;&#1102;&#1097;&#1077;&#1081; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>depth ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1075;&#1083;&#1091;&#1073;&#1080;&#1085;&#1091; &#1094;&#1074;&#1077;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>format ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1089;&#1084;. &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;</b> &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setPixel ()</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1094;&#1074;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  setPixel(&lt;&#1061;&gt;, &lt;&#1059;&gt;, &lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1080;&#1083;&#1080; &#1094;&#1074;&#1077;&#1090;</i>&gt;) 
  setPixel(&lt;QPoint&gt;, &lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1080;&#1083;&#1080; &#1094;&#1074;&#1077;&#1090;</i>&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1048;&#1085;&#1076;&#1077;&#1082;&#1089; &#1080;&#1083;&#1080; &#1094;&#1074;&#1077;&#1090;</i>&gt;</b> &#1076;&#1083;&#1103; 8-&#1073;&#1080;&#1090;&#1085;&#1099;&#1093; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1080;&#1085;&#1076;&#1077;&#1082;&#1089; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1077;, &#1072; &#1076;&#1083;&#1103; 32-&#1073;&#1080;&#1090;&#1085;&#1099;&#1093; - &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; 
<b>rgb()</b> &#1080; <b>rgba()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>;
</p><p align="JUSTIFY">
 </p></li><li> <b>pixel ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1094;&#1074;&#1077;&#1090;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;. &#1069;&#1090;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1091; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1088;&#1072;&#1079;&#1083;&#1080;&#1095;&#1085;&#1099;&#1093; 
&#1089;&#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1093; &#1094;&#1074;&#1077;&#1090;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  pixel(&lt;X&gt;, &lt;Y&gt;) 
  pixel(&lt;QPoint&gt;)
</pre></div>
 </li><li> <b>convertToFormat ()</b> -   &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1091;&#1077;&#1090;   &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;   &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;   (&#1089;&#1084;.   &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103;   &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;</b> &#1074; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>) &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1086;&#1074;&#1099;&#1081; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  convertToFormat(&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;[, flags=AutoColor])
  convertToFormat(&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;</i>&gt;, &lt;<i>&#1058;&#1072;&#1073;&#1083;&#1080;&#1094;&#1072; &#1094;&#1074;&#1077;&#1090;&#1086;&#1074;</i>&gt;[, flags=AutoColor])
</pre></div>
 </li><li> <b>copy ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b> &#1089; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;&#1086;&#1084; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>rect</b> &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  copy([rect=QRect()])
  copy(&lt;&#1061;&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;)
</pre></div>
 </li><li> <b>scaled ()</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  scaled(&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;,  &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;[, aspectRatioMode=IgnoreAspectRatio][,
    transformMode=FastTransformation]) 
  scaled(&lt;QSize&gt;[, aspectRatioMode=IgnoreAspectRatio][, 
      transformMode=FastTransformation])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>aspectRatioMode</b> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
</p><ul>
 <li> <b>IgnoreAspectRatio (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1073;&#1077;&#1079; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;;
 </li><li> <b>KeepAspectRatio (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1077;&#1079;&#1072;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1085;&#1086;&#1081;;
 </li><li> <b>KeepAspectRatioByExpanding (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1089; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1095;&#1072;&#1089;&#1090;&#1100; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1081;&#1090;&#1080; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1077;&#1075;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>transformMode</b> &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
</p><ul>
 <li> <b>FastTransformation (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1099;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;;
 </li><li> <b>SmoothTransformation (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1089;&#1075;&#1083;&#1072;&#1078;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1086;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>scaledToWidth (&lt;<i>I&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;[, mode=FastTransformation])</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1042;&#1099;&#1089;&#1086;&#1090;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>mode</b> &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; <b>transformMode</b> &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>scaled()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>scaledToHeight (&lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;[,  mode=FastTransformation])</b> - &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1064;&#1080;&#1088;&#1080;&#1085;&#1072; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; 
&#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1087;&#1086;&#1088;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>mode</b> &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; <b>transforrnMode</b> &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>scaled()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>transformed (&lt;QTransform&gt;[,  mode=FastTransformation])</b> - &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1090;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1087;&#1086;&#1074;&#1086;&#1088;&#1086;&#1090;) &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. 
&#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;. &#1058;&#1088;&#1072;&#1085;&#1089;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTransform</b>. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>mode</b> &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; <b>transformMode</b> &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>scaled()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>invertPixeis ([mode=invertRgb])</b> - &#1080;&#1085;&#1074;&#1077;&#1088;&#1090;&#1080;&#1088;&#1091;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1077;&#1081; &#1074; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080;. &#1042; &#1085;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>mode</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>InvertRgb</b> &#1080;&#1083;&#1080; <b>InvertRgba</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>;
<p align="JUSTIFY">
 </p></li><li> <b>mirrored ([horizontal=False][, vertical=True])</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1079;&#1077;&#1088;&#1082;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1079; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QImage</b>. &#1048;&#1089;&#1093;&#1086;&#1076;&#1085;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QIcon</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_195.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav10.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_197.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>