<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_237.html]
* At UTC datetime: [2023-08-19 10:04:10.467056]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 237.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1091;&#1095;&#1072;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089; &#1101;&#1090;&#1086;&#1084;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080; &#1089;&#1073;&#1088;&#1086;&#1089;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1089;&#1086;&#1086;&#1073;&#1097;&#1080;&#1090;&#1100; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;, &#1095;&#1090;&#1086; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1093; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>setAcceptDrops()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsItem</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1074; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;:
</p><ul>
 <li> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>dragEnterEvent()</b>   &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; <b>MIME</b>-&#1090;&#1080;&#1087; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;. &#1045;&#1089;&#1083;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1073;&#1088;&#1086;&#1089; &#1101;&#1090;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; 
&#1087;&#1088;&#1077;&#1076;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>acceptProposedAction()</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;. &#1045;&#1089;&#1083;&#1080; &#1085;&#1091;&#1078;&#1085;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <b>setDropAction()</b> &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; 
&#1085;&#1086;&#1074;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1091; &#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>accept()</b> &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>acceptProposedAction()</b>;
 </li><li> &#1077;&#1089;&#1083;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1080;&#1090;&#1100; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1095;&#1072;&#1089;&#1090;&#1082;&#1086;&#1084; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1074; &#1085;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <b>dragMoveEvent()</b>. &#1069;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1086; 
&#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1055;&#1088;&#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1080; &#1089;&#1086; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1091; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>accept()</b>;
 </li><li> &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>dropEvent()</b> &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1073;&#1088;&#1086;&#1089;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1102;&#1097;&#1080;&#1077; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;:
</p><ul>
 <li> <b>dragEnterEvent (self, &lt;event&gt;)</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsSceneDragDropEvent</b>;
<p align="JUSTIFY">
 </p></li><li> <b>dragLeaveEvent (self, &lt;event&gt;)</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1082;&#1086;&#1075;&#1076;&#1072; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1086;&#1082;&#1080;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsSceneDragDropEvent</b>;
<p align="JUSTIFY">
 </p></li><li> <b>dragMoveEvent (self, &lt;event&gt;)</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;  &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086;  &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsSceneDragDropEvent</b>;
<p align="JUSTIFY">
 </p></li><li> <b>dropEvent (self, &lt;event&gt;)</b> - &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;. &#1063;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;event&gt;</b> &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGraphicsSceneDragDropEvent</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsSceneDragDropEvent</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; <b>QGraphicsSceneEvent</b> &#1080; <b>QEvent</b> &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;:
</p><ul>
 <li> <b>mimeData ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMimeData</b> &#1089; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080; &#1080; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1077;&#1081; &#1086; <b>MIME</b>-&#1090;&#1080;&#1087;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>pos ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPointF</b> &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>scenePos ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPointF</b> &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1089;&#1094;&#1077;&#1085;&#1099;;
<p align="JUSTIFY">
 </p></li><li> <b>screenPos ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPoint</b> &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1074; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1093; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>possibleActions ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081; &#1087;&#1088;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>proposedAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1087;&#1088;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>acceptProposedAction ()</b> - &#1087;&#1086;&#1076;&#1090;&#1074;&#1077;&#1088;&#1078;&#1076;&#1072;&#1077;&#1090; &#1075;&#1086;&#1090;&#1086;&#1074;&#1085;&#1086;&#1089;&#1090;&#1100; &#1087;&#1088;&#1080;&#1085;&#1103;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1077;&#1084;&#1099;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080; &#1089;&#1086;&#1075;&#1083;&#1072;&#1089;&#1080;&#1077; &#1089; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>proposedAction()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDropAction (&lt;<i>&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;</i>&gt;)</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090; &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1087;&#1088;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;. &#1055;&#1086;&#1089;&#1083;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>accept()</b>, &#1072; &#1085;&#1077; <b>acceptProposedAction()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>dropAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1076;&#1086;&#1083;&#1078;&#1085;&#1086; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1087;&#1088;&#1080; &#1089;&#1073;&#1088;&#1072;&#1089;&#1099;&#1074;&#1072;&#1085;&#1080;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>buttons ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1074;&#1089;&#1077;&#1093; &#1082;&#1085;&#1086;&#1087;&#1086;&#1082; &#1084;&#1099;&#1096;&#1080;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1099;&#1093; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>modifiers ()</b> -   &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;   &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102;   &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081;   &#1074;&#1089;&#1077;&#1093;   &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;-&#1084;&#1086;&#1076;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088;&#1086;&#1074; (<b>Shift</b>, <b>Ctrl</b>, <b>Alt</b> &#1080; &#1076;&#1088;.), &#1095;&#1090;&#1086; &#1073;&#1099;&#1083;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1099; &#1074; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1077; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>source ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; (&#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;: <a href="http://python-3.ru/page/pyqt5-drag-drop" target="_blank"><b>http://python-3.ru/page/pyqt5-drag-drop</b></a>): &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; 
&#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080;&#1079; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080; &#1087;&#1086;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084; &#1077;&#1075;&#1086; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;. &#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1089;&#1103;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1086;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QPushButton, QWidget, QLineEdit, QApplication
 
<span class="sl_sl">class</span> <span class="vyvod">Button</span>(QPushButton):
  
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, title, parent):
        <span class="tp">super</span>().__init__(title, parent)
        self.setAcceptDrops(<span class="sl_sl">True</span>)
        
    <span class="sl_sl">def</span> <span class="vyvod">dragEnterEvent</span>(self, e):
        <span class="sl_sl">if</span> e.mimeData().hasFormat(<span class="pech">'text/plain'</span>):
            e.accept()
        <span class="sl_sl">else</span>:
            e.ignore() 
    <span class="sl_sl">def</span> <span class="vyvod">dropEvent</span>(self, e):
        self.setText(e.mimeData().text()) 
 
<span class="sl_sl">class</span> <span class="vyvod">Example</span>(QWidget):
  
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        <span class="tp">super</span>().__init__()
        self.initUI()
        
    <span class="sl_sl">def</span> <span class="vyvod">initUI</span>(self):
        edit = QLineEdit(<span class="pech">''</span>, self)
        edit.setDragEnabled(<span class="sl_sl">True</span>)
        edit.move(30, 65)
        button = Button(<span class="pech">"Button"</span>, self)
        button.move(190, 65)
        
        self.setWindowTitle(<span class="pech">'&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; drag &amp; drop'</span>)
        self.setGeometry(300, 300, 300, 150)
 
app = QApplication(sys.argv)
ex = Example()
ex.show()
app.exec_()
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr237_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;:
</p><p align="CENTER"><img src="images/ris237_1.gif"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1080;&#1088;&#1091;&#1077;&#1084; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; (&#1074;&#1080;&#1076;&#1078;&#1077;&#1090;) <b>QPushButton</b>, &#1084;&#1099; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1089;&#1086;&#1079;&#1076;&#1072;&#1105;&#1084; &#1085;&#1072;&#1096; &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; 
<b>Button</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPushButton</b>:
</p><div class="fon"><pre>
<span class="sl_sl">class</span> <span class="vyvod">Button</span>(QPushButton):
  
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, title, parent):
        <span class="tp">super</span>().__init__(title, parent)
        self.setAcceptDrops(<span class="sl_sl">True</span>)
    .    .   .    .
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1077;&#1083;&#1072;&#1077;&#1084; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1084;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1072;:
</p><div class="fon"><pre>
        self.setAcceptDrops(<span class="sl_sl">True</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076; <b>dragEnterEvent()</b>, &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1103; &#1086; &#1090;&#1080;&#1087;&#1077; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1072;&#1077;&#1084; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1090;&#1100;. &#1042; &#1085;&#1072;&#1096;&#1077;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1101;&#1090;&#1086; &#1086;&#1073;&#1099;&#1095;&#1085;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090;:
</p><div class="fon"><pre>
    <span class="sl_sl">def</span> <span class="vyvod">dragEnterEvent</span>(self, e):
        <span class="sl_sl">if</span> e.mimeData().hasFormat(<span class="pech">'text/plain'</span>):
            e.accept()
        <span class="sl_sl">else</span>:
            e.ignore() 
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1091;&#1090;&#1105;&#1084; &#1087;&#1077;&#1088;&#1077;&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>dropEvent()</b>, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1047;&#1076;&#1077;&#1089;&#1100; &#1084;&#1077;&#1085;&#1103;&#1077;&#1084; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077;:
</p><div class="fon"><pre>
    <span class="sl_sl">def</span> <span class="vyvod">dropEvent</span>(self, e):
        self.setText(e.mimeData().text()) 
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1080;&#1076;&#1078;&#1077;&#1090; <b>QLineEdit</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1091;&#1102; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1091; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1081; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042;&#1089;&#1077;, &#1095;&#1090;&#1086; &#1085;&#1091;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, - &#1101;&#1090;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setDragEnabled()</b>, &#1095;&#1090;&#1086;&#1073;&#1099; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1077;&#1105;:
</p><div class="fon"><pre>
        edit = QLineEdit(<span class="pech">''</span>, self)
        edit.setDragEnabled(<span class="sl_sl">True</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1092;&#1080;&#1083;&#1100;&#1090;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_236.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_238.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>