<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_274.html]
* At UTC datetime: [2023-08-19 10:05:48.763503]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 274.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; SDI- &#1080; MDI-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1052;&#1077;&#1085;&#1102;. &#1050;&#1083;&#1072;&#1089;&#1089; QMenu
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMenu</b> &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077;, &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;. &#1045;&#1075;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QMenu
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMenu</b>:
</p><div class="fon"><pre>
  &lt;&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&gt; = QMenu([parent=<span class="sl_sl">None</span>])
  &lt;&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&gt; = QMenu(&lt;&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&gt;[, parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&gt;</b> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; 
&#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1081;, &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1073;&#1091;&#1076;&#1077;&#1090;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; 
&#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;. &#1055;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Alt</b> &#1080; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1084;&#1077;&#1085;&#1102; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; 
&#1089;&#1072;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1077;&#1075;&#1086; &#1091;&#1076;&#1074;&#1086;&#1080;&#1090;&#1100;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1091;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QMenu</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1088;&#1103;&#1076; &#1089;&#1074;&#1086;&#1080;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; 
&#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qmenu.html" target="_blank"><b>https://doc.qt.io/qt-5/qmenu.html</b></a>):
</p><ul>
 <li> <b>addAction ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074; &#1084;&#1077;&#1085;&#1102;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
<div class="fon"><pre>
  addAction(&lt;QAction&gt;)
  addAction(&lt;<i>Ha&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)                                      -&gt; QAction
  addAction(&lt;QIcon&gt;, &lt;&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&gt;)                             -&gt; QAction
  addAction(&lt;<i>Ha&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;, &lt;<i>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;</i>&gt;[, &lt;shortcut&gt;])          -&gt; QAction
  addAction(&lt;QIcon&gt;, &lt;<i>Ha&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;, &lt;<i>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;</i>&gt;[, shortcut=0]) -&gt; QAction
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>Ha&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;</b> &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076; &#1073;&#1091;&#1082;&#1074;&#1086;&#1081; &#1080;&#1083;&#1080; &#1094;&#1080;&#1092;&#1088;&#1086;&#1081;, &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; 
&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1073;&#1091;&#1076;&#1077;&#1090;, &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1080; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1102;, &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;. &#1055;&#1088;&#1080; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1084; 
&#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Alt</b> &#1080; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;&#1086;&#1075;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; &#1084;&#1077;&#1085;&#1102; &#1086;&#1082;&#1072;&#1078;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1099;&#1084;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1072;&#1084; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; <b>&amp;</b>, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1077;&#1075;&#1086; &#1091;&#1076;&#1074;&#1086;&#1080;&#1090;&#1100;. 
&#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1087;&#1091;&#1085;&#1082;&#1090;, &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>shortcut</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; "&#1075;&#1086;&#1088;&#1103;&#1095;&#1080;&#1093;" &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1074;&#1099;&#1073;&#1086;&#1088;&#1091; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1074; &#1084;&#1077;&#1085;&#1102;. &#1053;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; "&#1075;&#1086;&#1088;&#1103;&#1095;&#1080;&#1093;" 
&#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1089;&#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1076;&#1072;&#1078;&#1077; &#1074; &#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102; &#1085;&#1077; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;. &#1042;&#1086;&#1090; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>shortcut</b>:
</p><div class="fon"><pre>
  QtGui.QKeySequence(<span class="pech">"Ctrl+R"</span>)
  QtGui.QKeySequence(QtCore.Qt.CTRL + QtCore.Qt.Key_R))
  QtGui.QKeySequence.fromString(<span class="pech">"Ctrl+R"</span>)
</pre></div>
 </li><li> <b>addSeparator ()</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1074; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>;
<p align="JUSTIFY">
 </p></li><li> <b>insertMenu (&lt;QAction&gt;, &lt;QMenu&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; <b>&lt;QMenu&gt;</b> &#1087;&#1077;&#1088;&#1077;&#1076; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1084; <b>&lt;QAction&gt;</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>;
<p align="JUSTIFY">
 </p></li><li> <b>insertSeparator (&lt;QAction&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1087;&#1077;&#1088;&#1077;&#1076; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1084; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1100; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addMenu (&lt;QMenu&gt;)</b> - &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1081; &#1077;&#1075;&#1086; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>;
<p align="JUSTIFY">
 </p></li><li> <b>addMenu ([&lt;QIcon&gt;, ]&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1074;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102;, &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1077;&#1075;&#1086; &#1074; &#1084;&#1077;&#1085;&#1102; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1085;&#1077;&#1075;&#1086; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMenu</b>);
<p align="JUSTIFY">
 </p></li><li> <b>clear ()</b> - &#1091;&#1076;&#1072;&#1083;&#1103;&#1077;&#1090; &#1074;&#1089;&#1077; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>isEmpty ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102; &#1085;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1074;&#1080;&#1076;&#1080;&#1084;&#1099;&#1093; &#1087;&#1091;&#1085;&#1082;&#1090;&#1086;&#1074;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>menuAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>), &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1084;&#1077;&#1085;&#1102;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1084;&#1077;&#1085;&#1102; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setvisible()</b>) &#1080;&#1083;&#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; (&#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setEnabled()</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setTitle (&lt;<i>Ha&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>title ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setIcon (&lt;QIcon&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>icon ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1086;&#1082; &#1084;&#1077;&#1085;&#1102; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QIcon</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setActiveAction (&lt;QAction&gt;)</b> - &#1076;&#1077;&#1083;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>activeAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setDefaultAction (&lt;QAction&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1085;&#1082;&#1090; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>defaultAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1091;&#1085;&#1082;&#1090; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setTearOffEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1084;&#1077;&#1085;&#1102; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1085;&#1082;&#1090; &#1089; &#1087;&#1091;&#1085;&#1082;&#1090;&#1080;&#1088;&#1085;&#1086;&#1081; &#1083;&#1080;&#1085;&#1080;&#1077;&#1081;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; 
&#1086;&#1090;&#1086;&#1088;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1085;&#1102; &#1086;&#1090; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1077;&#1075;&#1086; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084; (&#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084;&#1099;&#1084; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1074; &#1083;&#1102;&#1073;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;);
<p align="JUSTIFY">
 </p></li><li> <b>isTearOffEnabled ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1084;&#1077;&#1085;&#1102; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1080;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>isTearOffMenuVisible ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1084;&#1077;&#1085;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;; 
<p align="JUSTIFY">
 </p></li><li> <b>hideTearOffMenu ()</b> - &#1089;&#1082;&#1088;&#1099;&#1074;&#1072;&#1077;&#1090; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>setSeparatorsCollapsible (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1077;&#1081;, &#1080;&#1076;&#1091;&#1097;&#1080;&#1093; &#1087;&#1086;&#1076;&#1088;&#1103;&#1076;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1076;&#1080;&#1085;. 
<p align="JUSTIFY">
&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1088;&#1072;&#1079;&#1076;&#1077;&#1083;&#1080;&#1090;&#1077;&#1083;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1082;&#1088;&#1072;&#1103;&#1084; &#1084;&#1077;&#1085;&#1102;, &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;;
</p><p align="JUSTIFY">
 </p></li><li> <b>setToolTipsVisible (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1084;&#1077;&#1085;&#1102; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1072;&#1103; &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077;, &#1077;&#1089;&#1083;&#1080; <b>False</b> - &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; 
(&#1087;&#1086;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;).   &#1042;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1091;&#1102;  &#1087;&#1086;&#1076;&#1089;&#1082;&#1072;&#1079;&#1082;&#1091;  &#1076;&#1083;&#1103;  &#1084;&#1077;&#1085;&#1102;  &#1084;&#1086;&#1078;&#1085;&#1086;  &#1079;&#1072;&#1076;&#1072;&#1090;&#1100;  &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084;  &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; <b>setToolTip(&lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)</b>, &#1091;&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1084; &#1086;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>;
<p align="JUSTIFY">
 </p></li><li> <b>popup (&lt;QPoint&gt;[, &lt;QAction&gt;])</b> - &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;, &#1084;&#1077;&#1085;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084; &#1073;&#1099;&#1083; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>&#1077;&#1093;&#1077;&#1089; ([&lt;QPoint&gt;] [, action=None]])</b> - &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090; &#1084;&#1077;&#1085;&#1102; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; 
&#1087;&#1091;&#1085;&#1082;&#1090;&#1091;) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b> (&#1077;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Esc</b>). &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>action</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; 
(&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>), &#1084;&#1077;&#1085;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084; &#1073;&#1099;&#1083; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;;
<p align="JUSTIFY">
 </p></li><li> <b>&#1077;&#1093;&#1077;&#1089; (&lt;<i>&#1057;&#1087;&#1080;&#1089;&#1086;&#1082; &#1089; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;&#1084;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i> QAction&gt;, &lt;QPoint&gt;[, at=None][, parent=None])</b> - &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1084;&#1077;&#1085;&#1102; &#1087;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1084; &#1075;&#1083;&#1086;&#1073;&#1072;&#1083;&#1100;&#1085;&#1099;&#1084; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084; &#1080; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b> (&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091; &#1087;&#1091;&#1085;&#1082;&#1090;&#1091;) &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b> (&#1077;&#1089;&#1083;&#1080; &#1087;&#1091;&#1085;&#1082;&#1090; &#1085;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Esc</b>).  &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>at</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; 
(&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>), &#1084;&#1077;&#1085;&#1102; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084; &#1073;&#1099;&#1083; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; 
&#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QMenu</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;:
</p><ul>
 <li> <b>hovered (&lt;QAction&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1085;&#1072;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1077;&#1083;&#1103; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1087;&#1091;&#1085;&#1082;&#1090; &#1084;&#1077;&#1085;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;;
 </li><li> <b>triggered (&lt;QAction&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1099;&#1073;&#1086;&#1088;&#1077; &#1087;&#1091;&#1085;&#1082;&#1090;&#1072; &#1084;&#1077;&#1085;&#1102;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077;;
 </li><li> <b>aboutToSnow ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;&#1084; &#1084;&#1077;&#1085;&#1102;;
 </li><li> <b>aboutToHide ()</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076; &#1089;&#1082;&#1088;&#1099;&#1090;&#1080;&#1077;&#1084; &#1084;&#1077;&#1085;&#1102;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1102;&#1097;&#1080;&#1081; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1084;&#1077;&#1085;&#1102; (&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1079;&#1103;&#1090; &#1079;&#1076;&#1077;&#1089;&#1100;: <a href="https://pythonworld.ru/gui/pyqt5-menustoolbars.html" target="_blank">https://pythonworld.ru/gui/pyqt5-menustoolbars.html</a>):
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QMainWindow, QAction, qApp, QApplication
<span class="sl_sl">from</span> PyQt5.QtGui <span class="sl_sl">import</span> QIcon


<span class="sl_sl">class</span> <span class="vyvod">Example</span>(QMainWindow):

    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        <span class="tp">super</span>().__init__()

        self.initUI()


    <span class="sl_sl">def</span> <span class="vyvod">initUI</span>(self):
        exitAction = QAction(QIcon(<span class="pech">'exit.png'</span>), <span class="pech">'&amp;Exit'</span>, self)
        exitAction.setShortcut(<span class="pech">'Ctrl+Q'</span>)
        exitAction.triggered.connect(qApp.quit)

        menubar = self.menuBar()
        fileMenu = menubar.addMenu(<span class="pech">'&amp;File'</span>)
        fileMenu.addAction(exitAction)

        self.setGeometry(300, 300, 300, 200)
        self.setWindowTitle(<span class="pech">'Menubar'</span>)
        self.show()


<span class="sl_sl">if</span> __name__ == <span class="pech">'__main__'</span>:

    app = QApplication(sys.argv)
    ex = Example()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr274_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris274_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074;&#1099;&#1096;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077;, &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1084;&#1077;&#1085;&#1102; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084; &#1084;&#1077;&#1085;&#1102;. &#1069;&#1090;&#1086; &#1084;&#1077;&#1085;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1090;&#1100; &#1086;&#1076;&#1085;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1077;&#1082;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091;. 
&#1044;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>Ctrl + Q</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
<b>QAction</b> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1072;&#1073;&#1089;&#1090;&#1088;&#1072;&#1082;&#1094;&#1080;&#1077;&#1081; &#1076;&#1083;&#1103; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1081;, &#1089;&#1086;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1085;&#1099;&#1093; &#1080;&#1079; &#1084;&#1077;&#1085;&#1102;, &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1081; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;. &#1042; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1076;&#1074;&#1091;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>initUI()</b>, &#1084;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; 
&#1089; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1080;&#1082;&#1086;&#1085;&#1082;&#1086;&#1081;. &#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1076;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;. 
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1086;&#1075;&#1076;&#1072; &#1084;&#1099; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; &#1101;&#1090;&#1086; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077;, &#1089;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; (&#1090;&#1088;&#1077;&#1090;&#1100;&#1103; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;). &#1057;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1082; &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <b>quit()</b> &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1072; <b>QApplication</b>. &#1069;&#1090;&#1086; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1077;&#1090; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1077;&#1090;&#1086;&#1076; <b>menuBar()</b> &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1084;&#1077;&#1085;&#1102;. &#1052;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1084;&#1077;&#1085;&#1102; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1082; &#1085;&#1077;&#1084;&#1091; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1077; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072;.</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1077; &#1084;&#1077;&#1085;&#1102; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_273.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav15.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_275.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>