<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_001.html]
* At UTC datetime: [2023-08-19 09:53:58.892148]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 1.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; PyQt5
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>PyQt5</b> &#1085;&#1077; &#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1082;&#1086;&#1084;&#1087;&#1083;&#1077;&#1082;&#1090; &#1087;&#1086;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; <b>Python</b>, &#1080; &#1087;&#1088;&#1077;&#1078;&#1076;&#1077;, &#1095;&#1077;&#1084; &#1085;&#1072;&#1095;&#1072;&#1090;&#1100; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1077;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;, 
&#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100; &#1101;&#1090;&#1091; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1100;&#1102;&#1090;&#1077;&#1088;. &#1048;&#1090;&#1072;&#1082;:
</p><ol>
 <li> &#1047;&#1072;&#1093;&#1086;&#1076;&#1080;&#1084; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; <a href="https://riverbankcomputing.com/software/pyqt/download5" target="_blank"><b>https://riverbankcomputing.com/software/pyqt/download5</b></a>, &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1084;&#1099;&#1081; &#1092;&#1072;&#1081;&#1083; 
<b>PyQt5-5.4.1-gpl-Py3.4-Qt5.4.1-x32.exe</b> &#1076;&#1083;&#1103; 32-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1081; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; <b>Python</b> (&#1080;&#1083;&#1080; <b>PyQt5-5.4.1-gpl-Py3.4-Qt5.4.1-x64.exe</b> - 
&#1076;&#1083;&#1103; 64-&#1088;&#1072;&#1079;&#1088;&#1103;&#1076;&#1085;&#1086;&#1081;) &#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084; &#1077;&#1075;&#1086; &#1076;&#1074;&#1086;&#1081;&#1085;&#1099;&#1084; &#1097;&#1077;&#1083;&#1095;&#1082;&#1086;&#1084;.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1052;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; &#1101;&#1090;&#1080; &#1092;&#1072;&#1081;&#1083;&#1099; <a href="https://it.kgsu.ru/Python_Qt/pr1_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
</p><p align="JUSTIFY">
 </p></li><li> &#1055;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103;&#1084; <b>Windows Vista</b> &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1085;&#1086;&#1074;&#1099;&#1093; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; <b>Windows</b> &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1086;&#1090;&#1074;&#1077;&#1090;&#1080;&#1090;&#1100; 
&#1085;&#1072; &#1087;&#1086;&#1103;&#1074;&#1080;&#1074;&#1096;&#1077;&#1077;&#1089;&#1103; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085;&#1077; &#1087;&#1088;&#1077;&#1076;&#1091;&#1087;&#1088;&#1077;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; <b>UAC</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; <b>PyQt</b> &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;.
<p align="JUSTIFY">
 </p></li><li> &#1042; &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1096;&#1077;&#1084;&#1089;&#1103; &#1086;&#1082;&#1085;&#1077; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1) &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Next</b>.
<p align="CENTER"><img src="images/ris1_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; <b>PyQt</b>. &#1064;&#1072;&#1075; 1</font></p>
<p align="JUSTIFY">
 </p></li><li> &#1044;&#1072;&#1083;&#1077;&#1077; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 2), &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>I Agree</b>, &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084; &#1083;&#1080;&#1094;&#1077;&#1085;&#1079;&#1080;&#1086;&#1085;&#1085;&#1086;&#1077; &#1089;&#1086;&#1075;&#1083;&#1072;&#1096;&#1077;&#1085;&#1080;&#1077;.
<p align="CENTER"><img src="images/ris1_2.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.2. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; <b>PyQt</b>. &#1064;&#1072;&#1075; 2</font></p>
<p align="JUSTIFY">
 </p></li><li> &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 3) &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1090;&#1100;, - &#1086;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1084; &#1079;&#1076;&#1077;&#1089;&#1100; &#1074;&#1089;&#1077; &#1082;&#1072;&#1082; &#1077;&#1089;&#1090;&#1100; &#1080; 
&#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Next</b>.
<p align="CENTER"><img src="images/ris1_3.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.3. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; <b>PyQt</b>. &#1064;&#1072;&#1075; 3</font></p>
<p align="JUSTIFY">
 </p></li><li> &#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 4) &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1091;&#1090;&#1100; &#1082; &#1082;&#1072;&#1090;&#1072;&#1083;&#1086;&#1075;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085; &#1080;&#1085;&#1090;&#1077;&#1088;&#1087;&#1088;&#1077;&#1090;&#1072;&#1090;&#1086;&#1088; 
<b>Python (C:\Python34)</b>, - &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084; &#1079;&#1076;&#1077;&#1089;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Install</b> &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1086;&#1094;&#1077;&#1089;&#1089;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; <b>PyQt</b>.
<p align="CENTER"><img src="images/ris1_4.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.4. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; <b>PyQt</b>. &#1064;&#1072;&#1075; 4</font></p>
<p align="JUSTIFY">
 </p></li><li> &#1055;&#1086;&#1089;&#1083;&#1077; &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1077;&#1085;&#1080;&#1103; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085;&#1086; &#1086;&#1082;&#1085;&#1086;, &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1086;&#1077; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 5. 
<p align="CENTER"><img src="images/ris1_5.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.5. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; <b>PyQt</b>. &#1064;&#1072;&#1075; 5</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084; &#1079;&#1076;&#1077;&#1089;&#1100; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b>Finish</b> &#1076;&#1083;&#1103; &#1074;&#1099;&#1093;&#1086;&#1076;&#1072; &#1080;&#1079; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;.
</p></li></ol>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1077; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1074;&#1089;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1092;&#1072;&#1081;&#1083;&#1099; &#1073;&#1091;&#1076;&#1091;&#1090; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1099; &#1074; &#1087;&#1072;&#1087;&#1082;&#1091; <b>C:\Python34\ Lib\site-packages\PyQt5</b>, 
&#1072; &#1087;&#1091;&#1090;&#1100; &#1082; &#1085;&#1077;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1085;&#1086;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <b>PATH</b>. &#1042; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1077; &#1074;&#1099; &#1085;&#1072;&#1081;&#1076;&#1077;&#1090;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; 
<b>Designer</b>, <b>Linguist</b> &#1080; <b>Assistant</b>, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; 
&#1076;&#1080;&#1085;&#1072;&#1084;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1082;&#1080; (&#1090;&#1072;&#1082;&#1080;&#1077; &#1082;&#1072;&#1082; <b>QtCore5.dll</b>, <b>QtGui5.dll</b> &#1080; <b>Qt5Sql.dll</b>), &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; 
&#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;, &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072; <b>PyQt</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1088;&#1086;&#1084;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086;, &#1090;&#1072;&#1084; &#1078;&#1077; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>libmySQL.dll</b>, &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1072;&#1103; &#1076;&#1083;&#1103; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072; &#1082; &#1073;&#1072;&#1079;&#1072;&#1084; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <b>MySQL</b>. 
&#1047;&#1076;&#1077;&#1089;&#1100; &#1085;&#1072;&#1076;&#1086; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1091;, &#1095;&#1090;&#1086; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>libmySQL.dll</b> &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1086; &#1074;&#1089;&#1077;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1074;&#1089;&#1077;&#1075;&#1076;&#1072; &#1087;&#1086;&#1076;&#1075;&#1088;&#1091;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1084;&#1077;&#1085;&#1085;&#1086; 
&#1080;&#1079; &#1101;&#1090;&#1086;&#1081; &#1087;&#1072;&#1087;&#1082;&#1080;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1087;&#1091;&#1090;&#1100; &#1082; &#1085;&#1077;&#1081; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103;, 
&#1082;&#1072;&#1082; &#1091;&#1078;&#1077; &#1073;&#1099;&#1083;&#1086; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085;&#1086;, &#1074; &#1089;&#1072;&#1084;&#1086;&#1077; &#1085;&#1072;&#1095;&#1072;&#1083;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <b>PATH</b>. &#1045;&#1089;&#1083;&#1080; &#1042;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; <b>Web</b>-&#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080; 
&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090;&#1077;&#1089;&#1100; &#1082; <b>MySQL</b> &#1080;&#1079; <b>&#1056;&#1053;&#1056;</b> &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; 5.2, &#1090;&#1086; &#1091; &#1074;&#1072;&#1089; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1085;&#1086;&#1074;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1099;, &#1089;&#1074;&#1103;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089; 
&#1085;&#1077;&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080; <b>libmySQL.dll</b>. &#1042; &#1090;&#1072;&#1082;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1087;&#1091;&#1090;&#1100; &#1082; &#1087;&#1072;&#1087;&#1082;&#1077;, &#1082;&#1091;&#1076;&#1072; &#1073;&#1099;&#1083;&#1072; 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072; <b>PyQt</b>, &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1074; &#1089;&#1072;&#1084;&#1099;&#1081; &#1082;&#1086;&#1085;&#1077;&#1094; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086;&#1081; <b>PATH</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1080;&#1090;&#1100; &#1087;&#1088;&#1072;&#1074;&#1080;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;, &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1084; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080; <b>PyQt</b> &#1080; <b>Qt</b>.
</p><div class="fon"><pre>
&gt;&gt;&gt; <span class="sl_sl">from</span> PyQt5  <span class="sl_sl">import</span> QtCore
&gt;&gt;&gt; QtCore.PYQT_VERSION_STR
<span class="vyvod">'5.4.1'</span>
&gt;&gt;&gt; QtCore.QT_VERSION_STR
<span class="vyvod">'5.4.1'</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1077;&#1088;&#1074;&#1091;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1091; &#1085;&#1072; </i>PyQt5</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_002.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>