<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_061.html]
* At UTC datetime: [2023-08-19 09:56:46.257918]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 61.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1057;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;. &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089;&#1086;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1086;&#1076;&#1080;&#1085; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1080; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; (&#1080;&#1083;&#1080; &#1074;&#1086;&#1086;&#1073;&#1097;&#1077; &#1085;&#1080; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;) &#1084;&#1086;&#1078;&#1077;&#1090; &#1080;&#1084;&#1077;&#1090;&#1100; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;. &#1044;&#1083;&#1103; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1086;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>:
</p><ul>
 <li> <b>setFocus ([&lt;<i>&#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;</i>&gt;])</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1055;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;</i>&gt;</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; 
&#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
<ul>
 <li> <b>MouseFocusReason (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1092;&#1086;&#1082;&#1091;&#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>TabFocusReason (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Tab</b>;
 </li><li> <b>BacktabFocusReason (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; <b>Shift+Tab</b>;
 </li><li> <b>ActiveWindowFocusReason (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1086;&#1082;&#1085;&#1086; &#1089;&#1090;&#1072;&#1083;&#1086; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084; &#1080;&#1083;&#1080; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;;
 </li><li> <b>PopupFocusReason (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1086; &#1080;&#1083;&#1080; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1086; &#1074;&#1089;&#1087;&#1083;&#1099;&#1074;&#1072;&#1102;&#1097;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086;;
 </li><li> <b>ShortcutFocusReason (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1085;&#1072;&#1078;&#1072;&#1090;&#1072; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;&#1075;&#1086; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1072;;
 </li><li> <b>MenuBarFocusReason (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1092;&#1086;&#1082;&#1091;&#1089; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1083;&#1089;&#1103; &#1080;&#1079;-&#1079;&#1072; &#1084;&#1077;&#1085;&#1102;;
 </li><li> <b>OtherFocusReason (<i>&#1080;&#1083;&#1080;</i> 7)</b> - &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1087;&#1088;&#1080;&#1095;&#1080;&#1085;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>clearFocus ()</b> - &#1091;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>hasFocus ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1080;&#1084;&#1077;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>focusWidget ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1076;&#1083;&#1103; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1083;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setFocus()</b>. &#1044;&#1083;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; 
&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1087;&#1086;&#1089;&#1083;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1082;&#1072;&#1082; &#1086;&#1082;&#1085;&#1086; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1099;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setFocusProxy (&lt;Qwidget&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>focusProxy ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1074;&#1074;&#1086;&#1076;&#1072; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1075;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1085;&#1077;&#1090;, &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>;
<p align="JUSTIFY">
 </p></li><li> <b>focusNextChild ()</b> - &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1092;&#1086;&#1082;&#1091;&#1089;, &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1077;&#1084;&#1091;. &#1060;&#1072;&#1082;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>focusPreviousChild()</b> - &#1085;&#1072;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1092;&#1086;&#1082;&#1091;&#1089;,  &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1077;&#1084;&#1091;.  &#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;  &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1102; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; 
<b>Shift+Tab</b>. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>focusNextPrevChild (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;   &#1084;&#1077;&#1090;&#1086;&#1076;&#1091;    <b>focusNextChild()</b>,   
&#1077;&#1089;&#1083;&#1080;   &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086;    <b>False</b>   -   &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086;   &#1084;&#1077;&#1090;&#1086;&#1076;&#1091; <b>focusPreviousChild()</b>. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072;&#1081;&#1076;&#1077;&#1085;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setTabOrder (&lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;1</i>&gt;, &lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;2</i>&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1089;&#1084;&#1077;&#1085;&#1099; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1087;&#1088;&#1080; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1080; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084;. 
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;2</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1089;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089; &#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; <b>&lt;<i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;1</i>&gt;</b>. 
&#1045;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1084;&#1085;&#1086;&#1075;&#1086;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079;.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1094;&#1077;&#1087;&#1086;&#1095;&#1082;&#1080; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1072; <b>widget1 -&gt; widget2 -&gt; widget3 -&gt; widget4</b>:
</p><div class="fon"><pre>
QtWidgets.QWidget.setTabOrder(widget1, widget2) 
QtWidgets.QWidget.setTabOrder(widget2, widget3) 
QtWidgets.QWidget.setTabOrder(widget3, widget4)
</pre></div>
 </li><li> <b>setFocusPolicy (&lt;<i>&#1057;noco&#1073;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;  &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103;  &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;  &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084;  &#1074;  &#1074;&#1080;&#1076;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
<ul>
 <li> <b>NoFocus (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1092;&#1086;&#1082;&#1091;&#1089;;
 </li><li> <b>TabFocus (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>;
 </li><li> <b>ClickFocus (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>StrongFocus (<i>&#1080;&#1083;&#1080;</i> 11)</b> - &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b> &#1080; &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>WheelFocus (<i>&#1080;&#1083;&#1080;</i> 15)</b> - &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>, &#1097;&#1077;&#1083;&#1095;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102; &#1080; &#1082;&#1086;&#1083;&#1077;&#1089;&#1080;&#1082;&#1072; &#1084;&#1099;&#1096;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>focusPolicy ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1080;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>grabKeyboard ()</b> - &#1079;&#1072;&#1093;&#1074;&#1072;&#1090;&#1099;&#1074;&#1072;&#1077;&#1090; &#1074;&#1074;&#1086;&#1076; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;. &#1044;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1090;&#1100; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;, &#1087;&#1086;&#1082;&#1072; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1085; &#1084;&#1077;&#1090;&#1086;&#1076; <b>releaseKeyboard()</b>;
<p align="JUSTIFY">
 </p></li><li> <b>releaseKeyboard ()</b> - &#1086;&#1089;&#1074;&#1086;&#1073;&#1086;&#1078;&#1076;&#1072;&#1077;&#1090; &#1079;&#1072;&#1093;&#1074;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1074;&#1074;&#1086;&#1076; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081;&#1089;&#1103; &#1074; &#1092;&#1086;&#1082;&#1091;&#1089;&#1077; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1090;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; <b>focusWidget()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QApplication</b>. &#1045;&#1089;&#1083;&#1080; &#1085;&#1080; 
&#1086;&#1076;&#1080;&#1085; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;, &#1084;&#1077;&#1090;&#1086;&#1076; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>.  He &#1087;&#1091;&#1090;&#1072;&#1081;&#1090;&#1077; &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; &#1089; &#1086;&#1076;&#1085;&#1086;&#1080;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;. &#1042; &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1091; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1080;&#1103; &#1080; &#1087;&#1086;&#1090;&#1077;&#1088;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1074;&#1074;&#1086;&#1076;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_060.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav3.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_062.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>