<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_299.html]
* At UTC datetime: [2023-08-19 10:06:56.116796]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 299.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;. &#1050;&#1083;&#1072;&#1089;&#1089; QPrinter
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1077;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1082; &#1091;&#1078;&#1077; &#1075;&#1086;&#1074;&#1086;&#1088;&#1080;&#1083;&#1086;&#1089;&#1100;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QPrinter</b> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;. &#1045;&#1075;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1072;&#1082;&#1086;&#1074;&#1072;:
</p><div class="fon"><pre>
  QPaintDevice - QPagedPaintDevice - QPrinter
</pre></div>
&#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;:
<div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPrinter([mode=ScreenResolution])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QPrinter(&lt;QPrinterInfo&gt;[, mode=ScreenResolution])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090; &#1076;&#1083;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>mode</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QPrinter</b>:
</p><ul>
 <li> <b>ScreenResolution (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072;. &#1055;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086; &#1073;&#1099;&#1089;&#1090;&#1088;&#1086;, &#1085;&#1086; &#1074; &#1093;&#1091;&#1076;&#1096;&#1077;&#1084; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;;
 </li><li> <b>HighResolution</b> (<i>&#1080;&#1083;&#1080;</i> 2) - &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;. &#1055;&#1077;&#1095;&#1072;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1077;&#1077;, &#1085;&#1086; &#1084;&#1077;&#1076;&#1083;&#1077;&#1085;&#1085;&#1077;&#1077;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1080;&#1079; &#1095;&#1080;&#1089;&#1083;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077;. &#1069;&#1090;&#1086;&#1090; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinterInf&#1086;</b>, &#1088;&#1077;&#1095;&#1100; &#1086; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1087;&#1086;&#1081;&#1076;&#1077;&#1090; &#1085;&#1080;&#1078;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QPrinter</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1086;&#1095;&#1077;&#1085;&#1100; &#1084;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1083;&#1080;&#1096;&#1100; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077;. &#1055;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1081;&#1090;&#1080; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qprinter.html" target="_blank"><b>https://doc.qt.io/qt-5/qprinter.html</b></a>:
</p><ul>
 <li> <b>setPrinterName (&lt;<i>&#1048;&#1084;&#1103;  &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;</i>&gt;)</b>   - &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1091; &#1089; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; 
&#1082; &#1074;&#1089;&#1090;&#1088;&#1086;&#1077;&#1085;&#1085;&#1086;&#1081; &#1074; <b>PyQt</b> &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>PDF</b>;
<p align="JUSTIFY">
 </p></li><li> <b>printerName ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089; &#1080;&#1084;&#1077;&#1085;&#1077;&#1084; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setOutputFileName (&lt;<i>&#1055;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; (&#1090;&#1072;&#1082; &#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1072;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1074; &#1092;&#1072;&#1081;&#1083;). &#1045;&#1089;&#1083;&#1080; &#1092;&#1072;&#1081;&#1083; &#1080;&#1084;&#1077;&#1077;&#1090; &#1088;&#1072;&#1089;&#1096;&#1080;&#1088;&#1077;&#1085;&#1080;&#1077; <b>pdf</b>, 
&#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>PDF</b>. &#1042; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1092;&#1072;&#1081;&#1083; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1084; &#1074; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setOutputFormat()</b>. &#1063;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1099;&#1074;&#1086;&#1076; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; 
&#1092;&#1072;&#1081;&#1083;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1101;&#1090;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1074; &#1077;&#1084;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1091;&#1089;&#1090;&#1091;&#1102; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>outputFileName ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1085; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; &#1085;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setOutputFormat (&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1088;&#1080; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; &#1074; &#1092;&#1072;&#1081;&#1083;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>:
<ul>
 <li> <b>NativeFormat (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076; &#1074;&#1086; &#1074;&#1085;&#1091;&#1090;&#1088;&#1077;&#1085;&#1085;&#1077;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;. &#1069;&#1090;&#1086;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b> &#1080; 
&#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setPrinterName()</b> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1080;&#1084;&#1077;&#1085;&#1080; &#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1075;&#1086; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085; &#1082; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; <b>PDF</b>, &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1086; 
&#1087;&#1077;&#1088;&#1077;&#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1091; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
 </li><li> <b>PdfFormat (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1074;&#1099;&#1074;&#1086;&#1076; &#1074; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1077; PDF. &#1069;&#1090;&#1086;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; 
&#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1074;&#1099;&#1079;&#1086;&#1074;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setPrinterName()</b> &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077;&#1084; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>outputFormat ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>isValid ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1080; &#1075;&#1086;&#1090;&#1086;&#1074; &#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;.
<p align="JUSTIFY">
 </p></li><li> <b>setPageSize (&lt;QPageSize&gt;)</b>    -   &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;   &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;   &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;   &#1074;   &#1074;&#1080;&#1076;&#1077;   &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072;   &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageSize</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>:
<div class="fon"><pre>
  <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1040;4</span>
  ps = QtGui.QPageSize(QtGui.QPageSize.A4) 
  printer.setPageSize(ps)
</pre></div>
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPageOrientation (&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Portrait</b> (0, &#1087;&#1086;&#1088;&#1090;&#1088;&#1077;&#1090;&#1085;&#1072;&#1103;) &#1080;&#1083;&#1080; <b>Landscape</b> (l, &#1083;&#1072;&#1085;&#1076;&#1096;&#1072;&#1092;&#1090;&#1085;&#1072;&#1103;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QPageLayout</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>. &#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPageMargins (&lt;QMarginsF&gt;[, &lt;<i>&#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;</i>&gt;])</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1086;&#1090; &#1082;&#1088;&#1072;&#1077;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1077;&#1076;&#1080;&#1085;&#1080;&#1094;&#1077; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1072;&#1084;&#1080; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QMarginsF</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>. &#1045;&#1076;&#1080;&#1085;&#1080;&#1094;&#1072; &#1080;&#1079;&#1084;&#1077;&#1088;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>:
<ul>
 <li> <b>Millimeter (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1084;&#1080;&#1083;&#1083;&#1080;&#1084;&#1077;&#1090;&#1088;&#1099;;
 </li><li> <b>Point (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1091;&#1085;&#1082;&#1090;&#1099;;
 </li><li> <b>Inch (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1076;&#1102;&#1081;&#1084;&#1099;;
 </li><li> <b>Pica (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1080;&#1082;&#1080;;
 </li><li> <b>Didot (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1076;&#1080;&#1076;&#1086; (0,375 &#1084;&#1084;);
 </li><li> <b>Cicero (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1094;&#1080;&#1094;&#1077;&#1088;&#1086; (4,5 &#1084;&#1084;).
</li></ul>
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
<div class="fon"><pre>
  <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1074; 5 &#1084;&#1084; &#1089;&#1086; &#1074;&#1089;&#1077;&#1093; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;</span>
  m = QtCore.QMarginsF(5, 5, 5, 5)
  printer.setPageMargins(m, QtGui.QPageLayout.Millimeter)
</pre></div>
 </li><li> <b>setPageLayout (&lt;QPageLayout&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1088;&#1072;&#1079;&#1091; &#1074;&#1089;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; (&#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099;, &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1080; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1099; &#1086;&#1090; &#1082;&#1088;&#1072;&#1077;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>. 
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1103; &#1091;&#1074;&#1077;&#1085;&#1095;&#1072;&#1083;&#1072;&#1089;&#1100; &#1091;&#1089;&#1087;&#1077;&#1093;&#1086;&#1084;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>pageLayout ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPageLayout</b>, &#1093;&#1088;&#1072;&#1085;&#1103;&#1097;&#1080;&#1081; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103; &#1086; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1077; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;, &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1080; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1072;&#1093; &#1086;&#1090;&#1089;&#1090;&#1091;&#1087;&#1086;&#1074; &#1086;&#1090; &#1082;&#1088;&#1072;&#1077;&#1074; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;;
<p align="JUSTIFY">
 </p></li><li> <b>setCopyCount (&lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1087;&#1080;&#1081;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1087;&#1080;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>copyCount ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1087;&#1080;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setCollateCopies (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1085;&#1072; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1087;&#1088;&#1077;&#1078;&#1076;&#1077; &#1095;&#1077;&#1084; &#1085;&#1072;&#1095;&#1085;&#1077;&#1090;&#1089;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1086;&#1087;&#1080;&#1080;. &#1045;&#1089;&#1083;&#1080; 
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1089;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1090;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1085;&#1099; &#1074;&#1089;&#1077; &#1082;&#1086;&#1087;&#1080;&#1080; &#1087;&#1077;&#1088;&#1074;&#1086;&#1081; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;, &#1087;&#1086;&#1090;&#1086;&#1084; &#1074;&#1089;&#1077; &#1082;&#1086;&#1087;&#1080;&#1080; &#1074;&#1090;&#1086;&#1088;&#1086;&#1081; &#1080; &#1090;. &#1076;.;
<p align="JUSTIFY">
 </p></li><li> <b>collateCopies ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1072;&#1078;&#1076;&#1072;&#1103; &#1082;&#1086;&#1087;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1083;&#1085;&#1086;&#1089;&#1090;&#1100;&#1102;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setDuplex (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084; &#1076;&#1074;&#1091;&#1093;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>:
<ul>
 <li> <b>DuplexNone (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1086;&#1076;&#1085;&#1086;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;;
 </li><li> <b>DuplexAuto (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1084; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099; &#1083;&#1080;&#1089;&#1090;&#1072;, &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1077;&#1075;&#1086; &#1087;&#1077;&#1088;&#1077;&#1074;&#1077;&#1088;&#1085;&#1091;&#1090;&#1100;;
 </li><li> <b>DuplexLongSide (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1083;&#1080;&#1089;&#1090;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1076;&#1083;&#1080;&#1085;&#1085;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;;
 </li><li> <b>DuplexShortSide (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1103;&#1103; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100; &#1089; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1088;&#1072;&#1095;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1083;&#1080;&#1089;&#1090;&#1072; &#1074;&#1086;&#1082;&#1088;&#1091;&#1075; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>duplex ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1076;&#1074;&#1091;&#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1085;&#1077;&#1081; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setPrintRange (&lt;<i>&#1044;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>:
<ul>
 <li> <b>AllPages (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1074;&#1089;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099;;
 </li><li> <b>Selection (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1092;&#1088;&#1072;&#1075;&#1084;&#1077;&#1085;&#1090;;
 </li><li> <b>PageRange (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;;
 </li><li> <b>CurrentPage (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setFromTo (&lt;<i>&#1053;a&#1095;a&#1083;&#1100;&#1085;a&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;</i>&gt;, &lt;<i>&#1050;&#1086;&#1085;&#1077;&#1095;&#1085;&#1072;&#1103; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085; &#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>fromPage ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>toPage ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1091;&#1102; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1091; &#1076;&#1080;&#1072;&#1087;&#1072;&#1079;&#1086;&#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setColorMode (&lt;<i>&#1062;&#1074;&#1077;&#1090;&#1086;&#1074;&#1086;&#1081; &#1088;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>Color</b> (1, &#1094;&#1074;&#1077;&#1090;&#1085;&#1086;&#1081;) &#1080;&#1083;&#1080; <b>Grayscale</b> (0, &#1095;&#1077;&#1088;&#1085;&#1086;-&#1073;&#1077;&#1083;&#1099;&#1081;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b>;
<p align="JUSTIFY">
 </p></li><li> <b>colorMode ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1094;&#1074;&#1077;&#1090;&#1072;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setResolution (&lt;<i>Pa&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1085;&#1077;&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1103;, &#1073;&#1091;&#1076;&#1077;&#1090; 
&#1074;&#1099;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1086; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;, &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; &#1073;&#1083;&#1080;&#1079;&#1082;&#1086;&#1077; &#1082; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1084;&#1091;;
<p align="JUSTIFY">
 </p></li><li> <b>resolution ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setPaperSource (&lt;<i>&#1048;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080; &#1076;&#1083;&#1103; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPrinter</b> (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1083;&#1080;&#1096;&#1100; &#1085;&#1072;&#1080;&#1073;&#1086;&#1083;&#1077;&#1077; 
&#1095;&#1072;&#1089;&#1090;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1080;, &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qprinter.html#PaperSource-enum" target="_blank"><b>https://doc.qt.io/qt-5/qprinter.html#PaperSource-enum</b></a>):
<ul>
 <li> <b>OnlyOne (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1077;&#1076;&#1080;&#1085;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1099;&#1081; &#1083;&#1086;&#1090;&#1086;&#1082; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1072; &#1080;&#1083;&#1080; &#1083;&#1086;&#1090;&#1086;&#1082;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;;
 </li><li> <b>Lower (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1080;&#1078;&#1085;&#1080;&#1081; &#1083;&#1086;&#1090;&#1086;&#1082;;
 </li><li> <b>Middle (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1088;&#1077;&#1076;&#1085;&#1080;&#1081; &#1083;&#1086;&#1090;&#1086;&#1082;;
 </li><li> <b>Manual (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1083;&#1086;&#1090;&#1086;&#1082; &#1076;&#1083;&#1103; &#1088;&#1091;&#1095;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1072;&#1095;&#1080; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;;
 </li><li> <b>Envelope (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1083;&#1086;&#1090;&#1086;&#1082; &#1076;&#1083;&#1103; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1086;&#1074;;
 </li><li> <b>EnvelopeManual (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1083;&#1086;&#1090;&#1086;&#1082; &#1076;&#1083;&#1103; &#1088;&#1091;&#1095;&#1085;&#1086;&#1081; &#1087;&#1086;&#1076;&#1072;&#1095;&#1080; &#1082;&#1086;&#1085;&#1074;&#1077;&#1088;&#1090;&#1086;&#1074;;
 </li><li> <b>Auto (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1074;&#1099;&#1073;&#1086;&#1088; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>paperSource ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1086;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072; &#1073;&#1091;&#1084;&#1072;&#1075;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setFontEmbeddingEnabled (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090; <b>PDF</b> &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1085;&#1077;&#1076;&#1088;&#1077;&#1085;&#1099; &#1074;&#1089;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1077; &#1074; &#1077;&#1075;&#1086; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077; &#1096;&#1088;&#1080;&#1092;&#1090;&#1099;, 
&#1077;&#1089;&#1083;&#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> - &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090;;
<p align="JUSTIFY">
 </p></li><li> <b>supportsMultipieCopies ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088; &#1089;&#1072;&#1084; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1077;&#1085; &#1085;&#1072;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1090;&#1100; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1082;&#1086;&#1087;&#1080;&#1081; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>supportedResolutions ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;&#1086;&#1084; &#1080; &#1080;&#1079;&#1084;&#1077;&#1088;&#1103;&#1077;&#1084;&#1099;&#1093; &#1074; &#1090;&#1086;&#1095;&#1082;&#1072;&#1093; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;:
<div class="fon"><pre>
  printer = QtPrintSupport.QPrinter()
  <span class="sl_sl">for</span> f <span class="sl_sl">in</span> printer.supportedResolutions(): 
      <span class="tp">print</span>(f, end=<span class="pech">" "</span>)
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1083;&#1086;&#1089;&#1100;: 600</span>
</pre></div>
&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086;, &#1087;&#1088;&#1080;&#1085;&#1090;&#1077;&#1088;, &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1083;&#1080;&#1096;&#1100; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1077; 600 &#1090;&#1086;&#1095;&#1077;&#1082; &#1085;&#1072; &#1076;&#1102;&#1081;&#1084;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1099;&#1074;&#1086;&#1076; &#1085;&#1072; &#1087;&#1077;&#1095;&#1072;&#1090;&#1100;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_298.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_300.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>