<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_281.html]
* At UTC datetime: [2023-08-19 10:06:07.290561]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 281.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; SDI- &#1080; MDI-&#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1080; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086;, &#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1085;&#1072; &#1101;&#1082;&#1088;&#1072;&#1085; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;, &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1102;&#1097;&#1080;&#1077; &#1084;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1090;&#1072;&#1073;&#1083;&#1080;&#1094;&#1091; &#1080;&#1083;&#1080; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;), &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; 
<b><i>&#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1099;&#1084;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1084;&#1080;</i></b>. &#1055;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1099;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1102;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDockWidget</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1075;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
  (QObject,   QPaintDevice)  - QWidget - QDockWidget
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDockWidget</b>:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDockWidget([parent=<span class="sl_sl">None</span>][, flags=0])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QDockWidget(&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;[, parent=<span class="sl_sl">None</span>][, flags=0])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1053;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;</i>&gt;</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1077; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102; &#1087;&#1088;&#1080; &#1097;&#1077;&#1083;&#1095;&#1082;&#1077; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1074; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1084;&#1077;&#1085;&#1102;, &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081; 
&#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1083;&#1080; &#1085;&#1072; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1099;&#1093; &#1087;&#1072;&#1085;&#1077;&#1083;&#1077;&#1081;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1091;&#1102; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; 
&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; <b>flags</b> &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_025.html" target="_blank">25 &#1096;&#1072;&#1075;&#1077;</a>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDockWidget</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080;&#1079; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1079;&#1076;&#1077;&#1089;&#1100; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1097;&#1080;&#1077; &#1085;&#1072;&#1089; - &#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qdockwidget.html" target="_blank"><b>https://doc.qt.io/qt-5/qdockwidget.html</b></a>):
</p><ul>
 <li> <b>setWidget (&lt;QWidget&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1086;&#1081; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>widget ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setTitleBarWidget (&lt;QWidget&gt;)</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084;&#1099;&#1081; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>titleBarWidget ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1091; &#1085;&#1072; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;, &#1080;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>None</b>, &#1077;&#1089;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1077; &#1073;&#1099;&#1083; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;;
<p align="JUSTIFY">
 </p></li><li> <b>setAllowedAreas (&lt;<i>&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1082; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; (&#1080;&#1083;&#1080; &#1080;&#1093; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;   |):
<ul>
 <li> <b>LeftDockWidgetArea</b> (&#1089;&#1083;&#1077;&#1074;&#1072;),
 </li><li> <b>RightDockWidgetArea</b> (&#1089;&#1087;&#1088;&#1072;&#1074;&#1072;),
 </li><li> <b>TopDockWidgetArea</b> (&#1089;&#1074;&#1077;&#1088;&#1093;&#1091;),
 </li><li> <b>BottomDockWidgetArea</b> (&#1089;&#1085;&#1080;&#1079;&#1091;) &#1080;&#1083;&#1080;
 </li><li> <b>AllDockWidgetAreas</b> (&#1074;&#1089;&#1077; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;)
</li></ul>
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setFloating (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;, &#1072; &#1077;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1086;&#1085;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1072; &#1082; &#1082;&#1072;&#1082;&#1086;&#1081;-&#1083;&#1080;&#1073;&#1086; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>isFloating ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1084; &#1086;&#1082;&#1085;&#1077;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setFeatures (&lt;<i>&#1057;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;</i>&gt;)</b> - &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; (&#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |) &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDockWidget</b>:
<ul>
 <li> <b>DockWidgetClosable</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;;
 </li><li> <b>DockWidgetMovable</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080;;
 </li><li> <b>DockWidgetFloatable</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;;
 </li><li> <b>DockWidgetVerticalTitleBar</b> - &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089; &#1083;&#1077;&#1074;&#1086;&#1081; &#1089;&#1090;&#1086;&#1088;&#1086;&#1085;&#1099;, &#1072; &#1085;&#1077; &#1089;&#1074;&#1077;&#1088;&#1093;&#1091;;
 </li><li> <b>NoDockWidgetFeatures</b> - &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103; &#1079;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;, &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; &#1080; &#1074;&#1099;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>features ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>toggleViewAction ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; (&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAction</b>), &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1082;&#1088;&#1099;&#1090;&#1100; &#1080;&#1083;&#1080; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QDockWidget</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1077; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qdockwidget.html" target="_blank"><b>https://doc.qt.io/qt-5/qdockwidget.html</b></a>):
</p><ul>
 <li> <b>dockLocationChanged (&lt;<i>&#1054;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1074; &#1076;&#1088;&#1091;&#1075;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; 
&#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1073;&#1099;&#1083;&#1072; &#1087;&#1077;&#1088;&#1077;&#1085;&#1077;&#1089;&#1077;&#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100;;
 </li><li> <b>visibilityChanged (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1074;&#1080;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074;&#1080;&#1076;&#1080;&#1084;&#1072;, &#1080; <b>False</b> - &#1077;&#1089;&#1083;&#1080; &#1089;&#1082;&#1088;&#1099;&#1090;&#1072;;
 </li><li> <b>topLevelChanged (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1095;&#1077;&#1088;&#1077;&#1079; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074;&#1099;&#1085;&#1077;&#1089;&#1077;&#1085;&#1072; &#1074; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;, &#1080; <b>False</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1072; &#1082; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1079;&#1072;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1084; &#1085;&#1077;&#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (&#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1074;&#1079;&#1103;&#1090; &#1079;&#1076;&#1077;&#1089;&#1100;: <a href="https://pythonpyqt.com/qdockwidget/" target="_blank"><b>https://pythonpyqt.com/qdockwidget/</b></a>).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
<b>QDockWidget</b> - &#1101;&#1090;&#1086; &#1086;&#1082;&#1086;&#1085;&#1085;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1100; &#1074; <b>QMainWindow</b>. &#1045;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1074; &#1087;&#1083;&#1072;&#1074;&#1072;&#1102;&#1097;&#1077;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080; &#1080;&#1083;&#1080; &#1087;&#1088;&#1080;&#1082;&#1088;&#1077;&#1087;&#1080;&#1090;&#1100; &#1082; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1084;&#1091; &#1086;&#1082;&#1085;&#1091; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1076;&#1086;&#1095;&#1077;&#1088;&#1085;&#1077;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077;. 
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; &#1085;&#1080;&#1078;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>QDockable</b> &#1089;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1086;&#1084; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1085;&#1077;&#1075;&#1086;. &#1042;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1090;&#1100; &#1077;&#1075;&#1086; &#1080; &#1087;&#1086;&#1083;&#1086;&#1078;&#1080;&#1090;&#1100; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1080; &#1090;. &#1076;.
</p><div class="fon"><pre>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtCore <span class="sl_sl">import</span> *
<span class="sl_sl">from</span> PyQt5.QtGui <span class="sl_sl">import</span> *
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> *

<span class="sl_sl">class</span> <span class="vyvod">DockDemo</span>(QMainWindow):
    <span class="sl_sl">def</span> __init__(self, parent=<span class="sl_sl">None</span>):
        <span class="tp">super</span>(DockDemo, self).__init__(parent)
        layout = QHBoxLayout()
        bar = self.menuBar()
        file = bar.addMenu(<span class="pech">'File'</span>)
        file.addAction(<span class="pech">'New'</span>)
        file.addAction(<span class="pech">'Save'</span>)
        file.addAction(<span class="pech">'quit'</span>)

        self.items = QDockWidget(<span class="pech">'Dockable'</span>, self)

        self.listWidget=QListWidget()
        self.listWidget.addItem(<span class="pech">'Item1'</span>)
        self.listWidget.addItem(<span class="pech">'Item2'</span>)
        self.listWidget.addItem(<span class="pech">'Item3'</span>)
        self.listWidget.addItem(<span class="pech">'Item4'</span>)

        self.items.setWidget(self.listWidget)
        self.items.setFloating(<span class="sl_sl">False</span>)
        self.setCentralWidget(QTextEdit())
        self.addDockWidget(Qt.RightDockWidgetArea, self.items)

        self.setLayout(layout)
        self.setWindowTitle(<span class="pech">'Dock'</span>)

<span class="sl_sl">if</span> __name__ == <span class="pech">'__main__'</span>:
    app = QApplication(sys.argv)
    demo = DockDemo()
    demo.show()
    sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr281_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris281_1.gif"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1101;&#1090;&#1086;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1077; &#1086;&#1082;&#1085;&#1086; - &#1101;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>QMainWindow</b>, &#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>QTextEdit</b> - &#1077;&#1075;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;.
</p><div class="fon"><pre>
        self.setCentralWidget(QTextEdit())
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1079;&#1072;&#1082;&#1088;&#1077;&#1087;&#1083;&#1103;&#1077;&#1084;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1086;&#1082;&#1085;&#1072;.
</p><div class="fon"><pre>
        self.items = QDockWidget(<span class="pech">'Dockable'</span>, self)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1090;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; <b>QListWidget</b> &#1074; &#1079;&#1072;&#1082;&#1088;&#1077;&#1087;&#1083;&#1077;&#1085;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;.
</p><div class="fon"><pre>
        self.listWidget=QListWidget()
        self.listWidget.addItem(<span class="pech">'Item1'</span>)
        self.listWidget.addItem(<span class="pech">'Item2'</span>)
        self.listWidget.addItem(<span class="pech">'Item3'</span>)
        self.listWidget.addItem(<span class="pech">'Item4'</span>)

        self.items.setWidget(self.listWidget)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_280.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav15.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_282.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>