<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_295.html]
* At UTC datetime: [2023-08-19 10:06:44.871833]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 295.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1052;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1047;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QAudioRecorder
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;, &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1102;, &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAudioRecorder</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1090;&#1100; &#1079;&#1074;&#1091;&#1082; &#1089; &#1084;&#1080;&#1082;&#1088;&#1086;&#1092;&#1086;&#1085;&#1072; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100; &#1077;&#1075;&#1086; &#1074; &#1072;&#1091;&#1076;&#1080;&#1086;&#1092;&#1072;&#1081;&#1083;&#1077; &#1074; &#1079;&#1072;&#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1074;&#1080;&#1076;&#1077;. &#1045;&#1075;&#1086; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1080;&#1090; &#1090;&#1072;&#1082;:
  (GObject, QMediaBindableInterface) - QMediaRecorder - QAudioRecorder 
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081;:
</p><div class="fon"><pre>
  &lt;&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;&gt; = QAudioRecorder([parent=<span class="sl_sl">None</span>])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>parent</b> &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1072; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1086;&#1083;&#1100;&#1096;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1100; &#1087;&#1086;&#1083;&#1077;&#1079;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; <b>QAudioRecorder</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1090; &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103; - <b>QMediaRecorder</b>. &#1069;&#1090;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085;&#1099; &#1076;&#1072;&#1083;&#1077;&#1077; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; 
<a href="https://doc.qt.io/qt-5/qmediarecorder.html" target="_blank"><b>https://doc.qt.io/qt-5/qmediarecorder.html</b></a> &#1080;
<a href="https://doc.qt.io/qt-5/qaudiorecorder.html" target="_blank"><b>https://doc.qt.io/qt-5/qaudiorecorder.html</b></a>):
</p><ul>
 <li> <b>setOutputLocation (&lt;QUrl&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1079;&#1074;&#1091;&#1082;;
<p align="JUSTIFY">
 </p></li><li> <b>setAudioInput (&lt;<i>&#1047;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1081; &#1074;&#1093;&#1086;&#1076;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1093;&#1086;&#1076;, &#1089; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1079;&#1074;&#1091;&#1082;. &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1093;&#1086;&#1076;&#1072; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setContainerFormat (&lt;<i>&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;  &#1092;&#1072;&#1081;&#1083;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; <b>MIME</b>-&#1090;&#1080;&#1087; &#1092;&#1072;&#1081;&#1083;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1099;&#1081; &#1079;&#1074;&#1091;&#1082;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setAudioSettings(&lt;QAudioEncoderSettings&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAudioEncoderSettings</b>;
<p align="JUSTIFY">
 </p></li><li> <b>setVolume (&lt;<i>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 (&#1079;&#1074;&#1091;&#1082; &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;) &#1076;&#1086; 100 (&#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1099;&#1081; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100;). &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>record ()</b> - &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090; &#1080;&#1083;&#1080; &#1074;&#1086;&#1079;&#1086;&#1073;&#1085;&#1086;&#1074;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>pause ()</b> - &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>stop ()</b> - &#1086;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1052;&#1077;&#1090;&#1086;&#1076; &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;;
<p align="JUSTIFY">
 </p></li><li> <b>setMetaData (&lt;<i>&#1050;&#1083;&#1102;&#1095;</i>&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1085;&#1086;&#1089;&#1080;&#1090; &#1074; &#1084;&#1077;&#1090;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1077;&#1084;&#1086;&#1075;&#1086; &#1092;&#1072;&#1081;&#1083;&#1072; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076; &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1084; &#1082;&#1083;&#1102;&#1095;&#1086;&#1084;. &#1044;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1082;&#1083;&#1102;&#1095;&#1080; &#1073;&#1099;&#1083;&#1080; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1099; 
&#1074; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>metaData()</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_289.html" target="_blank">289 &#1096;&#1072;&#1075;</a>);
<p align="JUSTIFY">
 </p></li><li> <b>defaultAudioInput ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091; &#1089; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;:
<div class="fon"><pre>
  <span class="tp">print</span>(ar.defaultAudioInput())
  <span class="comm">#  &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:</span>
  <span class="comm">#  &#1052;&#1080;&#1082;&#1088;&#1086;&#1092;&#1086;&#1085; (Webcam 200)</span>
</pre></div>
 </li><li> <b>audioInputs ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1074;&#1089;&#1077;&#1093; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1093;&#1089;&#1103; &#1074; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1077; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1099;&#1093; &#1074;&#1093;&#1086;&#1076;&#1086;&#1074;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1084;&#1080;:
<div class="fon"><pre>
  ar = QtMultimedia.QAudioRecorder() 
  <span class="sl_sl">for</span> f <span class="sl_sl">in</span> ar.audioInputs(): 
      <span class="tp">print</span>(f)
  <span class="comm">#  &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:</span>
  <span class="comm">#  &#1052;&#1080;&#1082;&#1088;&#1086;&#1092;&#1086;&#1085; (Webcam 200)</span>
</pre></div>
 </li><li> <b>supportedContainers ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;    &#1089;&#1087;&#1080;&#1089;&#1086;&#1082;    &#1074;&#1089;&#1077;&#1093;    &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093;    &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; <b>QAudioRecorder</b> <b>MIME</b>-&#1090;&#1080;&#1087;&#1086;&#1074; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;, &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;:
<div class="fon"><pre>
  <span class="sl_sl">for</span> f <span class="sl_sl">in</span> ar.supportedContainers():
      <span class="tp">print</span>(f, end=<span class="pech">" "</span>)
  <span class="comm"># &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;: audio/x-wav audio/x-raw </span>
</pre></div>
&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1080;&#1084;, &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; <b>WAV</b> &#1080; <b>RAW</b>;
<p align="JUSTIFY">
 </p></li><li> <b>supportedAudioCodecs ()</b> - &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081; &#1074;&#1089;&#1077;&#1093; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; <b>QAudioRecorder</b> &#1072;&#1091;&#1076;&#1080;&#1086;&#1082;&#1086;&#1076;&#1077;&#1082;&#1086;&#1074;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;:
<div class="fon"><pre>
  <span class="sl_sl">for</span> f <span class="sl_sl">in</span> ar.supportedAudioCodecs():
      <span class="tp">print</span>(f, end=<span class="pech">" "</span>)
  <span class="comm">#  &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;:   audio/pcm</span>
</pre></div>
&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1083;&#1080;&#1096;&#1100; &#1082;&#1086;&#1076;&#1077;&#1082; <b>PCM</b> - &#1089;&#1072;&#1084;&#1099;&#1081; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1081; &#1080;&#1079; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1093; &#1093;&#1086;&#1078;&#1076;&#1077;&#1085;&#1080;&#1077;;
 </li><li> <b>supportedAudioSampleRates ([settings=QAudioEncoderSettings()])</b> - &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090;  &#1091;&#1079;&#1085;&#1072;&#1090;&#1100; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1074; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>settings</b> &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAudioEncoderSettings</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1099; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099;, &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1077; &#1076;&#1083;&#1103; &#1101;&#1090;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1081; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; &#1082;&#1086;&#1088;&#1090;&#1077;&#1078;, &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; - &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;. &#1042;&#1090;&#1086;&#1088;&#1086;&#1081; &#1101;&#1083;&#1077;&#1084;&#1077;&#1085;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084; <b>True</b>, &#1077;&#1089;&#1083;&#1080; 
&#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1099;&#1077; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1099; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1080;&#1083;&#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  sr = ar.supportedAudioSampleRates()
  <span class="sl_sl">for</span> f <span class="sl_sl">in</span> sr[0]:
      <span class="tp">print</span>(f, end=<span class="pech">" "</span>)
  <span class="tp">print</span>()
  <span class="tp">print</span>(sr[1])
  <span class="comm">#  &#1042;&#1099;&#1074;&#1077;&#1076;&#1077;&#1090;:</span>
  <span class="comm">#  8000 11025 22050 44100 48000 96000</span>
  <span class="comm">#  False</span>
</pre></div>
 </li><li> <b>duration ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1084;&#1080;&#1083;&#1083;&#1080;&#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1072;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>volume ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1091;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1095;&#1080;&#1089;&#1083;&#1072; &#1086;&#1090; 0 &#1076;&#1086; 100;
<p align="JUSTIFY">
 </p></li><li> <b>state ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaRecorder</b>:
<ul>
 <li> <b>StoppedState  (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1085;&#1077; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1083;&#1072;&#1089;&#1100; &#1080;&#1083;&#1080; &#1073;&#1099;&#1083;&#1072; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;;
 </li><li> <b>RecordingState (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1080;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;;
 </li><li> <b>PausedState (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>status ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaRecorder</b>:
<ul>
 <li> <b>UnavailableStatus (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1085;&#1077; &#1091;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103;, &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072;, &#1080;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;;
 </li><li> <b>UnloadedStatus (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1085;&#1077;&#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1072;;
 </li><li> <b>LoadingStatus (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1072;&#1082;&#1090;&#1080;&#1074;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103;;
 </li><li> <b>LoadedStatus (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1072;;
 </li><li> <b>StartingStatus (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;;
 </li><li> <b>RecordingStatus (<i>&#1080;&#1083;&#1080;</i> 5)</b> - &#1080;&#1076;&#1077;&#1090; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;;
 </li><li> <b>PausedStatus (<i>&#1080;&#1083;&#1080;</i> 6)</b> - &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;;
 </li><li> <b>FinalizingStatus (<i>&#1080;&#1083;&#1080;</i> 7)</b> - &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1072;, &#1080; &#1080;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077; &#1072;&#1091;&#1076;&#1080;&#1086;&#1092;&#1072;&#1081;&#1083;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>error ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1086;&#1096;&#1080;&#1073;&#1082;&#1091;, &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1096;&#1091;&#1102; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;, &#1074; &#1074;&#1080;&#1076;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMediaRecorder</b>:
<ul>
 <li> <b>NoError (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1085;&#1080;&#1082;&#1072;&#1082;&#1086;&#1081; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080; &#1085;&#1077; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1083;&#1086;;
 </li><li> <b>ResourceError (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1072; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1080;&#1083;&#1080; &#1085;&#1077; &#1075;&#1086;&#1090;&#1086;&#1074;&#1072; &#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077;;
 </li><li> <b>FormatError (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1079;&#1072;&#1076;&#1072;&#1085;&#1099; &#1085;&#1077;&#1076;&#1086;&#1087;&#1091;&#1089;&#1090;&#1080;&#1084;&#1099;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;;
 </li><li> <b>OutOfSpaceError (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1084;&#1077;&#1089;&#1090;&#1072; &#1076;&#1083;&#1103; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1103; &#1072;&#1091;&#1076;&#1080;&#1086;&#1092;&#1072;&#1081;&#1083;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>errorString ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1086;&#1096;&#1080;&#1073;&#1082;&#1080;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAudioRecorder</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1076;&#1086;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086; &#1084;&#1085;&#1086;&#1075;&#1086; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1080;&#1079; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1085;&#1072;&#1089; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1091;&#1102;&#1090; &#1083;&#1080;&#1096;&#1100; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1093; 
<a href="https://doc.qt.io/qt-5/qmediarecorder.html" target="_blank"><b>https://doc.qt.io/qt-5/qmediarecorder.html</b></a> &#1080;
<a href="https://doc.qt.io/qt-5/qaudiorecorder.html" target="_blank"><b>https://doc.qt.io/qt-5/qaudiorecorder.html</b></a>):
</p><ul>
 <li> <b>durationChanged (&lt;<i>&#1055;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1080;, &#1079;&#1072;&#1076;&#1072;&#1085;&#1085;&#1086;&#1077; &#1094;&#1077;&#1083;&#1099;&#1084; &#1095;&#1080;&#1089;&#1083;&#1086;&#1084;;
 </li><li> <b>stateChanged (&lt;<i>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;;
 </li><li> <b>statusChanged (&lt;<i>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1083;&#1086;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1080;&#1076;&#1077;&#1085;&#1090;&#1080;&#1092;&#1080;&#1082;&#1072;&#1090;&#1086;&#1088; &#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;;
 </li><li> <b>volumeChanged (&lt;<i>&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;</i>&gt;)</b> - &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1087;&#1088;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1080; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1086;&#1074;&#1086;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1094;&#1077;&#1083;&#1086;&#1075;&#1086; &#1095;&#1080;&#1089;&#1083;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QAudioEncoderSettings</b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_294.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_296.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>