<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_042.html]
* At UTC datetime: [2023-08-19 09:55:52.521281]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 42.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1086;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;. &#1042;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1099; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072; (&#1080;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;) &#1084;&#1086;&#1078;&#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>palette()</b>, &#1072; &#1079;&#1072;&#1090;&#1077;&#1084; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>setBrush()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPalette</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  setBrush ([&lt;<i>&#1057;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</i>&gt;, ]&lt;<i>&#1056;&#1086;&#1083;&#1100;</i>&gt;, &lt;QBrush&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1099; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072;&#1084; &#1074; &#1084;&#1077;&#1090;&#1086;&#1076;&#1077; <b>setColor()</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077;. &#1042; &#1090;&#1088;&#1077;&#1090;&#1100;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1080;&#1089;&#1090;&#1100; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QBrush</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100; &#1082;&#1080;&#1089;&#1090;&#1080;</i>&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;[, &lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100; &#1082;&#1080;&#1089;&#1090;&#1080;</i>&gt;=SolidPattern])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;, &lt;QPixmap&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;QPixmap&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;QImage&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;QBrush&gt;)
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QBrush(&lt;QGradient&gt;)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1057;&#1090;&#1080;&#1083;&#1100; &#1082;&#1080;&#1089;&#1090;&#1080;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077; &#1089;&#1090;&#1080;&#1083;&#1100; 
&#1082;&#1080;&#1089;&#1090;&#1080;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <b>NoBrush, SolidPattern, DenselPattern, Dense2Pattern, Dense3Pattern, Dense4Pattern, Dense5Pattern, Dense6Pattern, Dense7Pattern, CrossPattern</b> &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077;. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; 
&#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1094;&#1074;&#1077;&#1090; &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1099;&#1084; (<b>SolidPattern</b>) &#1080;&#1083;&#1080; &#1080;&#1084;&#1077;&#1102;&#1097;&#1080;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1091; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>CrossPattern</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;&#1091;&#1088;&#1091; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1077;&#1090;&#1082;&#1080;). &#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081; &#1087;&#1088;&#1086;&#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1086; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris42_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1099;&#1093; &#1089;&#1090;&#1080;&#1083;&#1077;&#1081;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1062;&#1074;&#1077;&#1090;</i>&gt;</b> &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1094;&#1074;&#1077;&#1090; &#1082;&#1080;&#1089;&#1090;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>black</b>, <b>white</b> &#1080; &#1090;. &#1076;.) &#1080;&#1083;&#1080; 
&#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QColor</b> (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QColor("red")</b>, <b>QColor("#ff0000")</b>, <b>QColor(255, 0, 0)</b> &#1080; &#1076;&#1088;.). &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1089;&#1087;&#1083;&#1086;&#1096;&#1085;&#1086;&#1075;&#1086; &#1094;&#1074;&#1077;&#1090;&#1072; &#1092;&#1086;&#1085;&#1072; &#1086;&#1082;&#1085;&#1072; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1099;&#1075;&#1083;&#1103;&#1076;&#1077;&#1090;&#1100; &#1090;&#1072;&#1082;:
</p><div class="fon"><pre>
pal = window.palette()
pal.setBrush(QtGui.QPaiette.Normal, QtGui.QPaietteWindow,
  QtGui.QBrush(QtGui.QColor(<span class="pech">"#008800"</span>), QtCore.Qt.SolidPattern)) 
window.setPalette(pal)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; <b>&lt;QPixmap&gt;</b> &#1080; <b>&lt;QImage&gt;</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1102;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1081;. &#1050;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1099; &#1101;&#1090;&#1080;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1102;&#1090; &#1087;&#1091;&#1090;&#1100; &#1082; &#1092;&#1072;&#1081;&#1083;&#1091;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1082;&#1072;&#1082; &#1072;&#1073;&#1089;&#1086;&#1083;&#1102;&#1090;&#1085;&#1099;&#1084;, 
&#1090;&#1072;&#1082; &#1080; &#1086;&#1090;&#1085;&#1086;&#1089;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1084;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;QBrush&gt;</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1082;&#1080;&#1089;&#1090;&#1100; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1076;&#1088;&#1091;&#1075;&#1086;&#1081; &#1082;&#1080;&#1089;&#1090;&#1080;, &#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;QGradient&gt;</b> - &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1077; &#1075;&#1088;&#1072;&#1076;&#1080;&#1077;&#1085;&#1090;&#1072;, &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1086;&#1075;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QGradient</b> (&#1101;&#1090;&#1086; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1087;&#1086;&#1079;&#1078;&#1077;).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1089;&#1083;&#1077; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1099; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setPalette()</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1085;&#1099;&#1081; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1099;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;-&#1087;&#1086;&#1090;&#1086;&#1084;&#1082;&#1080; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; &#1080;&#1084;&#1077;&#1102;&#1090; 
&#1087;&#1088;&#1086;&#1079;&#1088;&#1072;&#1095;&#1085;&#1099;&#1081; &#1092;&#1086;&#1085; &#1080; &#1085;&#1077; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1088;&#1080;&#1089;&#1086;&#1074;&#1082;&#1091;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b> &#1074; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setAutoFillBackground()</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100;, &#1082;&#1072;&#1082;&#1086;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1085;&#1072;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>CSS</b>-&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; <b>background</b> &#1080; <b>background-image</b>. &#1057; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>CSS</b>-&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; 
<b>background-repeat</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1072; &#1092;&#1086;&#1085;&#1086;&#1074;&#1086;&#1075;&#1086; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1072;. &#1054;&#1085; &#1084;&#1086;&#1078;&#1077;&#1090; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; <b>repeat</b>, <b>repeat-x</b> (&#1087;&#1086;&#1074;&#1090;&#1086;&#1088; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;), 
<b>repeat-y</b> (&#1087;&#1086;&#1074;&#1090;&#1086;&#1088; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;) &#1080; <b>no-repeat</b> (&#1085;&#1077; &#1087;&#1086;&#1074;&#1090;&#1086;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103;).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1086;&#1082;&#1085;&#1086; &#1089; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;&#1102;. &#1044;&#1083;&#1103; &#1072;&#1082;&#1090;&#1080;&#1074;&#1085;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072; &#1091;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1086;&#1076;&#1085;&#1086; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1083;&#1080;&#1090;&#1088;&#1099;), &#1072; &#1076;&#1083;&#1103; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; - &#1076;&#1088;&#1091;&#1075;&#1086;&#1077; (&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>CSS</b>-&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072; <b>background-image</b>).
</p><div class="fon"><pre>
<span class="comm">#  -*- coding:  utf-8  -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtGui, QtWidgets
<span class="sl_sl">import</span> sys
app = QtWidgets.QApplication(sys.argv)
window = QtWidgets.QWidget()
window.setWindowTitle(<span class="pech">"&#1048;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1092;&#1086;&#1085;&#1072;"</span>)
window.resize(300, 200)
pal = window.palette()
pal.setBrush(QtGui.QPalette.Normal, QtGui.QPalette.Window, 
    QtGui.QBrush(QtGui.QPixmap(<span class="pech">"img2.jpg"</span>)))
window.setPalette(pal)
label = QtWidgets.QLabel(<span class="pech">"&#1058;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;"</span>)
label.setAlignment(QtCore.Qt.AlignCenter)
<span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1085;&#1080;&#1077; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080; &#1094;&#1074;&#1077;&#1090;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;</span>
label.setStyleSheet(<span class="pech">"background-image: url(cartitle.jpg); color: white;"</span>)
label.setAutoFillBackground(<span class="sl_sl">True</span>)
vbox = QtWidgets.QVBoxLayout()
vbox.addWidget(label)
window.setLayout(vbox)
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1072;&#1084;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr42_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 2.
</p><p align="CENTER"><img src="images/ris42_2.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.2. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1099;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_041.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_043.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>