<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_128.html]
* At UTC datetime: [2023-08-19 09:59:35.796335]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 128.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1055;&#1086;&#1083;&#1086;&#1089;&#1072; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1072;, &#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QScrollBar</b> &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1080;&#1083;&#1080; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1087;&#1086;&#1083;&#1086;&#1089;&#1091; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072; &#1085;&#1072; &#1087;&#1086;&#1083;&#1086;&#1089;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;, &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1085;&#1099;&#1077; &#1087;&#1086; &#1082;&#1088;&#1072;&#1103;&#1084; &#1087;&#1086;&#1083;&#1086;&#1089;&#1099;, 
&#1097;&#1077;&#1083;&#1095;&#1082;&#1072;&#1084;&#1080; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1087;&#1086;&#1083;&#1086;&#1089;&#1077;, &#1089;&#1086;&#1073;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;&#1084; &#1087;&#1086;&#1083;&#1079;&#1091;&#1085;&#1082;&#1072; &#1084;&#1099;&#1096;&#1100;&#1102;, &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1077;&#1084; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096; &#1085;&#1072; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1077;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; &#1080;&#1079; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1085;&#1102;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;:
</p><div class="fon"><pre>
  (QObject, QPaintDevice) - QWidget - QAbstractslider - QScrollBar
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QScrollBar</b>:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QScrollBar([parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;])
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QScroilBar(&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;[, parent=&lt;<i>&#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;</i>&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1054;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1103;</i>&gt;</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1102; &#1087;&#1086;&#1083;&#1086;&#1089;&#1099; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; <b>Horizontal</b> &#1080;&#1083;&#1080; <b>Vertical</b> (&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QScrollBar</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1089;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1080;&#1079; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAbstractSlider</b> (&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_125.html" target="_blank">125 &#1096;&#1072;&#1075;</a>) &#1080; &#1085;&#1077; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1076;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;.
</p><p align="JUSTIFY">
</p><hr><i>
&#160;&#160;&#160;<b><i><u>&#1055;&#1088;&#1080;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</u>.</i></b> 
&#1055;&#1086;&#1083;&#1086;&#1089;&#1072; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080; &#1088;&#1077;&#1076;&#1082;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;. &#1043;&#1086;&#1088;&#1072;&#1079;&#1076;&#1086; &#1091;&#1076;&#1086;&#1073;&#1085;&#1077;&#1077; &#1074;&#1086;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;&#1102; &#1089; &#1087;&#1086;&#1083;&#1086;&#1089;&#1072;&#1084;&#1080; &#1087;&#1088;&#1086;&#1082;&#1088;&#1091;&#1090;&#1082;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QScrollArea</b> 
(&#1089;&#1084;. <a href="https://it.kgsu.ru/Python_Qt/pyqt5_097.html" target="_blank">97 &#1096;&#1072;&#1075;</a>).
</i><hr>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b>Web<i>-&#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_127.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav7.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_129.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>