<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_006.html]
* At UTC datetime: [2023-08-19 09:54:14.428761]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 6.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1086;&#1082;&#1085;&#1072; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; Qt Designer. &#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1095;&#1072;&#1083;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;  </i>Qt Designer</b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1074;&#1099; &#1088;&#1072;&#1085;&#1077;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1083;&#1080;&#1089;&#1100; <b>Visual Studio</b> &#1080;&#1083;&#1080; <b>Delphi</b>, &#1090;&#1086; &#1074;&#1089;&#1087;&#1086;&#1084;&#1085;&#1080;&#1090;&#1077;, &#1082;&#1072;&#1082; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1083;&#1080; &#1085;&#1072; &#1092;&#1086;&#1088;&#1084;&#1077; &#1088;&#1072;&#1079;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;: &#1074;&#1099; &#1097;&#1077;&#1083;&#1082;&#1072;&#1083;&#1080; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; 
&#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1077;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1083;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072; &#1092;&#1086;&#1088;&#1084;&#1091;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1080;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1088;&#1072; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1083;&#1080; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1091; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1081; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1093; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;, &#1072; &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1077; 
&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1083;&#1080; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1074;&#1077;&#1089;&#1100; &#1082;&#1086;&#1076; &#1075;&#1077;&#1085;&#1077;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1083;&#1089;&#1103; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;. &#1055;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1089;&#1090;&#1080; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1074; <b>PyQt</b> &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <b>Qt Designer</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; 
&#1074;&#1093;&#1086;&#1076;&#1080;&#1090; &#1074; &#1089;&#1086;&#1089;&#1090;&#1072;&#1074; &#1101;&#1090;&#1086;&#1081; &#1073;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1080;.
</p><h2>&#1057;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099;</h2>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099; <b>Qt Designer</b> &#1074; &#1084;&#1077;&#1085;&#1102; <b><i>&#1055;&#1091;&#1089;&#1082;</i></b> &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090; <b><i>&#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</i></b> (&#1080;&#1083;&#1080; <b><i>&#1042;&#1089;&#1077; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</i></b>) | 
<b>PyQt GPL v5.4.1 for Python v3.4 (x32)</b> (&#1080;&#1083;&#1080; <b>PyQt GPL v5.4.1 for Python v3.4 (x64)</b>) | <b>Designer</b>, &#1074; &#1086;&#1082;&#1085;&#1077; <b><i>&#1053;&#1086;&#1074;&#1072;&#1103; &#1092;&#1086;&#1088;&#1084;&#1072;</i></b> &#1086;&#1090;&#1082;&#1088;&#1099;&#1074;&#1096;&#1077;&#1075;&#1086;&#1089;&#1103; &#1086;&#1082;&#1085;&#1072; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1) &#1074;&#1099;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; 
&#1087;&#1091;&#1085;&#1082;&#1090; <b>Widget</b> &#1080; &#1085;&#1072;&#1078;&#1080;&#1084;&#1072;&#1077;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; <b><i>&#1057;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100;</i></b> - &#1086;&#1090;&#1082;&#1088;&#1086;&#1077;&#1090;&#1089;&#1103; &#1086;&#1082;&#1085;&#1086; &#1089; &#1087;&#1091;&#1089;&#1090;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1086;&#1081;, &#1085;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1089;&#1082;&#1080;&#1074;&#1072;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1080;&#1079; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1086;&#1074;.
</p><p align="CENTER"><img src="images/ris6_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1055;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072; <b>Qt Designer</b></font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1076;&#1086;&#1073;&#1072;&#1074;&#1080;&#1084; &#1085;&#1072; &#1092;&#1086;&#1088;&#1084;&#1091; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1072; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; <b><i>&#1055;&#1072;&#1085;&#1077;&#1083;&#1100; &#1074;&#1080;&#1076;&#1078;&#1077;&#1090;&#1086;&#1074;</i></b> &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <b>Display Widgets</b> &#1097;&#1077;&#1083;&#1082;&#1085;&#1077;&#1084; &#1083;&#1077;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1087;&#1091;&#1085;&#1082;&#1090;&#1077; <b>Label</b> &#1080;, 
&#1085;&#1077; &#1086;&#1090;&#1087;&#1091;&#1089;&#1082;&#1072;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1084;&#1099;&#1096;&#1080;, &#1087;&#1077;&#1088;&#1077;&#1090;&#1072;&#1097;&#1080;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1085;&#1072; &#1092;&#1086;&#1088;&#1084;&#1091;. &#1047;&#1072;&#1090;&#1077;&#1084; &#1087;&#1088;&#1086;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1091;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1102; &#1089; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1084; <b>Push Button</b>, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1084;&#1089;&#1103; &#1074; &#1075;&#1088;&#1091;&#1087;&#1087;&#1077; <b>Buttons</b>, &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1089;&#1090;&#1080;&#1084; &#1077;&#1075;&#1086; &#1085;&#1080;&#1078;&#1077; 
&#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1084; &#1086;&#1076;&#1085;&#1086;&#1074;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1086; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1083;&#1102;&#1073;&#1086;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1077; &#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090; <b><i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1082;&#1072; | &#1057;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086; &#1074;&#1077;&#1088;&#1090;&#1080;&#1082;&#1072;&#1083;&#1080;</i></b>. 
&#1063;&#1090;&#1086;&#1073;&#1099; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1083;&#1080; &#1074;&#1089;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100; &#1092;&#1086;&#1088;&#1084;&#1099;, &#1097;&#1077;&#1083;&#1082;&#1085;&#1077;&#1084; &#1087;&#1088;&#1072;&#1074;&#1086;&#1081; &#1082;&#1085;&#1086;&#1087;&#1082;&#1086;&#1081; &#1084;&#1099;&#1096;&#1080; &#1085;&#1072; &#1089;&#1074;&#1086;&#1073;&#1086;&#1076;&#1085;&#1086;&#1084; &#1084;&#1077;&#1089;&#1090;&#1077; &#1092;&#1086;&#1088;&#1084;&#1099; &#1080; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1082;&#1089;&#1090;&#1085;&#1086;&#1084; &#1084;&#1077;&#1085;&#1102; &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; &#1087;&#1091;&#1085;&#1082;&#1090; <b><i>&#1050;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1082;&#1072; | &#1057;&#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1072;&#1090;&#1100; &#1087;&#1086; &#1075;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1080;</i></b>.
</p><p align="CENTER"><img src="images/ris6_2.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.2. &#1060;&#1086;&#1088;&#1084;&#1072; &#1087;&#1086;&#1089;&#1083;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1086;&#1074;&#1086;&#1082;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1084; &#1085;&#1077;&#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1086;&#1082;&#1085;&#1072;. &#1044;&#1083;&#1103; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; <b><i>&#1048;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b> (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 3) &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1084; &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1087;&#1091;&#1085;&#1082;&#1090; (<b>Form</b>), &#1087;&#1077;&#1088;&#1077;&#1081;&#1076;&#1077;&#1084; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1100; <b><i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i></b> (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 4), 
&#1085;&#1072;&#1081;&#1076;&#1077;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <b>objectName</b> &#1080; &#1089;&#1087;&#1088;&#1072;&#1074;&#1072; &#1086;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1074;&#1074;&#1077;&#1076;&#1077;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>MyForm</b>. 
</p><p align="CENTER"><img src="images/ris6_3.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.3. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; <b><i>&#1048;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b></font></p>
<p align="CENTER"><img src="images/ris6_4.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.4. &#1055;&#1072;&#1085;&#1077;&#1083;&#1100; <b><i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i></b></font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1090;&#1077;&#1084; &#1085;&#1072;&#1081;&#1076;&#1077;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <b>geometry</b>, &#1097;&#1077;&#1083;&#1082;&#1085;&#1077;&#1084; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1077; &#1091;&#1075;&#1086;&#1083;&#1082;&#1072; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1080; &#1079;&#1072;&#1076;&#1072;&#1076;&#1080;&#1084; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1088;&#1072;&#1074;&#1085;&#1086;&#1081; 300, &#1072; &#1074;&#1099;&#1089;&#1086;&#1090;&#1091; &#1088;&#1072;&#1074;&#1085;&#1086;&#1081; 70 (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 4), - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1092;&#1086;&#1088;&#1084;&#1099; 
&#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1089;&#1103;. &#1059;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <b>windowTitle</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1063;&#1090;&#1086;&#1073;&#1099; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1099;&#1096;&#1080; &#1080;&#1083;&#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1090;&#1100; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1077;&#1084;&#1091; &#1087;&#1091;&#1085;&#1082;&#1090; &#1074; &#1087;&#1072;&#1085;&#1077;&#1083;&#1080; <b><i>&#1048;&#1085;&#1089;&#1087;&#1077;&#1082;&#1090;&#1086;&#1088; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</i></b>. &#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1084; 
&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <b>objectName</b> &#1085;&#1072; label, &#1072; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; <b>text</b> &#1091;&#1082;&#1072;&#1078;&#1077;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1053;&#1072;&#1081;&#1076;&#1077;&#1084; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1086; <b>alignment</b>, &#1097;&#1077;&#1083;&#1082;&#1085;&#1077;&#1084; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1079;&#1085;&#1072;&#1095;&#1082;&#1077; &#1091;&#1075;&#1086;&#1083;&#1082;&#1072; &#1089;&#1083;&#1077;&#1074;&#1072;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1089;&#1082;&#1088;&#1099;&#1090;&#1099;&#1077; 
&#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072;, &#1080; &#1091;&#1082;&#1072;&#1078;&#1077;&#1084; &#1076;&#1083;&#1103; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <b><i>&#1043;&#1086;&#1088;&#1080;&#1079;&#1086;&#1085;&#1090;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077;</i></b> &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>AlignHCenter</b>. 
</p><p align="CENTER"><img src="images/ris6_5.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.5. <b><i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i></b> &#1076;&#1083;&#1103; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1058;&#1077;&#1087;&#1077;&#1088;&#1100; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1084; &#1082;&#1085;&#1086;&#1087;&#1082;&#1091; &#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1084; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1072; <b>objectName</b> &#1085;&#1072; <b>btnQuit</b>, &#1072; &#1074; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;&#1077; <b>text</b> &#1091;&#1082;&#1072;&#1078;&#1077;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1072;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1085;&#1072; &#1082;&#1085;&#1086;&#1087;&#1082;&#1077;.
</p><p align="CENTER"><img src="images/ris6_6.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.5. <b><i>&#1056;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088; &#1089;&#1074;&#1086;&#1081;&#1089;&#1090;&#1074;</i></b> &#1076;&#1083;&#1103; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1089;&#1090;&#1072;&#1090;&#1080;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1080;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1080;&#1083;&#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086;, &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1080;&#1074; &#1076;&#1074;&#1086;&#1081;&#1085;&#1086;&#1081; &#1097;&#1077;&#1083;&#1095;&#1086;&#1082; &#1084;&#1099;&#1096;&#1100;&#1102; &#1085;&#1072; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1074;, &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1084; &#1074; &#1084;&#1077;&#1085;&#1102; <b><i>&#1060;&#1072;&#1081;&#1083;</i></b> &#1087;&#1091;&#1085;&#1082;&#1090; <b><i>&#1057;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;</i></b> &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1084; &#1075;&#1086;&#1090;&#1086;&#1074;&#1091;&#1102; &#1092;&#1086;&#1088;&#1084;&#1091; &#1074; &#1092;&#1072;&#1081;&#1083; <b>MyForm.ui</b>. &#1055;&#1088;&#1080; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1074;&#1085;&#1077;&#1089;&#1090;&#1080; &#1074; &#1101;&#1090;&#1086;&#1090; &#1092;&#1072;&#1081;&#1083; &#1082;&#1072;&#1082;&#1080;&#1077;-&#1083;&#1080;&#1073;&#1086; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;, 
&#1077;&#1075;&#1086; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077; <b>Qt Designer</b>, &#1074;&#1099;&#1073;&#1088;&#1072;&#1074; &#1074; &#1084;&#1077;&#1085;&#1102; <b><i>&#1060;&#1072;&#1081;&#1083;</i></b> &#1087;&#1091;&#1085;&#1082;&#1090; <b><i>&#1054;&#1090;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1079;&#1072;&#1075;&#1088;&#1091;&#1079;&#1082;&#1091;</i> ui-<i>&#1092;&#1072;&#1081;&#1083;&#1072; &#1074; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1077;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_005.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_007.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>