<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_004.html]
* At UTC datetime: [2023-08-19 09:54:06.999210]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 4.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1047;&#1085;&#1072;&#1082;&#1086;&#1084;&#1089;&#1090;&#1074;&#1086; &#1089; PyQt5. &#1054;&#1054;&#1055;-&#1089;&#1090;&#1080;&#1083;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1086;&#1089;&#1086;&#1073;&#1077;&#1085;&#1085;&#1086;&#1089;&#1090;&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072; &#1074; &#1089;&#1090;&#1080;&#1083;&#1077; &#1054;&#1054;&#1055;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; <b>PyQt</b> &#1085;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1072; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1085;&#1086;-&#1086;&#1088;&#1080;&#1077;&#1085;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1089;&#1090;&#1080;&#1083;&#1077; (&#1054;&#1054;&#1055;-&#1089;&#1090;&#1080;&#1083;&#1077;) &#1080; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1089;&#1086;&#1090;&#1077;&#1085; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;. &#1048;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1089;&#1077;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1083;&#1080;&#1096;&#1082;&#1086;&#1084; &#1073;&#1086;&#1083;&#1100;&#1096;&#1086;&#1081; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;. 
&#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080;, &#1087;&#1088;&#1080; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080;&#1077;&#1088;&#1072;&#1088;&#1093;&#1080;&#1103; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1082;&#1086;&#1085;&#1082;&#1088;&#1077;&#1090;&#1085;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1074;&#1099;&#1074;&#1077;&#1076;&#1077;&#1084; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>:
</p><div class="fon"><pre>
&gt;&gt;&gt; <span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets
&gt;&gt;&gt; QtWidgets.QWidget.__bases__
<span class="vyvod">(&lt;class 'PyQt5.QtCore.QObject'&gt;, &lt;class 'PyQt5.QtGui.QPaintDevice'&gt;)</span>
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1082; &#1074;&#1080;&#1076;&#1085;&#1086; &#1080;&#1079; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1076;&#1074;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;: <b>QObject</b> &#1080; <b>QPaintDevice</b>. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QObject</b> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; &#1074;&#1077;&#1088;&#1093;&#1085;&#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;, &#1080; &#1077;&#1075;&#1086; &#1074; <b>PyQt</b> &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1090; 
&#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074;. &#1042; &#1089;&#1074;&#1086;&#1102; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b> &#1103;&#1074;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1084; &#1076;&#1083;&#1103; &#1074;&#1089;&#1077;&#1093; &#1074;&#1080;&#1079;&#1091;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074;.
</p><p align="JUSTIFY">
</p><hr><i>
&#160;&#160;&#160;<b><i><u>&#1047;&#1072;&#1084;&#1077;&#1095;&#1072;&#1085;&#1080;&#1077;</u>.</i></b> 
&#1042; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1080; &#1082;&#1072;&#1078;&#1076;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>PyQt</b> &#1087;&#1088;&#1080;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1086;&#1087;&#1080;&#1089;&#1072;&#1085;&#1080;&#1077; &#1083;&#1080;&#1096;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1083;&#1086;&#1090;&#1086;&#1074;, &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1085;&#1077;&#1087;&#1086;&#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089;&#1077;. &#1040;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099; &#1080; 
&#1089;&#1083;&#1086;&#1090;&#1099; &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1093; &#1082;&#1083;&#1072;&#1089;&#1089;&#1086;&#1074; &#1090;&#1072;&#1084; &#1085;&#1077; &#1086;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; - &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1090; &#1083;&#1080;&#1096;&#1100; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1077; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1099; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;.</i><hr>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1089;&#1074;&#1086;&#1080;&#1093; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;&#1093; &#1074;&#1099; &#1084;&#1086;&#1078;&#1077;&#1090;&#1077; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089;&#1090;&#1072;&#1085;&#1076;&#1072;&#1088;&#1090;&#1085;&#1099;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099; &#1080; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1085;&#1086;&#1074;&#1091;&#1102; &#1092;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1087;&#1077;&#1088;&#1077;&#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084; &#1082;&#1086;&#1076; &#1080;&#1079; <a href="https://it.kgsu.ru/Python_Qt/pyqt5_002.html" target="_blank">2 &#1096;&#1072;&#1075;&#1072;</a> 
&#1080; &#1089;&#1086;&#1079;&#1076;&#1072;&#1076;&#1080;&#1084; &#1086;&#1082;&#1085;&#1086; &#1074; &#1054;&#1054;&#1055;-&#1089;&#1090;&#1080;&#1083;&#1077;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__ </span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent)
        self.label = QtWidgets.QLabel(<span class="pech">"&#1055;&#1088;&#1080;&#1074;&#1077;&#1090;, &#1084;&#1080;&#1088;!"</span>)
        self.label.setAlignment(QtCore.Qt.AlignHCenter)
        self.btnQuit = QtWidgets.QPushButton (<span class="pech">"&amp;&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100; &#1086;&#1082;&#1085;&#1086;"</span>)
        self.vbox = QtWidgets.QVBoxLayout()
        self.vbox.addWidget(self.label)
        self.vbox.addWidget(self.btnQuit)
        self.setLayout(self.vbox)
        self.btnQuit.clicked.connect(QtWidgets.qApp.quit)

<span class="sl_sl">if</span> __name__ == <span class="pech">"__main__"</span> :
    <span class="sl_sl">import</span> sys
    app = QtWidgets.QApplication(sys.argv)
    window = MyWindow()  <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</span>
    window.setWindowTitle(<span class="pech">"&#1054;&#1054;&#1055;-&#1089;&#1090;&#1080;&#1083;&#1100; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1103; &#1086;&#1082;&#1085;&#1072;"</span>)
    window.resize(300, 70)
    window.show()        <span class="comm"># &#1054;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1077;&#1084; &#1086;&#1082;&#1085;&#1086;</span>
    sys.exit(app.exec_())<span class="comm"># &#1047;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;&#1077;&#1084; &#1094;&#1080;&#1082;&#1083; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;</span>
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr4_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1077;&#1088;&#1074;&#1099;&#1093; &#1076;&#1074;&#1091;&#1093; &#1089;&#1090;&#1088;&#1086;&#1082;&#1072;&#1093; &#1082;&#1086;&#1076;&#1072;, &#1082;&#1072;&#1082; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072; &#1092;&#1072;&#1081;&#1083;&#1072; &#1080; &#1087;&#1086;&#1076;&#1082;&#1083;&#1102;&#1095;&#1072;&#1102;&#1090;&#1089;&#1103; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1077; &#1084;&#1086;&#1076;&#1091;&#1083;&#1080;. &#1053;&#1072; &#1101;&#1090;&#1086;&#1090; &#1088;&#1072;&#1079;, &#1087;&#1086;&#1084;&#1080;&#1084;&#1086; &#1091;&#1078;&#1077; &#1079;&#1085;&#1072;&#1082;&#1086;&#1084;&#1086;&#1075;&#1086; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtWidgets</b>, &#1085;&#1072;&#1084; &#1087;&#1086;&#1085;&#1072;&#1076;&#1086;&#1073;&#1080;&#1090;&#1089;&#1103; &#1084;&#1086;&#1076;&#1091;&#1083;&#1100; 
<b>QtCore</b>, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084; &#1086;&#1073;&#1098;&#1103;&#1074;&#1083;&#1077;&#1085;&#1099; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077;, &#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077;, &#1080; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1077; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1072;&#1083;&#1077;&#1077; &#1084;&#1099; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1084; &#1082;&#1083;&#1072;&#1089;&#1089; <b>MyWindow</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QWidget</b>:
</p><div class="fon"><pre>
  <span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1084;&#1080;&#1084;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QWidget</b>, &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1099;, &#1103;&#1074;&#1083;&#1103;&#1102;&#1097;&#1080;&#1077;&#1089;&#1103; &#1077;&#1075;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1082;&#1072;&#1084;&#1080;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, <b>QFrame</b> (&#1086;&#1082;&#1085;&#1086; &#1089; &#1088;&#1072;&#1084;&#1082;&#1086;&#1081;) &#1080;&#1083;&#1080; <b>QDialog</b> (&#1076;&#1080;&#1072;&#1083;&#1086;&#1075;&#1086;&#1074;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;). &#1055;&#1088;&#1080; 
&#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QDialog</b> &#1086;&#1082;&#1085;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1101;&#1082;&#1088;&#1072;&#1085;&#1072; (&#1080;&#1083;&#1080; &#1087;&#1086; &#1094;&#1077;&#1085;&#1090;&#1088;&#1091; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1086;&#1075;&#1086; &#1086;&#1082;&#1085;&#1072;) &#1080; &#1080;&#1084;&#1077;&#1090;&#1100; &#1074; &#1079;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1082;&#1077; &#1086;&#1082;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1074;&#1077; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080;: <b><i>&#1057;&#1087;&#1088;&#1072;&#1074;&#1082;&#1072;</i></b> &#1080; <b><i>&#1047;&#1072;&#1082;&#1088;&#1099;&#1090;&#1100;</i></b>. 
&#1050;&#1088;&#1086;&#1084;&#1077; &#1090;&#1086;&#1075;&#1086;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1100; &#1082;&#1083;&#1072;&#1089;&#1089; <b>QMainWindow</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1075;&#1083;&#1072;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1089; &#1084;&#1077;&#1085;&#1102;, &#1087;&#1072;&#1085;&#1077;&#1083;&#1103;&#1084;&#1080; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1080; &#1089;&#1090;&#1088;&#1086;&#1082;&#1086;&#1081; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103;. &#1053;&#1072;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; 
<b>QMainWindow</b> &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1074;&#1086;&#1080; &#1086;&#1090;&#1083;&#1080;&#1095;&#1080;&#1103;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; &#1087;&#1086;&#1079;&#1078;&#1077;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1077;:
</p><div class="fon"><pre>
  <span class="sl_sl">def</span> <span class="vyvod">__init__ </span>(self, parent=<span class="sl_sl">None</span>):
</pre></div>
&#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1086;&#1085; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1089;&#1089;&#1099;&#1083;&#1082;&#1080; &#1085;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; (<b>self</b>) &#1080; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; (<b>parent</b>). &#1056;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100;, 
&#1087;&#1086;&#1101;&#1090;&#1086;&#1084;&#1091; &#1074; &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1091; &#1087;&#1088;&#1080;&#1089;&#1074;&#1072;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102; (<b>None</b>). &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>__init__()</b> &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088; &#1073;&#1072;&#1079;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;, &#1080; &#1077;&#1084;&#1091; 
&#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1089;&#1099;&#1083;&#1082;&#1072; &#1085;&#1072; &#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;:
<div class="fon"><pre>
  QtWidgets.QWidget.__init__(self, parent)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; &#1089;&#1086;&#1079;&#1076;&#1072;&#1102;&#1090; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;, &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1080; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;&#1072;, &#1079;&#1072;&#1090;&#1077;&#1084; &#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1074; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088;, &#1072; &#1089;&#1072;&#1084; &#1082;&#1086;&#1085;&#1090;&#1077;&#1081;&#1085;&#1077;&#1088; - &#1074; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1077; &#1086;&#1082;&#1085;&#1086;. &#1057;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; 
&#1085;&#1072; &#1090;&#1086;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080; &#1080; &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103; &#1074; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1072;&#1093; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;. &#1042; &#1076;&#1072;&#1083;&#1100;&#1085;&#1077;&#1081;&#1096;&#1077;&#1084; &#1080;&#1079; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1090;&#1100; &#1101;&#1090;&#1080;&#1084;&#1080; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;&#1084;&#1080; - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;. &#1045;&#1089;&#1083;&#1080; 
&#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1099; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100;, &#1090;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082; &#1085;&#1080;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1077; &#1090;&#1072;&#1082; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1084; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; (<a href="https://it.kgsu.ru/Python_Qt/pyqt5_002.html" target="_blank">&#1096;&#1072;&#1075; 2</a>) &#1084;&#1099; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1083;&#1080; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; <b>HTML</b>-&#1090;&#1077;&#1075;&#1086;&#1074;. &#1054;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1080;&#1090;&#1100; &#1090;&#1072;&#1082;&#1086;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076; 
<b>setAlignment()</b>, &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1084;&#1091; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>AlignHCenter</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtCore</b>:
</p><div class="fon"><pre>
  self.label.setAlignment(QtCore.Qt.AlignHCenter)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1080;, &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1072;&#1102;&#1097;&#1077;&#1084; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;:
</p><div class="fon"><pre>
  self.btnQuit.clicked.connect(QtWidgets.qApp.quit)
</pre></div>
&#1084;&#1099; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087; &#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1091; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1085;&#1085;&#1099;&#1081; &#1088;&#1072;&#1085;&#1077;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>qApp</b> &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtWidgets</b>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1079;&#1072;&#1082;&#1086;&#1085;&#1095;&#1080;&#1084; &#1080;&#1079;&#1091;&#1095;&#1077;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1074;&#1086;&#1087;&#1088;&#1086;&#1089;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_003.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_005.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>