<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_048.html]
* At UTC datetime: [2023-08-19 09:56:10.297294]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 48.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1054;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; &#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;. &#1053;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074; (&#1086;&#1082;&#1086;&#1085;&#1095;&#1072;&#1085;&#1080;&#1077;)
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1087;&#1086;&#1085;&#1103;&#1090;&#1080;&#1077; &#1089;&#1083;&#1086;&#1090;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089;&#1099; <b>PyQt5</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1088;&#1103;&#1076; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074;, &#1089;&#1087;&#1077;&#1094;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1076;&#1083;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1074;. &#1058;&#1072;&#1082;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; 
&#1085;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; <b><i>&#1089;&#1083;&#1086;&#1090;&#1072;&#1084;&#1080;</i></b>. &#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1082;&#1083;&#1072;&#1089;&#1089; <b>QApplication</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1086;&#1090; <b>quit()</b>, &#1079;&#1072;&#1074;&#1077;&#1088;&#1096;&#1072;&#1102;&#1097;&#1080;&#1081; &#1090;&#1077;&#1082;&#1091;&#1097;&#1077;&#1077; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077;. 
&#1042; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1077; &#1085;&#1080;&#1078;&#1077; &#1087;&#1086;&#1082;&#1072;&#1079;&#1072;&#1085; &#1082;&#1086;&#1076;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1097;&#1080;&#1081; &#1101;&#1090;&#1086;&#1090; &#1089;&#1083;&#1086;&#1090;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtWidgets
<span class="sl_sl">import</span> sys
app = QtWidgets.QApplication(sys.argv)
button = QtWidgets.QPushButton(<span class="pech">"&#1047;&#1072;&#1074;&#1077;&#1088;&#1096;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;"</span>)
button.clicked.connect(app.quit)
button.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr48_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1051;&#1102;&#1073;&#1086;&#1081; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1089;&#1082;&#1080;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076; &#1084;&#1086;&#1078;&#1085;&#1086; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;, &#1076;&#1083;&#1103; &#1095;&#1077;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076; &#1077;&#1075;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1077;&#1081; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1076;&#1077;&#1082;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088; <b>@pyqtSlot()</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1076;&#1077;&#1082;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072;:
</p><div class="fon"><pre>
  @QtCore.pyqtSlot(*&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;,   name=<span class="sl_sl">None</span>, result=<span class="sl_sl">None</span>)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;</b> &#1095;&#1077;&#1088;&#1077;&#1079; &#1079;&#1072;&#1087;&#1103;&#1090;&#1091;&#1102; &#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1103;&#1102;&#1090;&#1089;&#1103; &#1090;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1084;&#1099;&#1093; &#1089;&#1083;&#1086;&#1090;&#1086;&#1084;, - &#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;: <b>bool</b> &#1080;&#1083;&#1080; <b>int</b>. 
&#1055;&#1088;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085;&#1080;&#1080; &#1090;&#1080;&#1087;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; <b>C++</b> &#1077;&#1075;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1077; &#1087;&#1088;&#1080;&#1085;&#1080;&#1084;&#1072;&#1077;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;, &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1058;&#1080;&#1087;&#1099; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;</i>&gt;</b> 
&#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;. &#1042; &#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>name</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1090;&#1072; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; - &#1101;&#1090;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1090;&#1072;&#1085;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074;&#1084;&#1077;&#1089;&#1090;&#1086; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, 
&#1072; &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>name</b> &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1083;&#1086;&#1090;&#1072; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1074;&#1087;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1085;&#1072;&#1079;&#1074;&#1072;&#1085;&#1080;&#1077;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1048;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>result</b> &#1087;&#1088;&#1077;&#1076;&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085; &#1076;&#1083;&#1103; 
&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1103; &#1090;&#1080;&#1087;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1084;&#1099;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084;, - &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1085;&#1077; &#1079;&#1072;&#1076;&#1072;&#1085;, &#1090;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076; &#1085;&#1080;&#1095;&#1077;&#1075;&#1086; &#1085;&#1077; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1086;&#1079;&#1076;&#1072;&#1090;&#1100; &#1087;&#1077;&#1088;&#1077;&#1075;&#1088;&#1091;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074;&#1077;&#1088;&#1089;&#1080;&#1102; &#1089;&#1083;&#1086;&#1090;&#1072;, 
&#1076;&#1077;&#1082;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1088;&#1072;&#1079; &#1089; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1090;&#1080;&#1087;&#1072;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1077;&#1082;&#1086;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; <b>@pyqtSlot()</b> &#1087;&#1088;&#1080;&#1074;&#1077;&#1076;&#1077;&#1085; &#1085;&#1080;&#1078;&#1077;.
</p><div class="fon"><pre>
<span class="comm"># -*- coding: utf-8 -*-</span>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets
<span class="sl_sl">import</span> sys
<span class="sl_sl">class</span> <span class="vyvod">MyClass</span>(QtCore.QObject):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        QtCore.QObject.__init__ (self)
    @QtCore.pyqtSlot()
    <span class="sl_sl">def</span> <span class="vyvod">on_clicked</span>(self):
        <span class="tp">print</span>(<span class="pech">"&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1072;. &#1057;&#1083;&#1086;&#1090; on_clicked()"</span>)
    @QtCore.pyqtSlot(<span class="tp">bool</span>, name="myslot")
    <span class="sl_sl">def</span> <span class="vyvod">on_clicked2</span>(self, status):
        <span class="tp">print</span>(<span class="pech">"&#1050;&#1085;&#1086;&#1087;&#1082;&#1072; &#1085;&#1072;&#1078;&#1072;&#1090;&#1072;. &#1057;&#1083;&#1086;&#1090; myslot(bool)"</span>, status)
        
obj = MyClass()
app = QtWidgets.QApplication(sys.argv)
button = QtWidgets.QPushButton(<span class="pech">"&#1053;&#1072;&#1078;&#1084;&#1080; &#1084;&#1077;&#1085;&#1103;"</span>)
button.clicked.connect(obj.on_clicked)
button.clicked.connect(obj.myslot)
button.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr48_2.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris48_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
<b>PyQt</b> &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1074;&#1088;&#1072;&#1097;&#1077;&#1085;&#1080;&#1103; &#1074; &#1089;&#1083;&#1086;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103; &#1082;&#1072;&#1082; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;. &#1054;&#1076;&#1085;&#1072;&#1082;&#1086; &#1101;&#1090;&#1086; &#1088;&#1077;&#1082;&#1086;&#1084;&#1077;&#1085;&#1076;&#1091;&#1077;&#1090;&#1089;&#1103; 
&#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1074;&#1099;&#1079;&#1086;&#1074; &#1089;&#1083;&#1086;&#1090;&#1072; &#1074; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1073;&#1099;&#1089;&#1090;&#1088;&#1077;&#1077;, &#1095;&#1077;&#1084; &#1074;&#1099;&#1079;&#1086;&#1074; &#1086;&#1073;&#1099;&#1095;&#1085;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1077;&#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1081; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; <b>&lt;<i>&#1058;&#1080;&#1087; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;</i>&gt;</b> &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>connect()</b> &#1086;&#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1103;&#1077;&#1090; &#1090;&#1080;&#1087; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1086;&#1084; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1084;. 
&#1053;&#1072; &#1101;&#1090;&#1086;&#1090; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088; &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1086;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1100; &#1086;&#1089;&#1086;&#1073;&#1086;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1080; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1074; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1080; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1086;&#1074;, &#1090;. &#1082;. &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1090;&#1100; <b>GUI</b>-&#1087;&#1086;&#1090;&#1086;&#1082; &#1080;&#1079; &#1076;&#1088;&#1091;&#1075;&#1086;&#1075;&#1086; 
&#1087;&#1086;&#1090;&#1086;&#1082;&#1072; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1084;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1086;&#1076;&#1080;&#1085; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>Qtcore.Qt</b>:
</p><ul>
 <li> <b>Autoconnection (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;. &#1045;&#1089;&#1083;&#1080; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; 
&#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1086;&#1084; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077;, &#1090;&#1086; &#1086;&#1085;&#1086; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; <b>DirectConnection</b>, &#1072; &#1077;&#1089;&#1083;&#1080; 
&#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1093;, &#1090;&#1086; - <b>QueuedConnection</b>;
 </li><li> <b>DirectConnection (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1074;&#1099;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1088;&#1072;&#1079;&#1091; &#1087;&#1086;&#1089;&#1083;&#1077; &#1075;&#1077;&#1085;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1077;&#1075;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1072;;
 </li><li> <b>QueuedConnection (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1089;&#1080;&#1075;&#1085;&#1072;&#1083; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1086;&#1095;&#1077;&#1088;&#1077;&#1076;&#1100; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1086;&#1073;&#1099;&#1090;&#1080;&#1081;, &#1072; &#1077;&#1075;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1077;&#1090;&#1089;&#1103; &#1074; &#1087;&#1086;&#1090;&#1086;&#1082;&#1077; &#1087;&#1088;&#1080;&#1077;&#1084;&#1085;&#1080;&#1082;&#1072; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;;
 </li><li> <b>BlockingQueuedConnection (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1102; <b>QueuedConnection</b> &#1079;&#1072; &#1090;&#1077;&#1084; &#1080;&#1089;&#1082;&#1083;&#1102;&#1095;&#1077;&#1085;&#1080;&#1077;&#1084;, &#1095;&#1090;&#1086; &#1087;&#1086;&#1090;&#1086;&#1082; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1091;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1074;&#1088;&#1077;&#1084;&#1103; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1082;&#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072;. &#1054;&#1073;&#1088;&#1072;&#1090;&#1080;&#1090;&#1077; &#1074;&#1085;&#1080;&#1084;&#1072;&#1085;&#1080;&#1077;, 
&#1095;&#1090;&#1086; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082; &#1080; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1072; &#1086;&#1073;&#1103;&#1079;&#1072;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086; &#1076;&#1086;&#1083;&#1078;&#1085;&#1099; &#1073;&#1099;&#1090;&#1100; &#1088;&#1072;&#1089;&#1087;&#1086;&#1083;&#1086;&#1078;&#1077;&#1085;&#1099; &#1074; &#1088;&#1072;&#1079;&#1085;&#1099;&#1093; &#1087;&#1086;&#1090;&#1086;&#1082;&#1072;&#1093;;
 </li><li> <b>UniqueConnection (<i>&#1080;&#1083;&#1080;</i> 0x80)</b> - &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;, &#1095;&#1090;&#1086; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1084;&#1086;&#1078;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1080;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1080;&#1085; &#1088;&#1072;&#1079;. &#1069;&#1090;&#1086;&#1090; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1086;&#1073;&#1098;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085; &#1089; &#1083;&#1102;&#1073;&#1099;&#1084; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1093; &#1088;&#1072;&#1085;&#1077;&#1077; &#1092;&#1083;&#1072;&#1075;&#1086;&#1074; 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088;&#1072; |. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;&#1099;:
<div class="fon"><pre>
<span class="comm"># &#1069;&#1090;&#1080; &#1076;&#1074;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1091;&#1089;&#1087;&#1077;&#1096;&#1085;&#1086; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1080; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1099;</span>
button.clicked.connect(on_clicked)
button.clicked.connect(on_clicked)
<span class="comm"># &#1040; &#1101;&#1090;&#1080; &#1076;&#1074;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099; &#1085;&#1077; &#1073;&#1091;&#1076;&#1091;&#1090;</span>
button.clicked.connect(on_clicked, Qt.Core.Qt.Autoconnection | 
QtCore.Qt.UniqueConnection)
button.clicked.connect(on_clicked, Qt.Core.Qt.Autoconnection | 
QtCore.Qt.UniqueConnection)
<span class="comm"># &#1058;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077;, &#1101;&#1090;&#1080; &#1076;&#1074;&#1072; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1099;, &#1087;&#1086;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1091; &#1086;&#1085;&#1080; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077;</span>
button.clicked.connect(on_clicked, Qt.Core.Qt.Autoconnection | 
QtCore.Qt.UniqueConnection)
button.clicked.connect(obj.on_clicked, Qt.Core.Qt.Autoconnection | 
QtCore.Qt.UniqueConnection)
</pre></div>
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1091; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1086;&#1073;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_047.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav2.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_049.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>