<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_296.html]
* At UTC datetime: [2023-08-19 10:06:47.124314]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 296.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1052;&#1091;&#1083;&#1100;&#1090;&#1080;&#1084;&#1077;&#1076;&#1080;&#1072;. &#1047;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; QAudioEncoderSettings
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1085;&#1072;&#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;,  &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;, &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1080; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1072;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAudioEncoderSettings</b> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1085;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072; 
&#1086;&#1095;&#1077;&#1085;&#1100; &#1087;&#1088;&#1086;&#1089;&#1090;:
</p><div class="fon"><pre>
  &lt;<i>&#1054;&#1073;&#1098;&#1077;&#1082;&#1090;</i>&gt; = QAudioEncoderSettings([&lt;QAudioEncoderSettings&gt;])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QAudioEncoderSettings</b>, &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1072; &#1077;&#1075;&#1086; &#1082;&#1086;&#1087;&#1080;&#1103;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1083;&#1072;&#1089;&#1089; <b>QAudioEncoderSettings</b> &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; 
<a href="https://doc.qt.io/qt-5/qaudioencodersettings.html" target="_blank"><b>https://doc.qt.io/qt-5/qaudioencodersettings.html</b></a>):
</p><ul>
 <li> <b>setCodec (&lt;<i>&#1050;&#1086;&#1076;&#1077;&#1082;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1072;&#1091;&#1076;&#1080;&#1086;&#1082;&#1086;&#1076;&#1077;&#1082;&#1072;, &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084;&#1086;&#1077; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setSampleRate (&lt;<i>&#1063;&#1072;&#1089;&#1090;&#1086;&#1090;&#1072; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1091; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1091;&#1102; &#1074; &#1075;&#1077;&#1088;&#1094;&#1072;&#1093;. 
&#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; -1, <b>PyQt</b> &#1089;&#1072;&#1084;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1090; &#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1095;&#1072;&#1089;&#1090;&#1086;&#1090;&#1091; &#1076;&#1080;&#1089;&#1082;&#1088;&#1077;&#1090;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1103; &#1080;&#1079; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setChannelCount (&lt;<i>&#1050;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074;</i>&gt;)</b> -&#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074; &#1082;&#1086;&#1076;&#1080;&#1088;&#1091;&#1077;&#1084;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; -l, <b>PyQt</b> &#1089;&#1072;&#1084;&#1072; &#1074;&#1099;&#1073;&#1077;&#1088;&#1077;&#1090; 
&#1086;&#1087;&#1090;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1086;&#1083;&#1080;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1072;&#1085;&#1072;&#1083;&#1086;&#1074;, &#1080;&#1089;&#1093;&#1086;&#1076;&#1103; &#1080;&#1079; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1077;&#1081; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1074;&#1093;&#1086;&#1076;&#1072; &#1080; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setEncodingMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMultimedia</b>:
<ul>
 <li> <b>ConstantQualityEncoding (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084;. &#1050;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1084; <b>setQuality()</b>, &#1072; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076;&#1103;&#1097;&#1080;&#1081; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090; &#1087;&#1086;&#1076;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1081; <b>PyQt</b>;
 </li><li> <b>ConstantBitRateEncoding (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;&#1086;&#1084;. &#1041;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090; &#1091;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074;&#1099;&#1079;&#1086;&#1074;&#1086;&#1084; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setBitRate()</b>, &#1072; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1072; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1077;&#1085;&#1085;&#1086; &#1074;&#1099;&#1073;&#1080;&#1088;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1072;&#1084;&#1086;&#1081; <b>PyQt</b>;
 </li><li> <b>AverageBitRateEncoding (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;&#1086;&#1084;. &#1042; &#1101;&#1090;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setBitRate()</b> &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1077;&#1083;&#1080;&#1095;&#1080;&#1085;&#1091; &#1089;&#1088;&#1077;&#1076;&#1085;&#1077;&#1075;&#1086; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;&#1072;;
 </li><li> <b>TwoPassEncoding (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1076;&#1074;&#1072; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setBitRate (&lt;<i>&#1041;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;, &#1074;&#1099;&#1088;&#1072;&#1078;&#1077;&#1085;&#1085;&#1099;&#1081; &#1074; &#1073;&#1080;&#1090;&#1072;&#1093; &#1074; &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;&#1091;. &#1045;&#1075;&#1086; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085; &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;&#1086;&#1084; 
(&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>ConstantBitRateEncoding</b>), &#1089; &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1085;&#1085;&#1099;&#1084; &#1073;&#1080;&#1090;&#1088;&#1077;&#1081;&#1090;&#1086;&#1084; (&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>AverageBitRateEncoding</b>) &#1080;&#1083;&#1080; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1074; &#1076;&#1074;&#1072; &#1087;&#1088;&#1086;&#1093;&#1086;&#1076;&#1072; (&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>TwoPassEncoding</b>);
<p align="JUSTIFY">
 </p></li><li> <b>setQuality (&lt;&#1050;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086; &#1080;&#1079; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QMuitimedia</b>:
<ul>
 <li> <b>VeryLowQuality (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1089;&#1072;&#1084;&#1086;&#1077; &#1085;&#1080;&#1079;&#1082;&#1086;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;;
 </li><li> <b>LowQuality (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1085;&#1080;&#1079;&#1082;&#1086;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;;
 </li><li> <b>NormalQuality (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1085;&#1086;&#1088;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;;
 </li><li> <b>HighQuality (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1074;&#1099;&#1089;&#1086;&#1082;&#1086;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;;
 </li><li> <b>VeryHighQuality (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1085;&#1072;&#1080;&#1074;&#1099;&#1089;&#1096;&#1077;&#1077; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1050;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083; &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1090;&#1100; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1077;&#1089;&#1083;&#1080; &#1079;&#1072;&#1076;&#1072;&#1085; &#1088;&#1077;&#1078;&#1080;&#1084; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1089; &#1087;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1085;&#1099;&#1084; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1086;&#1084; (&#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; 
<b>ConstantQualityEncoding</b>);
</p><p align="JUSTIFY">
 </p></li><li> <b>setEncodingOption (&lt;<i>&#1055;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;</i>&gt;, &lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; &#1076;&#1083;&#1103; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1053;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;;
<p align="JUSTIFY">
 </p></li><li> <b>setEncodingOptions (&lt;<i>&#1057;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1089;&#1088;&#1072;&#1079;&#1091; &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1083;&#1086;&#1074;&#1072;&#1088;&#1100;, &#1082;&#1083;&#1102;&#1095;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1103;&#1102;&#1090; &#1089;&#1086;&#1073;&#1086;&#1081; 
&#1085;&#1072;&#1080;&#1084;&#1077;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;, &#1072; &#1080;&#1093; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; - &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074;.
&#1053;&#1072;&#1073;&#1086;&#1088; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1090; &#1086;&#1090; &#1074;&#1099;&#1073;&#1088;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1086;&#1076;&#1077;&#1082;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1044;&#1083;&#1103; &#1087;&#1088;&#1080;&#1084;&#1077;&#1088;&#1072; &#1085;&#1072;&#1087;&#1080;&#1096;&#1077;&#1084; &#1087;&#1088;&#1086;&#1089;&#1090;&#1091;&#1102; &#1091;&#1090;&#1080;&#1083;&#1080;&#1090;&#1091;, &#1086;&#1089;&#1091;&#1097;&#1077;&#1089;&#1090;&#1074;&#1083;&#1103;&#1102;&#1097;&#1091;&#1102; &#1079;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072; &#1089; &#1084;&#1080;&#1082;&#1088;&#1086;&#1092;&#1086;&#1085;&#1072; &#1074; &#1084;&#1080;&#1085;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1086;&#1084; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077;, - &#1089;&#1074;&#1086;&#1077;&#1075;&#1086; &#1088;&#1086;&#1076;&#1072; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1085;&#1099;&#1081; &#1076;&#1080;&#1082;&#1090;&#1086;&#1092;&#1086;&#1085; (&#1088;&#1080;&#1089;&#1091;&#1085;&#1086;&#1082; 1).
</p><div class="fon"><pre>
<span class="sl_sl">from</span> PyQt5 <span class="sl_sl">import</span> QtCore, QtWidgets, QtMultimedia
<span class="sl_sl">import</span> sys, os

<span class="sl_sl">class</span> <span class="vyvod">MyWindow</span>(QtWidgets.QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self, parent=<span class="sl_sl">None</span>):
        QtWidgets.QWidget.__init__(self, parent,
            flags = QtCore.Qt.Window | QtCore.Qt.MSWindowsFixedSizeDialogHint)
        self.setWindowTitle(<span class="pech">"&#1047;&#1072;&#1087;&#1080;&#1089;&#1100; &#1079;&#1074;&#1091;&#1082;&#1072;"</span>)
        <span class="comm"># &#1048;&#1085;&#1080;&#1094;&#1080;&#1072;&#1083;&#1080;&#1079;&#1080;&#1088;&#1091;&#1077;&#1084; &#1087;&#1086;&#1076;&#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1091; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;</span>
        self.ardRecorder = QtMultimedia.QAudioRecorder()
        <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1084;&#1072;&#1082;&#1089;&#1080;&#1084;&#1072;&#1083;&#1100;&#1085;&#1091;&#1102; &#1075;&#1088;&#1086;&#1084;&#1082;&#1086;&#1089;&#1090;&#1100;</span>
        self.ardRecorder.setVolume(100)

        <span class="comm"># &#1047;&#1074;&#1091;&#1082; &#1073;&#1091;&#1076;&#1077;&#1090; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083;&#1077; record.wav, &#1085;&#1072;&#1093;&#1086;&#1076;&#1103;&#1097;&#1077;&#1084;&#1089;&#1103;</span>
        <span class="comm"># &#1074; &#1090;&#1086;&#1081; &#1078;&#1077; &#1087;&#1072;&#1087;&#1082;&#1077;, &#1075;&#1076;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1072;</span>
        fn = QtCore.QUrl.fromLocalFile(os.path.abspath(<span class="pech">"record.wav"</span>))
        self.ardRecorder.setOutputLocation(fn)
        <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1072;&#1074;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084; &#1079;&#1074;&#1091;&#1082;&#1086;&#1074;&#1086;&#1081; &#1074;&#1093;&#1086;&#1076; &#1087;&#1086; &#1091;&#1084;&#1086;&#1083;&#1095;&#1072;&#1085;&#1080;&#1102;</span>
        self.ardRecorder.setAudioInput(self.ardRecorder.defaultAudioInput())
        <span class="comm"># &#1059;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1077;&#1084; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1092;&#1072;&#1081;&#1083;&#1072; WAV</span>
        self.ardRecorder.setContainerFormat(<span class="pech">"audio/x-wav"</span>)
        <span class="comm"># &#1047;&#1072;&#1076;&#1072;&#1077;&#1084; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1082;&#1086;&#1076;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1079;&#1074;&#1091;&#1082;&#1072;</span>
        aes = QtMultimedia.QAudioEncoderSettings()
        aes.setCodec(<span class="pech">"audio/pcm"</span>)
        aes.setSampleRate(8000)
        aes.setChannelCount(1)
        aes.setEncodingMode(QtMultimedia.QMultimedia.ConstantQualityEncoding)
        aes.setQuality(QtMultimedia.QMultimedia.VeryLowQuality)
        self.ardRecorder.setAudioSettings(aes)
        self.ardRecorder.statusChanged.connect(self.initRecorder)
        self.ardRecorder.durationChanged.connect(self.showDuration)
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1072;, &#1087;&#1088;&#1080;&#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080; &#1080; &#1086;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1080;</span>
        <span class="comm"># &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1080; &#1088;&#1077;&#1075;&#1091;&#1083;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1077;&#1075;&#1086; &#1091;&#1088;&#1086;&#1074;&#1085;&#1103;</span>
        vbox = QtWidgets.QVBoxLayout()
        hbox = QtWidgets.QHBoxLayout()
        self.btnRecord = QtWidgets.QPushButton(<span class="pech">"&amp;3&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
        self.btnRecord.clicked.connect(self.ardRecorder.record)
        hbox.addWidget(self.btnRecord)
        self.btnPause = QtWidgets.QPushButton(<span class="pech">"&#1055;&amp;&#1072;&#1091;&#1079;&#1072;"</span>)
        self.btnPause.clicked.connect(self.ardRecorder.pause)
        self.btnPause.setEnabled(<span class="sl_sl">False</span>)
        hbox.addWidget(self.btnPause)
        self.btnStop = QtWidgets.QPushButton(<span class="pech">"&amp;&#1057;&#1090;&#1086;&#1087;"</span>)
        self.btnStop.clicked.connect(self.ardRecorder.stop)
        self.btnStop.setEnabled(<span class="sl_sl">False</span>)
        hbox.addWidget(self.btnStop)
        vbox.addLayout(hbox)
        hbox = QtWidgets.QHBoxLayout()
        lblVolume = QtWidgets.QLabel(<span class="pech">"&amp;&#1059;&#1088;&#1086;&#1074;&#1077;&#1085;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080;"</span>)
        hbox.addWidget(lblVolume)
        sldVolume = QtWidgets.QSlider(QtCore.Qt.Horizontal)
        sldVolume.setRange(0, 100)
        sldVolume.setTickPosition(QtWidgets.QSlider.TicksAbove)
        sldVolume.setTickInterval(10)
        sldVolume.setValue(100)
        lblVolume.setBuddy(sldVolume)
        sldVolume.valueChanged.connect(self.ardRecorder.setVolume)
        hbox.addWidget(sldVolume)
        vbox.addLayout(hbox)
        <span class="comm"># &#1057;&#1086;&#1079;&#1076;&#1072;&#1077;&#1084; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1100;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1100;&#1089;&#1103; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1077;</span>
        <span class="comm"># &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1099;</span>
        self.lblStatus = QtWidgets.QLabel(<span class="pech">"&#1043;&#1086;&#1090;&#1086;&#1074;&#1086;"</span>)
        vbox.addWidget(self.lblStatus)
        self.setLayout(vbox)
        self.resize(300, 100)

    <span class="comm"># &#1042; &#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;&#1089;&#1090;&#1080; &#1086;&#1090; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072; &#1076;&#1077;&#1083;&#1072;&#1077;&#1084; &#1085;&#1091;&#1078;&#1085;&#1099;&#1077;</span>
    <span class="comm"># &#1082;&#1085;&#1086;&#1087;&#1082;&#1080; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1080;&#1083;&#1080;, &#1085;&#1072;&#1087;&#1088;&#1086;&#1090;&#1080;&#1074;, &#1085;&#1077;&#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1099;&#1084;&#1080; &#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084;</span>
    <span class="comm"># &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1085;&#1072;&#1076;&#1087;&#1080;&#1089;&#1080;</span>
    <span class="sl_sl">def</span> <span class="vyvod">initRecorder</span>(self, status):
        <span class="sl_sl">if</span> status == QtMultimedia.QMediaRecorder.RecordingStatus:
            self.btnRecord.setEnabled(<span class="sl_sl">False</span>)
            self.btnPause.setEnabled(<span class="sl_sl">True</span>)
            self.btnStop.setEnabled(<span class="sl_sl">True</span>)
            self.lblStatus.setText(<span class="pech">"&#1047;&#1072;&#1087;&#1080;&#1089;&#1100;"</span>)
        <span class="sl_sl">elif</span> status == QtMultimedia.QMediaRecorder.PausedStatus:
            self.btnRecord.setEnabled(<span class="sl_sl">True</span>)
            self.btnPause.setEnabled(<span class="sl_sl">False</span>)
            self.lblStatus.setText(<span class="pech">"&#1055;&#1072;&#1091;&#1079;&#1072;"</span>)
        <span class="sl_sl">elif</span> status == QtMultimedia.QMediaRecorder.FinalizingStatus:
            self.btnRecord.setEnabled(<span class="sl_sl">True</span>)
            self.btnPause.setEnabled(<span class="sl_sl">False</span>)
            self.btnStop.setEnabled(<span class="sl_sl">False</span>)
            self.lblStatus.setText(<span class="pech">"&#1043;&#1086;&#1090;&#1086;&#1074;&#1086;"</span>)

    <span class="comm"># &#1042;&#1099;&#1074;&#1086;&#1076;&#1080;&#1084; &#1087;&#1088;&#1086;&#1076;&#1086;&#1083;&#1078;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1079;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1079;&#1074;&#1091;&#1082;&#1072;</span>
    <span class="sl_sl">def</span> <span class="vyvod">showDuration</span>(self, duration):
        self.lblStatus.setText(<span class="pech">"&#1047;&#1072;&#1087;&#1080;&#1089;&#1072;&#1085;&#1086; "</span> + <span class="tp">str</span>(duration // 1000) + <span class="pech">" &#1089;&#1077;&#1082;&#1091;&#1085;&#1076;"</span>)


app = QtWidgets.QApplication(sys.argv)
window = MyWindow()
window.show()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="pr296_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="CENTER"><img src="images/ris296_1.jpg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1059;&#1090;&#1080;&#1083;&#1080;&#1090;&#1072; &#1076;&#1083;&#1103; &#1079;&#1072;&#1087;&#1080;&#1089;&#1080; &#1079;&#1074;&#1091;&#1082;&#1072;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089; </i>QSoundEffect</b>.

</p><p align="CENTER"><br><br><br>
<a href="pyqt5_295.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="oglav16.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="pyqt5_297.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>