<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_110.html]
* At UTC datetime: [2023-08-19 09:58:50.640156]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 110.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5. &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1099;. &#1052;&#1085;&#1086;&#1075;&#1086;&#1089;&#1090;&#1088;&#1086;&#1095;&#1085;&#1086;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1077; &#1087;&#1086;&#1083;&#1077;. &#1048;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1087;&#1086;&#1083;&#1103;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; <b><i>&#1087;&#1077;&#1088;&#1077;&#1095;&#1080;&#1089;&#1083;&#1080;&#1084; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1099;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1077; &#1076;&#1083;&#1103; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1087;&#1086;&#1083;&#1103;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1047;&#1072;&#1076;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1099; &#1087;&#1086;&#1083;&#1103; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1079;&#1086;&#1074;&#1072;&#1084;&#1080; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1093; &#1084;&#1077;&#1090;&#1086;&#1076;&#1086;&#1074; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextEdit</b> (&#1087;&#1086;&#1083;&#1085;&#1099;&#1081; &#1080;&#1093; &#1089;&#1087;&#1080;&#1089;&#1086;&#1082; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1077;&#1085; &#1085;&#1072; &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1077; <a href="https://doc.qt.io/qt-5/qtextedit.html" target="_blank"><b>https://doc.qt.io/qt-5/qtextedit.html</b></a>):
</p><ul>
 <li> <b>setTextInteractionFlags (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1080;&#1103; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1103; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;. &#1052;&#1086;&#1078;&#1085;&#1086; &#1091;&#1082;&#1072;&#1079;&#1072;&#1090;&#1100; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; (&#1080;&#1083;&#1080; &#1080;&#1093; &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; |) &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>:
<ul>
 <li> <b>NoTextInteraction (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1100; &#1085;&#1077; &#1084;&#1086;&#1078;&#1077;&#1090; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1084;;
 </li><li> <b>TextSelectableByMouse (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>TextSelectableByKeyboard (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1099;&#1076;&#1077;&#1083;&#1080;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;. &#1042;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1086;&#1083;&#1103; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1099;&#1081; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;;
 </li><li> <b>LinksAccessibleByMouse (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1085;&#1072; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1093;, &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1093; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1097;&#1077;&#1083;&#1082;&#1072;&#1090;&#1100; &#1084;&#1099;&#1096;&#1100;&#1102;;
 </li><li> <b>LinksAccessibleByKeyboard (<i>&#1080;&#1083;&#1080;</i> 8)</b> - &#1089; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080;,  &#1087;&#1088;&#1080;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1091;&#1102;&#1097;&#1080;&#1084;&#1080; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;, &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1072;&#1080;&#1084;&#1086;&#1076;&#1077;&#1081;&#1089;&#1090;&#1074;&#1086;&#1074;&#1072;&#1090;&#1100; &#1089; &#1082;&#1083;&#1072;&#1074;&#1080;&#1072;&#1090;&#1091;&#1088;&#1099;:  &#1087;&#1077;&#1088;&#1077;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1072;&#1084;&#1080; - 
&#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b>, &#1072; &#1087;&#1077;&#1088;&#1077;&#1093;&#1086;&#1076;&#1080;&#1090;&#1100; &#1087;&#1086; &#1075;&#1080;&#1087;&#1077;&#1088;&#1089;&#1089;&#1099;&#1083;&#1082;&#1077; - &#1085;&#1072;&#1078;&#1072;&#1074; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1091; <b>Enter</b>;
 </li><li> <b>TextEditable (<i>&#1080;&#1083;&#1080;</i> 16)</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;;
 </li><li> <b>TextEditorInteraction</b> - &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; <b>TextSelectableByMouse | TextSelectableByKeyboard | TextEditable</b>;
 </li><li> <b>TextBrowserInteraction</b> - &#1082;&#1086;&#1084;&#1073;&#1080;&#1085;&#1072;&#1094;&#1080;&#1103; <b>TextSelectableByMouse | LinksAccessibleByMouse | LinksAccessibleByKeyboard;</b>
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setReadOnly (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1087;&#1086;&#1083;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;;
<p align="JUSTIFY">
 </p></li><li> <b>isReadOnly ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1087;&#1086;&#1083;&#1077; &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1086; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setLineWrapMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1089;&#1090;&#1088;&#1086;&#1082;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextEdit</b>:
<ul>
 <li> <b>NoWrap (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;;
 </li><li> <b>WidgetWidth (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1080;&#1084;&#1080; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1087;&#1086;&#1083;&#1103;;
 </li><li> <b>FixedPixelWidth (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1080;&#1084;&#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setLineWrapColumnOrWidth()</b>;
 </li><li> <b>FixedColumnWidth (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1080;&#1084;&#1080; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1096;&#1080;&#1088;&#1080;&#1085;&#1099; &#1074; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072;&#1093;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1084;&#1086;&#1078;&#1085;&#1086; &#1079;&#1072;&#1076;&#1072;&#1090;&#1100; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>setLineWrapColumnOrWidth()</b>;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setLineWrapColumnOrWidth (&lt;<i>&#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1092;&#1080;&#1082;&#1089;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1091;&#1102; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;,  &#1087;&#1088;&#1080; &#1076;&#1086;&#1089;&#1090;&#1080;&#1078;&#1077;&#1085;&#1080;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1073;&#1091;&#1076;&#1077;&#1090; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1103;&#1090;&#1100;&#1089;&#1103; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;;
<p align="JUSTIFY">
 </p></li><li> <b>setWordWrapMode (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089;&#1072; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextOption</b> &#1080;&#1079; &#1084;&#1086;&#1076;&#1091;&#1083;&#1103; <b>QtGui</b>:
<ul>
 <li> <b>NoWrap (<i>&#1080;&#1083;&#1080;</i> 0)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084; &#1085;&#1077; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103;;
 </li><li> <b>WordWrap (<i>&#1080;&#1083;&#1080;</i> 1)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;;
 </li><li> <b>ManualWrap (<i>&#1080;&#1083;&#1080;</i> 2)</b> - &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;&#1080;&#1095;&#1077;&#1085; &#1088;&#1077;&#1078;&#1080;&#1084;&#1091; <b>NoWrap</b>;
 </li><li> <b>WrapAnywhere (<i>&#1080;&#1083;&#1080;</i> 3)</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;;
 </li><li> <b>WrapAtwordBoundaryOrAnywhere (<i>&#1080;&#1083;&#1080;</i> 4)</b> - &#1087;&#1086; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1089;&#1083;&#1086;&#1074;&#1072;&#1084;, &#1085;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1080; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setOverwriteMode (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1074; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1072; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1074;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1073;&#1091;&#1076;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1090;&#1100; &#1088;&#1072;&#1085;&#1077;&#1077; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081;. &#1047;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b> &#1086;&#1090;&#1082;&#1083;&#1102;&#1095;&#1072;&#1077;&#1090; &#1079;&#1072;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>overwriteMode ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1077;&#1089;&#1083;&#1080; &#1074;&#1074;&#1086;&#1076;&#1080;&#1084;&#1099;&#1081; &#1090;&#1077;&#1082;&#1089;&#1090; &#1079;&#1072;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090; &#1088;&#1072;&#1085;&#1077;&#1077; &#1074;&#1074;&#1077;&#1076;&#1077;&#1085;&#1085;&#1099;&#1081;, &#1080; <b>False</b> - &#1074; &#1087;&#1088;&#1086;&#1090;&#1080;&#1074;&#1085;&#1086;&#1084; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;;
<p align="JUSTIFY">
 </p></li><li> <b>setAutoFomatting (&lt;<i>&#1056;&#1077;&#1078;&#1080;&#1084;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1088;&#1077;&#1078;&#1080;&#1084; &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;. &#1042; &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1103; &#1084;&#1086;&#1075;&#1091;&#1090; &#1073;&#1099;&#1090;&#1100; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1099; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextEdit</b>:
<ul>
 <li> <b>AutoNone</b> - &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103;;
 </li><li> <b>AutoBulletList</b> - &#1072;&#1074;&#1090;&#1086;&#1084;&#1072;&#1090;&#1080;&#1095;&#1077;&#1089;&#1082;&#1086;&#1077; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085;&#1080;&#1077; &#1084;&#1072;&#1088;&#1082;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1089;&#1087;&#1080;&#1089;&#1082;&#1072; &#1087;&#1088;&#1080; &#1074;&#1074;&#1086;&#1076;&#1077; &#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1084; &#1074; &#1085;&#1072;&#1095;&#1072;&#1083;&#1077; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1072; <b>*</b>;
 </li><li> <b>AutoAll</b> - &#1074;&#1082;&#1083;&#1102;&#1095;&#1080;&#1090;&#1100; &#1074;&#1089;&#1077; &#1088;&#1077;&#1078;&#1080;&#1084;&#1099;. &#1053;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1101;&#1082;&#1074;&#1080;&#1074;&#1072;&#1083;&#1077;&#1085;&#1090;&#1085;&#1086; &#1088;&#1077;&#1078;&#1080;&#1084;&#1091; <b>AutoBulletList</b>;
</li></ul>
<p align="JUSTIFY">
 </p></li><li> <b>setCursorWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1090;&#1077;&#1082;&#1089;&#1090;&#1086;&#1074;&#1086;&#1075;&#1086; &#1082;&#1091;&#1088;&#1089;&#1086;&#1088;&#1072;;
<p align="JUSTIFY">
 </p></li><li> <b>setTabChangesFocus (&lt;<i>&#1060;&#1083;&#1072;&#1075;</i>&gt;)</b> - &#1077;&#1089;&#1083;&#1080; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1084; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>False</b>, &#1090;&#1086; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1085;&#1072;&#1078;&#1072;&#1090;&#1080;&#1103; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1080; <b>Tab</b> &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1089;&#1090;&#1072;&#1074;&#1080;&#1090;&#1100; &#1074; &#1087;&#1086;&#1083;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080;. 
&#1045;&#1089;&#1083;&#1080; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1086; &#1079;&#1085;&#1072;&#1095;&#1077;&#1085;&#1080;&#1077; <b>True</b>, &#1090;&#1086; &#1082;&#1083;&#1072;&#1074;&#1080;&#1096;&#1072; <b>Tab</b> &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1090;&#1089;&#1103; &#1076;&#1083;&#1103; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1095;&#1080; &#1092;&#1086;&#1082;&#1091;&#1089;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084;&#1091; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1091;;
 </li><li> <b>setTabStopWidth (&lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;)</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;;
<p align="JUSTIFY">
 </p></li><li> <b>tabStopWidth ()</b> - &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1077;&#1090; &#1096;&#1080;&#1088;&#1080;&#1085;&#1091; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080; &#1074; &#1087;&#1080;&#1082;&#1089;&#1077;&#1083;&#1103;&#1093;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1080;&#1077; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1086;&#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1092;&#1086;&#1085;&#1072;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_109.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_111.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>