<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/pyqt5_189.html]
* At UTC datetime: [2023-08-19 10:02:14.977132]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1051;&#1086;&#1075;&#1086;&#1090;&#1080;&#1087;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1064;&#1072;&#1075; 189.<br>
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072; PyQt5.<br>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072; &#1089; &#1075;&#1088;&#1072;&#1092;&#1080;&#1082;&#1086;&#1081;. &#1050;&#1083;&#1072;&#1089;&#1089; QPainter. &#1042;&#1099;&#1074;&#1086;&#1076; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1101;&#1090;&#1086;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1082;&#1083;&#1072;&#1089;&#1089;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1077;&#1084;&#1099;&#1081; &#1076;&#1083;&#1103; &#1074;&#1099;&#1074;&#1086;&#1076;&#1072; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;</i></b>.
<br><br>
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1042;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>drawText()</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPainter</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
  drawText(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;QPoint&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;QPointF&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;QRect&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;QRectF&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
  drawText(&lt;QRectF&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;[, option=QTextOption()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1090;&#1088;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1103; &#1089; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1099;&#1093; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1090;&#1088;&#1080; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1074;&#1099;&#1074;&#1086;&#1076;&#1103;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;. &#1055;&#1088;&#1080; &#1101;&#1090;&#1086;&#1084; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1074; &#1101;&#1090;&#1091; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1085;, &#1077;&#1089;&#1083;&#1080; &#1085;&#1077; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1092;&#1083;&#1072;&#1075; <b>TextDontClip</b>. 
&#1052;&#1077;&#1090;&#1086;&#1076;&#1099; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRect</b> (<b>QRectF</b> &#1076;&#1083;&#1103; &#1096;&#1077;&#1089;&#1090;&#1086;&#1075;&#1086; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072;) &#1089; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1072;&#1084;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1087;&#1080;&#1089;&#1072;&#1085; &#1090;&#1077;&#1082;&#1089;&#1090;. &#1042; &#1087;&#1072;&#1088;&#1072;&#1084;&#1077;&#1090;&#1088;&#1077; <b>&lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;</b> 
&#1095;&#1077;&#1088;&#1077;&#1079;  &#1086;&#1087;&#1077;&#1088;&#1072;&#1090;&#1086;&#1088; | &#1091;&#1082;&#1072;&#1079;&#1099;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;  &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;  <b>AlignLeft, AlignRight, AlignVCenter,  AlignTop, 
AlignBottom, AlignVCenter</b> &#1080;&#1083;&#1080; <b>AlignCenter</b> &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QtCore.Qt</b>, &#1079;&#1072;&#1076;&#1072;&#1102;&#1097;&#1080;&#1077; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1072; &#1090;&#1072;&#1082;&#1078;&#1077; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090;&#1099;: 
</p><ul>
 <li> <b>TextSingleLine</b> - &#1074;&#1089;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; (&#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1103;, &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1090;&#1099; &#1082;&#1072;&#1088;&#1077;&#1090;&#1082;&#1080; &#1080; &#1087;&#1077;&#1088;&#1077;&#1074;&#1086;&#1076;&#1099; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080;) &#1090;&#1088;&#1072;&#1082;&#1090;&#1091;&#1102;&#1090;&#1089;&#1103; &#1082;&#1072;&#1082; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099;, &#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1074; &#1086;&#1076;&#1085;&#1091; &#1089;&#1090;&#1088;&#1086;&#1082;&#1091;;
 </li><li> <b>TextDontClip</b> - &#1095;&#1072;&#1089;&#1090;&#1100; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;, &#1074;&#1099;&#1096;&#1077;&#1076;&#1096;&#1072;&#1103; &#1079;&#1072; &#1087;&#1088;&#1077;&#1076;&#1077;&#1083;&#1099; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1086;&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1086;&#1081; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1080;, &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1086;&#1073;&#1088;&#1077;&#1079;&#1072;&#1090;&#1100;&#1089;&#1103;;
 </li><li> <b>TextExpandTabs</b> - &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1080; &#1073;&#1091;&#1076;&#1091;&#1090; &#1086;&#1073;&#1088;&#1072;&#1073;&#1072;&#1090;&#1099;&#1074;&#1072;&#1090;&#1100;&#1089;&#1103;;
 </li><li> <b>TextShowMnemonic</b> - &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;, &#1087;&#1077;&#1088;&#1077;&#1076; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1084; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085; &#1079;&#1085;&#1072;&#1082; &amp;, &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1085;&#1091;&#1090;. &#1063;&#1090;&#1086;&#1073;&#1099; &#1074;&#1099;&#1074;&#1077;&#1089;&#1090;&#1080; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &amp;, &#1077;&#1075;&#1086; &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086; &#1091;&#1076;&#1074;&#1086;&#1080;&#1090;&#1100;;
 </li><li> <b>TextWordWrap</b> - &#1077;&#1089;&#1083;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1087;&#1086;&#1084;&#1077;&#1097;&#1072;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072; &#1086;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1077;, &#1090;&#1086; &#1073;&#1091;&#1076;&#1077;&#1090; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1077;&#1076;&#1077;&#1085; &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1087;&#1086; &#1075;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072;&#1084; &#1089;&#1083;&#1086;&#1074;&#1072;;
 </li><li> <b>TextWrapAnywhere</b> - &#1087;&#1077;&#1088;&#1077;&#1085;&#1086;&#1089; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1074;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085; &#1074;&#1085;&#1091;&#1090;&#1088;&#1080; &#1089;&#1083;&#1086;&#1074;&#1072;;
 </li><li> <b>TextHideMnemonic</b> - &#1090;&#1086; &#1078;&#1077; &#1089;&#1072;&#1084;&#1086;&#1077;, &#1095;&#1090;&#1086; &#1080; <b>TextShowMnemonic</b>, &#1085;&#1086; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1085;&#1077; &#1087;&#1086;&#1076;&#1095;&#1077;&#1088;&#1082;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103;;
 </li><li> <b>TextDontPrint</b> - &#1090;&#1077;&#1082;&#1089;&#1090; &#1085;&#1077; &#1073;&#1091;&#1076;&#1077;&#1090; &#1085;&#1072;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1085;;
 </li><li> <b>TextIncludeTrailingSpaces</b> - &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1073;&#1091;&#1076;&#1091;&#1090; &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1090;&#1100;&#1089;&#1103; &#1089; &#1091;&#1095;&#1077;&#1090;&#1086;&#1084; &#1085;&#1072;&#1095;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1080; &#1082;&#1086;&#1085;&#1077;&#1095;&#1085;&#1099;&#1093; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1086;&#1074;, &#1077;&#1089;&#1083;&#1080; &#1090;&#1072;&#1082;&#1086;&#1074;&#1099;&#1077; &#1077;&#1089;&#1090;&#1100; &#1074; &#1090;&#1077;&#1082;&#1089;&#1090;&#1077;;
 </li><li> <b>TextJustificationForced</b> - &#1079;&#1072;&#1076;&#1072;&#1077;&#1090; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1086; &#1096;&#1080;&#1088;&#1080;&#1085;&#1077; &#1076;&#1083;&#1103; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1077;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072;.
</li></ul>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1057;&#1077;&#1076;&#1100;&#1084;&#1086;&#1081; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>drawText()</b> &#1090;&#1072;&#1082;&#1078;&#1077; &#1074;&#1099;&#1074;&#1086;&#1076;&#1080;&#1090; &#1090;&#1077;&#1082;&#1089;&#1090; &#1074; &#1091;&#1082;&#1072;&#1079;&#1072;&#1085;&#1085;&#1091;&#1102; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1091;&#1102; &#1086;&#1073;&#1083;&#1072;&#1089;&#1090;&#1100;, &#1085;&#1086; &#1074;&#1099;&#1088;&#1072;&#1074;&#1085;&#1080;&#1074;&#1072;&#1085;&#1080;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1080; &#1076;&#1088;&#1091;&#1075;&#1080;&#1077; &#1086;&#1087;&#1094;&#1080;&#1080; &#1079;&#1072;&#1076;&#1072;&#1102;&#1090;&#1089;&#1103; &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088;&#1072; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QTextOption</b>. 
&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1089; &#1087;&#1086;&#1084;&#1086;&#1097;&#1100;&#1102; &#1101;&#1090;&#1086;&#1075;&#1086; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; &#1084;&#1086;&#1078;&#1085;&#1086; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1079;&#1080;&#1090;&#1100; &#1085;&#1077;&#1087;&#1077;&#1095;&#1072;&#1090;&#1072;&#1077;&#1084;&#1099;&#1077; &#1089;&#1080;&#1084;&#1074;&#1086;&#1083;&#1099; (&#1089;&#1080;&#1084;&#1074;&#1086;&#1083; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1072;, &#1090;&#1072;&#1073;&#1091;&#1083;&#1103;&#1094;&#1080;&#1102; &#1080; &#1076;&#1088;.).
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1099; &#1080; &#1088;&#1072;&#1079;&#1084;&#1077;&#1088;&#1099; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072;, &#1074; &#1082;&#1086;&#1090;&#1086;&#1088;&#1099;&#1081; &#1074;&#1087;&#1080;&#1089;&#1099;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1090;&#1077;&#1082;&#1089;&#1090;, &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1084;&#1077;&#1090;&#1086;&#1076; <b>boundingRect()</b>. &#1060;&#1086;&#1088;&#1084;&#1072;&#1090;&#1099; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;:
</p><div class="fon"><pre>
boundingRect(&lt;X&gt;, &lt;Y&gt;, &lt;<i>&#1064;&#1080;&#1088;&#1080;&#1085;&#1072;</i>&gt;, &lt;<i>&#1042;&#1099;&#1089;&#1086;&#1090;&#1072;</i>&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
boundingRect(&lt;QRect&gt;, &lt;<i>&#1060;&#1083;&#1072;&#1075;&#1080;</i>&gt;, &lt;<i>&#1058;&#1077;&#1082;&#1089;&#1090;</i>&gt;)
boundingRect(&lt;QRectF&gt;, &lt;&#1060;&#1083;&#1072;&#1075;&#1080;&gt;, &lt;&#1058;&#1077;&#1082;&#1089;&#1090;&gt;)
boundingRect(&lt;QRectF&gt;, &lt;&#1058;&#1077;&#1082;&#1089;&#1090;&gt;[, option=QTextOption()])
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1077;&#1088;&#1074;&#1099;&#1077; &#1076;&#1074;&#1072; &#1092;&#1086;&#1088;&#1084;&#1072;&#1090;&#1072; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072; <b>boundingRect()</b> &#1074;&#1086;&#1079;&#1074;&#1088;&#1072;&#1097;&#1072;&#1102;&#1090; &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRect</b>, &#1072; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1076;&#1074;&#1072; - &#1101;&#1082;&#1079;&#1077;&#1084;&#1087;&#1083;&#1103;&#1088; &#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QRectF</b>.
</p><p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1080; &#1074;&#1099;&#1074;&#1086;&#1076;&#1077; &#1090;&#1077;&#1082;&#1089;&#1090;&#1072; &#1083;&#1080;&#1085;&#1080;&#1080; &#1073;&#1091;&#1082;&#1074; &#1084;&#1086;&#1075;&#1091;&#1090; &#1086;&#1090;&#1086;&#1073;&#1088;&#1072;&#1078;&#1072;&#1090;&#1100;&#1089;&#1103; &#1074; &#1074;&#1080;&#1076;&#1077; "&#1083;&#1077;&#1089;&#1077;&#1085;&#1082;&#1080;". &#1063;&#1090;&#1086;&#1073;&#1099; &#1089;&#1075;&#1083;&#1072;&#1076;&#1080;&#1090;&#1100; &#1082;&#1086;&#1085;&#1090;&#1091;&#1088;&#1099;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1077;&#1090; &#1074;&#1099;&#1079;&#1074;&#1072;&#1090;&#1100; &#1084;&#1077;&#1090;&#1086;&#1076; <b>setRenderHint()</b> &#1080; &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1077;&#1084;&#1091; &#1072;&#1090;&#1088;&#1080;&#1073;&#1091;&#1090; <b>TextAntialiasing</b> 
&#1082;&#1083;&#1072;&#1089;&#1089;&#1072; <b>QPainter</b>. &#1055;&#1088;&#1080;&#1084;&#1077;&#1088;:
</p><div class="fon"><pre>
  painter.setRenderHint(QtGui.QPainter.TextAntialiasing)
</pre></div>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1055;&#1088;&#1086;&#1080;&#1083;&#1083;&#1102;&#1089;&#1090;&#1088;&#1080;&#1088;&#1091;&#1077;&#1084; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1101;&#1090;&#1086;&#1075;&#1086; &#1084;&#1077;&#1090;&#1086;&#1076;&#1072;. &#1044;&#1086;&#1087;&#1086;&#1083;&#1085;&#1080;&#1084; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1077; &#1080;&#1079; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1077;&#1075;&#1086; &#1096;&#1072;&#1075;&#1072;, &#1086;&#1088;&#1075;&#1072;&#1085;&#1080;&#1079;&#1086;&#1074;&#1086;&#1074; &#1074; &#1085;&#1077;&#1084; &#1074;&#1099;&#1087;&#1086;&#1076; &#1087;&#1086;&#1076;&#1087;&#1080;&#1089;&#1077;&#1081; &#1087;&#1086;&#1076; &#1082;&#1072;&#1078;&#1076;&#1099;&#1084; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1086;&#1084; (&#1076;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1085;&#1099;&#1081; &#1082;&#1086;&#1076; &#1086;&#1090;&#1084;&#1077;&#1095;&#1077;&#1085; &#1082;&#1086;&#1084;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1103;&#1084;&#1080;).
</p><div class="fon"><pre>
<span class="sl_sl">import</span> sys
<span class="sl_sl">from</span> PyQt5.QtWidgets <span class="sl_sl">import</span> QWidget, QApplication
<span class="sl_sl">from</span> PyQt5.QtGui <span class="sl_sl">import</span> QPainter, QColor, QBrush

<span class="sl_sl">class</span> <span class="vyvod">Example</span>(QWidget):
    <span class="sl_sl">def</span> <span class="vyvod">__init__</span>(self):
        <span class="comm"># super() - &#1079;&#1072;&#1087;&#1091;&#1089;&#1082; &#1082;&#1086;&#1085;&#1089;&#1090;&#1088;&#1091;&#1082;&#1090;&#1086;&#1088;&#1072;-&#1088;&#1086;&#1076;&#1080;&#1090;&#1077;&#1083;&#1103;</span>
        <span class="tp">super</span>().__init__()
        self.initUI()
    <span class="comm"># &#1043;&#1083;&#1072;&#1074;&#1085;&#1099;&#1081; &#1084;&#1077;&#1090;&#1086;&#1076;</span>
    <span class="sl_sl">def</span> <span class="vyvod">initUI</span>(self):
        self.setGeometry(300, 300, 350, 100)
        self.setWindowTitle(<span class="pech">'&#1055;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1080;'</span>)
        self.show()

    <span class="sl_sl">def</span> <span class="vyvod">paintEvent</span>(self, e):
        qp = QPainter()
        qp.begin(self)
        self.drawRectangles(qp) <span class="comm"># &#1056;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1092;&#1080;&#1075;&#1091;&#1088;</span>

        <span class="comm"># ======== &#1053;&#1072;&#1095;&#1072;&#1083;&#1086; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; ===============</span>
        <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1080;&#1084; &#1085;&#1086;&#1074;&#1086;&#1077; &#1087;&#1077;&#1088;&#1086;</span>
        col = QColor(0, 0, 0) <span class="comm"># &#1063;&#1077;&#1088;&#1085;&#1099;&#1081; &#1094;&#1074;&#1077;&#1090;</span>
        qp.setPen(col) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1087;&#1077;&#1088;&#1072;</span>
        qp.drawText(10, 90, <span class="pech">'1-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        qp.drawText(130, 90, <span class="pech">'2-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        qp.drawText(250, 90, <span class="pech">'3-&#1081; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;'</span>)
        <span class="comm"># ========= &#1050;&#1086;&#1085;&#1077;&#1094; &#1074;&#1089;&#1090;&#1072;&#1074;&#1082;&#1080; ================</span>
        qp.end()

    <span class="sl_sl">def</span> <span class="vyvod">drawRectangles</span>(self, qp):
        col = QColor(0, 0, 0)
        col.setNamedColor(<span class="pech">'#d4d4d4'</span>)
        qp.setPen(col) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1072;&#1088;&#1072;&#1085;&#1076;&#1072;&#1096;&#1072;</span>

        qp.setBrush(QColor(200, 0, 0)) <span class="comm"># &#1059;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1082;&#1072; &#1082;&#1080;&#1089;&#1090;&#1080;</span>
        qp.drawRect(10, 15, 90, 60) <span class="comm"># &#1056;&#1080;&#1089;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1087;&#1088;&#1103;&#1084;&#1086;&#1091;&#1075;&#1086;&#1083;&#1100;&#1085;&#1080;&#1082;&#1072;</span>

        qp.setBrush(QColor(255, 80, 0, 160))
        qp.drawRect(130, 15, 90, 60)

        qp.setBrush(QColor(25, 0, 90, 200))
        qp.drawRect(250, 15, 90, 60)


app = QApplication(sys.argv)
ex = Example()
sys.exit(app.exec_())
</pre></div>
&#1040;&#1088;&#1093;&#1080;&#1074; &#1089; &#1092;&#1072;&#1081;&#1083;&#1086;&#1084; &#1084;&#1086;&#1078;&#1085;&#1086; &#1074;&#1079;&#1103;&#1090;&#1100; <a href="https://it.kgsu.ru/Python_Qt/pr189_1.zip">&#1079;&#1076;&#1077;&#1089;&#1100;</a>.
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085; &#1085;&#1072; &#1088;&#1080;&#1089;&#1091;&#1085;&#1082;&#1077; 1.
</p><p align="CENTER"><img src="images/ris189_1.jpg.jpeg"><br>
<font color="Black">&#1056;&#1080;&#1089;.1. &#1056;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1087;&#1088;&#1080;&#1083;&#1086;&#1078;&#1077;&#1085;&#1080;&#1103;</font></p>
<p align="JUSTIFY">
&#160;&#160;&#160;
&#1053;&#1072; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1077;&#1084; &#1096;&#1072;&#1075;&#1077; &#1084;&#1099; &#1088;&#1072;&#1089;&#1089;&#1084;&#1086;&#1090;&#1088;&#1080;&#1084; <b><i>&#1074;&#1099;&#1074;&#1086;&#1076; &#1080;&#1079;&#1086;&#1073;&#1088;&#1072;&#1078;&#1077;&#1085;&#1080;&#1103;</i></b>.

</p><p align="CENTER"><br><br><br>
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_188.html">&#1055;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav10.html">&#1057;&#1086;&#1076;&#1077;&#1088;&#1078;&#1072;&#1085;&#1080;&#1077;</a> <img src="../images/redball.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/pyqt5_190.html">&#1057;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081; &#1096;&#1072;&#1075;</a>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>