<html>
<!--
* PyWebCopy Engine [version 7.0.2]
* Copyright 2020; Raja Tomar
* File mirrored from [https://it.kgsu.ru/Python_Qt/oglav11.html]
* At UTC datetime: [2023-08-19 10:19:16.842368]
--><head>
<meta http-equiv="Content-Type" content="text/html; charset=windows-1251">
<link rel="stylesheet" href="../menu/dropdown.css" type="text/css">
<script language="JavaScript1.2" src="../menu/menu.js"></script>
<style>
<!--
@import url(./mystyle.css);
-->
</style>
</head>
<body> 
<div id="mnu">
<script language="JavaScript1.2" src="../menu/menu_script.js"></script>
</div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="zag"><div id="animate"></div></div>
<!--&#1047;&#1072;&#1075;&#1086;&#1083;&#1086;&#1074;&#1086;&#1082;-->
<div id="top">
&#1041;&#1080;&#1073;&#1083;&#1080;&#1086;&#1090;&#1077;&#1082;&#1072;<br>
PyQt5
</div>
<!-- &#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1095;&#1072;&#1089;&#1090;&#1100; -->
<div id="bottom">
<p></p>
<p align="CENTER">
<font color="Blue" size="2">
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">1</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">2</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">3</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav3.html">4</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">5</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav5.html">6</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">7</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav7.html">8</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav8.html">9</a> <img src="../images/whitebal.gif">
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">10</a> <img src="../images/whitebal.gif">
<a href="https://it.kgsu.ru/Python_Qt/oglav10.html">11</a> <img src="../images/whitebal.gif"> 
12 <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav12.html">13</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">14</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav14.html">15</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav15.html">16</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">17</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav17.html">18</a> 
</font>

</p><p align="LEFT">
<font color="Blue">
<b>&#1064;&#1072;&#1075; 199. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_199.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;)</a><br>
<b>&#1064;&#1072;&#1075; 200. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_200.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1089;&#1094;&#1077;&#1085;&#1099;</a><br>
<b>&#1064;&#1072;&#1075; 201. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_201.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1080; &#1091;&#1076;&#1072;&#1083;&#1077;&#1085;&#1080;&#1077; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a><br>
<b>&#1064;&#1072;&#1075; 202. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_202.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1044;&#1086;&#1073;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1082;&#1086;&#1084;&#1087;&#1086;&#1085;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1072; &#1089;&#1094;&#1077;&#1085;&#1091;</a><br>
<b>&#1064;&#1072;&#1075; 203. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_203.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1055;&#1086;&#1080;&#1089;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a><br>
<b>&#1064;&#1072;&#1075; 204. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_204.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1092;&#1086;&#1082;&#1091;&#1089;&#1086;&#1084; &#1074;&#1074;&#1086;&#1076;&#1072;</a><br>
<b>&#1064;&#1072;&#1075; 205. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_205.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1059;&#1087;&#1088;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; &#1074;&#1099;&#1076;&#1077;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a><br>
<b>&#1064;&#1072;&#1075; 206. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_206.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsScene</b>: &#1089;&#1094;&#1077;&#1085;&#1072;. &#1055;&#1088;&#1086;&#1095;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099; &#1080; &#1089;&#1080;&#1075;&#1085;&#1072;&#1083;&#1099;</a><br>
<b>&#1064;&#1072;&#1075; 207. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_207.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;)</a><br>
<b>&#1064;&#1072;&#1075; 208. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_208.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103;</a><br>
<b>&#1064;&#1072;&#1075; 209. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_209.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;&#1072;&#1084;&#1080; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; &#1080; &#1089;&#1094;&#1077;&#1085;&#1099;</a><br>
<b>&#1064;&#1072;&#1075; 210. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_210.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1086;&#1080;&#1089;&#1082; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;</a><br>
<b>&#1064;&#1072;&#1075; 211. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_211.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1086;&#1088;&#1076;&#1080;&#1085;&#1072;&#1090;</a><br>
<b>&#1064;&#1072;&#1075; 212. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_212.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsView</b>: &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1077;. &#1055;&#1088;&#1086;&#1095;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</a><br>
<b>&#1064;&#1072;&#1075; 213. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_213.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>: &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1076;&#1083;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074; (&#1086;&#1073;&#1097;&#1080;&#1077; &#1089;&#1074;&#1077;&#1076;&#1077;&#1085;&#1080;&#1103;)</a><br>
<b>&#1064;&#1072;&#1075; 214. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_214.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>: &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1076;&#1083;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1053;&#1072;&#1089;&#1090;&#1088;&#1086;&#1081;&#1082;&#1072; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1072;</a><br>
<b>&#1064;&#1072;&#1075; 215. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_215.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>: &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1076;&#1083;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1042;&#1099;&#1087;&#1086;&#1083;&#1085;&#1077;&#1085;&#1080;&#1077; &#1087;&#1088;&#1077;&#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1081;</a><br>
<b>&#1064;&#1072;&#1075; 216. </b><a href="https://it.kgsu.ru/Python_Qt/pyqt5_216.html">&#1043;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1072;&#1103; &#1089;&#1094;&#1077;&#1085;&#1072;. &#1050;&#1083;&#1072;&#1089;&#1089; <b>QGraphicsItem</b>: &#1073;&#1072;&#1079;&#1086;&#1074;&#1099;&#1081; &#1082;&#1083;&#1072;&#1089;&#1089; &#1076;&#1083;&#1103; &#1075;&#1088;&#1072;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1093; &#1086;&#1073;&#1098;&#1077;&#1082;&#1090;&#1086;&#1074;. &#1055;&#1088;&#1086;&#1095;&#1080;&#1077; &#1084;&#1077;&#1090;&#1086;&#1076;&#1099;</a><br>
<br><br>
</font>
</p><p align="CENTER">
<font color="Blue" size="2">
<a href="https://it.kgsu.ru/Python_Qt/oglav.html">1</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav1.html">2</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav2.html">3</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav3.html">4</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav4.html">5</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav5.html">6</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav6.html">7</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav7.html">8</a> <img src="../images/whitebal.gif"> 
<a href="https://it.kgsu.ru/Python_Qt/oglav8.html">9</a> <img src="../images/whitebal.gif">
<a href="https://it.kgsu.ru/Python_Qt/oglav9.html">10</a> <img src="../images/whitebal.gif">
<a href="https://it.kgsu.ru/Python_Qt/oglav10.html">11</a> <img src="../images/whitebal.gif"> 
12 <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav12.html">13</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav13.html">14</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav14.html">15</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav15.html">16</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav16.html">17</a> <img src="../images/whitebal.gif">  
<a href="https://it.kgsu.ru/Python_Qt/oglav17.html">18</a> 
</font>
</p><p></p>
</div><!--&#1050;&#1086;&#1085;&#1077;&#1094; &#1086;&#1089;&#1085;&#1086;&#1074;&#1085;&#1086;&#1081; &#1095;&#1072;&#1089;&#1090;&#1080;-->
</body>
</html>